"builtin.module"() ({
  "func.func"() <{function_type = (memref<22xi1>, vector<27xf16>, i32) -> (), sym_name = "func1"}> ({
  ^bb0(%arg0: memref<22xi1>, %arg1: vector<27xf16>, %arg2: i32):
    %0 = "arith.constant"() <{value = 515858713 : i64}> : () -> i64
    %1 = "arith.constant"() <{value = -27290 : i16}> : () -> i16
    %2 = "arith.constant"() <{value = 4.182400e+04 : f16}> : () -> f16
    %3 = "arith.constant"() <{value = -32762 : i16}> : () -> i16
    %4 = "arith.constant"() <{value = true}> : () -> i1
    %5 = "arith.constant"() <{value = 8948 : i16}> : () -> i16
    %6 = "arith.constant"() <{value = 1.09343053E+9 : f32}> : () -> f32
    %7 = "arith.constant"() <{value = 1785725212 : i32}> : () -> i32
    %8 = "arith.constant"() <{value = true}> : () -> i1
    %9 = "arith.constant"() <{value = 1.6642999E+9 : f32}> : () -> f32
    %10 = "arith.constant"() <{value = true}> : () -> i1
    %11 = "arith.constant"() <{value = 0x4D68C54C : f32}> : () -> f32
    %12 = "arith.constant"() <{value = 3.096000e+04 : f16}> : () -> f16
    %13 = "arith.constant"() <{value = 234372731 : i64}> : () -> i64
    %14 = "arith.constant"() <{value = 6.416000e+04 : f16}> : () -> f16
    %15 = "arith.constant"() <{value = 1015701890 : i32}> : () -> i32
    %16 = "arith.constant"() <{value = 0 : index}> : () -> index
    %17 = "arith.constant"() <{value = 1 : index}> : () -> index
    %18 = "arith.constant"() <{value = 2 : index}> : () -> index
    %19 = "arith.constant"() <{value = 3 : index}> : () -> index
    %20 = "arith.constant"() <{value = 4 : index}> : () -> index
    %21 = "arith.constant"() <{value = 5 : index}> : () -> index
    %22 = "arith.constant"() <{value = 6 : index}> : () -> index
    %23 = "arith.constant"() <{value = 7 : index}> : () -> index
    %24 = "arith.constant"() <{value = 8 : index}> : () -> index
    %25 = "arith.constant"() <{value = 9 : index}> : () -> index
    %26 = "arith.constant"() <{value = 10 : index}> : () -> index
    %27 = "arith.constant"() <{value = 11 : index}> : () -> index
    %28 = "arith.constant"() <{value = 12 : index}> : () -> index
    %29 = "arith.constant"() <{value = 13 : index}> : () -> index
    %30 = "arith.constant"() <{value = 14 : index}> : () -> index
    %31 = "arith.constant"() <{value = 15 : index}> : () -> index
    %32 = "arith.constant"() <{value = 16 : index}> : () -> index
    %33 = "arith.constant"() <{value = 17 : index}> : () -> index
    %34 = "arith.constant"() <{value = 18 : index}> : () -> index
    %35 = "arith.constant"() <{value = 19 : index}> : () -> index
    %36 = "arith.constant"() <{value = 20 : index}> : () -> index
    %37 = "arith.constant"() <{value = 21 : index}> : () -> index
    %38 = "arith.constant"() <{value = 22 : index}> : () -> index
    %39 = "arith.constant"() <{value = 23 : index}> : () -> index
    %40 = "arith.constant"() <{value = 24 : index}> : () -> index
    %41 = "arith.constant"() <{value = 25 : index}> : () -> index
    %42 = "arith.constant"() <{value = 26 : index}> : () -> index
    %43 = "arith.constant"() <{value = 27 : index}> : () -> index
    %44 = "arith.constant"() <{value = 28 : index}> : () -> index
    %45 = "arith.constant"() <{value = 29 : index}> : () -> index
    %46 = "arith.constant"() <{value = 30 : index}> : () -> index
    %47 = "arith.constant"() <{value = 31 : index}> : () -> index
    %48 = "tensor.empty"(%27) : (index) -> tensor<?xf16>
    %49 = "tensor.empty"(%30, %37) : (index, index) -> tensor<?x?xi64>
    %50 = "tensor.empty"(%18) : (index) -> tensor<?xi64>
    %51 = "tensor.empty"() : () -> tensor<27x27xi16>
    %52 = "tensor.empty"(%44) : (index) -> tensor<?x27xi1>
    %53 = "tensor.empty"(%20) : (index) -> tensor<?xf32>
    %54 = "tensor.empty"() : () -> tensor<22xi1>
    %55 = "tensor.empty"() : () -> tensor<27x4xi32>
    %56 = "tensor.empty"(%35) : (index) -> tensor<?xf16>
    %57 = "tensor.empty"() : () -> tensor<27x27xi16>
    %58 = "tensor.empty"() : () -> tensor<27x27xf32>
    %59 = "tensor.empty"() : () -> tensor<27xi64>
    %60 = "tensor.empty"(%18) : (index) -> tensor<?xf16>
    %61 = "tensor.empty"(%35, %28) : (index, index) -> tensor<?x?xf16>
    %62 = "tensor.empty"() : () -> tensor<27x27xi32>
    %63 = "tensor.empty"() : () -> tensor<22xf16>
    %64 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27x4xi16>
    %65 = "memref.alloc"(%39) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
    %66 = "memref.alloc"(%47) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi32>
    %67 = "memref.alloc"(%24) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xf16>
    %68 = "memref.alloc"(%31) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi32>
    %69 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27xf32>
    %70 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27x27xi64>
    %71 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27x4xi64>
    %72 = "memref.alloc"(%23, %23) <{operandSegmentSizes = array<i32: 2, 0>}> : (index, index) -> memref<?x?xi32>
    %73 = "memref.alloc"(%42) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
    %74 = "memref.alloc"(%16) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
    %75 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27xi1>
    %76 = "memref.alloc"(%21) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x27xi64>
    %77 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<22xi32>
    %78 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27x27xi1>
    %79 = "memref.alloc"(%30) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi32>
    "affine.parallel"() <{lowerBoundsGroups = dense<1> : tensor<2xi32>, lowerBoundsMap = affine_map<() -> (0, 0)>, reductions = [], steps = [1, 1], upperBoundsGroups = dense<1> : tensor<2xi32>, upperBoundsMap = affine_map<() -> (4, 22)>}> ({
    ^bb0(%arg3: index, %arg4: index):
      %223 = "vector.broadcast"(%0) : (i64) -> vector<1xi64>
      %224 = "vector.broadcast"(%0) : (i64) -> vector<1xi64>
      %225 = "vector.contract"(%223, %224, %13) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<and>}> : (vector<1xi64>, vector<1xi64>, i64) -> i64
      "affine.yield"() : () -> ()
    }) : () -> ()
    %80 = "index.floordivs"(%32, %35) : (index, index) -> index
    %81 = "arith.addi"(%8, %10) : (i1, i1) -> i1
    %82 = "arith.subi"(%0, %0) : (i64, i64) -> i64
    %83 = "vector.broadcast"(%0) : (i64) -> vector<1xi64>
    %84 = "vector.multi_reduction"(%83, %0) <{kind = #vector.kind<maxsi>, reduction_dims = [0]}> : (vector<1xi64>, i64) -> i64
    %85 = "vector.insert"(%84, %83) <{static_position = array<i64: 0>}> : (i64, vector<1xi64>) -> vector<1xi64>
    %86 = "spirv.GL.Acos"(%12) : (f16) -> f16
    %87 = "spirv.CL.pow"(%11, %9) : (f32, f32) -> f32
    %88 = "vector.broadcast"(%24) : (index) -> vector<22xindex>
    %89 = "vector.broadcast"(%10) : (i1) -> vector<22xi1>
    %90 = "vector.broadcast"(%7) : (i32) -> vector<22xi32>
    "vector.scatter"(%66, %16, %88, %89, %90) : (memref<?xi32>, index, vector<22xindex>, vector<22xi1>, vector<22xi32>) -> ()
    %91 = "arith.addi"(%4, %4) : (i1, i1) -> i1
    %92 = "arith.divf"(%86, %2) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %93 = "index.castu"(%1) : (i16) -> index
    %94 = "spirv.CL.sqrt"(%86) : (f16) -> f16
    %95 = "spirv.IsNan"(%94) : (f16) -> i1
    %96 = "tensor.empty"() : () -> tensor<27xf32>
    %97 = "linalg.transpose"(%69, %96) <{permutation = array<i64: 0>}> ({
    ^bb0(%arg3: f32, %arg4: f32):
      "linalg.yield"(%arg3) : (f32) -> ()
    }) : (memref<27xf32>, tensor<27xf32>) -> tensor<27xf32>
    %98 = "index.add"(%43, %35) : (index, index) -> index
    "affine.for"() <{lowerBoundMap = affine_map<() -> (0)>, operandSegmentSizes = array<i32: 0, 0, 0>, step = 1 : index, upperBoundMap = affine_map<() -> (100)>}> ({
    ^bb0(%arg3: index):
      "affine.yield"() : () -> ()
    }) : () -> ()
    %99 = "vector.broadcast"(%5) : (i16) -> vector<27x27xi16>
    %100 = "math.exp"(%58) <{fastmath = #arith.fastmath<none>}> : (tensor<27x27xf32>) -> tensor<27x27xf32>
    %101 = "tensor.empty"() : () -> tensor<27x4xi16>
    %102 = "linalg.matmul"(%57, %64, %101) <{operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg3: i16, %arg4: i16, %arg5: i16):
      %223 = "arith.muli"(%arg3, %arg4) : (i16, i16) -> i16
      %224 = "arith.addi"(%arg5, %223) : (i16, i16) -> i16
      "linalg.yield"(%224) : (i16) -> ()
    }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<27x27xi16>, memref<27x4xi16>, tensor<27x4xi16>) -> tensor<27x4xi16>
    %103 = "index.maxu"(%42, %27) : (index, index) -> index
    %104 = "index.maxu"(%19, %19) : (index, index) -> index
    %105 = "vector.contract"(%99, %99, %99) <{indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = [#vector.iterator_type<parallel>, #vector.iterator_type<parallel>, #vector.iterator_type<reduction>], kind = #vector.kind<maxsi>}> : (vector<27x27xi16>, vector<27x27xi16>, vector<27x27xi16>) -> vector<27x27xi16>
    %106 = "tensor.dim"(%49, %17) : (tensor<?x?xi64>, index) -> index
    %107 = "spirv.FUnordLessThanEqual"(%2, %86) : (f16, f16) -> i1
    %108 = "index.divu"(%27, %28) : (index, index) -> index
    %109 = "arith.ori"(%95, %8) : (i1, i1) -> i1
    %110 = "spirv.CL.rint"(%94) : (f16) -> f16
    %111 = "spirv.CL.pow"(%6, %87) : (f32, f32) -> f32
    %112 = "memref.alloc"(%45, %34) <{operandSegmentSizes = array<i32: 2, 0>}> : (index, index) -> memref<?x?xf16>
    "linalg.transpose"(%61, %112) <{permutation = array<i64: 1, 0>}> ({
    ^bb0(%arg3: f16, %arg4: f16):
      "linalg.yield"(%arg3) : (f16) -> ()
    }) : (tensor<?x?xf16>, memref<?x?xf16>) -> ()
    %113 = "spirv.CL.tanh"(%14) : (f16) -> f16
    %114 = "spirv.FUnordEqual"(%6, %87) : (f32, f32) -> i1
    %115 = "spirv.FUnordLessThan"(%111, %9) : (f32, f32) -> i1
    %116 = "arith.andi"(%arg2, %7) : (i32, i32) -> i32
    %117 = "arith.constant"() <{value = 3.433600e+04 : f16}> : () -> f16
    %118 = "spirv.CL.tanh"(%86) : (f16) -> f16
    %119 = "vector.splat"(%104) : (index) -> vector<27x27xindex>
    %120 = "index.and"(%108, %26) : (index, index) -> index
    %121 = "tensor.empty"() : () -> tensor<i1>
    %122 = "linalg.dot"(%75, %75, %121) <{operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg3: i1, %arg4: i1, %arg5: i1):
      %223 = "arith.andi"(%arg3, %arg4) : (i1, i1) -> i1
      %224 = "arith.ori"(%arg5, %223) : (i1, i1) -> i1
      "linalg.yield"(%224) : (i1) -> ()
    }) {linalg.memoized_indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>]} : (memref<27xi1>, memref<27xi1>, tensor<i1>) -> tensor<i1>
    %123 = "math.absi"(%52) : (tensor<?x27xi1>) -> tensor<?x27xi1>
    %124 = "linalg.matmul"(%52, %78, %52) <{operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg3: i1, %arg4: i1, %arg5: i1):
      %223 = "arith.andi"(%arg3, %arg4) : (i1, i1) -> i1
      %224 = "arith.ori"(%arg5, %223) : (i1, i1) -> i1
      "linalg.yield"(%224) : (i1) -> ()
    }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<?x27xi1>, memref<27x27xi1>, tensor<?x27xi1>) -> tensor<?x27xi1>
    %125 = "tensor.extract"(%51, %33, %41) : (tensor<27x27xi16>, index, index) -> i16
    %126 = "vector.load"(%71, %18, %19) : (memref<27x4xi64>, index, index) -> vector<27x4xi64>
    %127 = "affine.parallel"() <{lowerBoundsGroups = dense<1> : tensor<3xi32>, lowerBoundsMap = affine_map<() -> (0, 0, 0)>, reductions = [5], steps = [1, 1, 1], upperBoundsGroups = dense<1> : tensor<3xi32>, upperBoundsMap = affine_map<() -> (4, 27, 22)>}> ({
    ^bb0(%arg3: index, %arg4: index, %arg5: index):
      %223 = "index.sizeof"() : () -> index
      "affine.yield"(%0) : (i64) -> ()
    }) : () -> memref<4x27x22xi64>
    %128 = "spirv.SGreaterThan"(%5, %3) : (i16, i16) -> i1
    %129 = "spirv.GL.SClamp"(%15, %15, %arg2) : (i32, i32, i32) -> i32
    %130 = "spirv.LogicalNotEqual"(%8, %107) : (i1, i1) -> i1
    %131 = "spirv.LogicalOr"(%4, %115) : (i1, i1) -> i1
    %132 = "spirv.GL.FMax"(%11, %111) : (f32, f32) -> f32
    %133 = "spirv.GL.Tan"(%2) : (f16) -> f16
    %134 = "spirv.FOrdLessThan"(%118, %133) : (f16, f16) -> i1
    %135 = "spirv.FUnordLessThan"(%86, %86) : (f16, f16) -> i1
    %136 = "index.ceildivs"(%27, %22) : (index, index) -> index
    %137 = "spirv.CL.erf"(%9) : (f32) -> f32
    %138 = "spirv.GL.Tan"(%12) : (f16) -> f16
    %139 = "vector.broadcast"(%129) : (i32) -> vector<2xi32>
    %140 = "spirv.BitwiseOr"(%139, %139) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %141 = "spirv.IsNan"(%6) : (f32) -> i1
    %142 = "tensor.expand_shape"(%55) <{reassociation = [[0], [1, 2]]}> : (tensor<27x4xi32>) -> tensor<27x4x1xi32>
    %143 = "spirv.CL.u_max"(%15, %15) : (i32, i32) -> i32
    %144 = "spirv.CL.sin"(%137) : (f32) -> f32
    %145 = "index.or"(%43, %44) : (index, index) -> index
    %146 = "spirv.FUnordNotEqual"(%110, %12) : (f16, f16) -> i1
    %147 = "affine.parallel"() <{lowerBoundsGroups = dense<1> : tensor<2xi32>, lowerBoundsMap = affine_map<() -> (0, 0)>, reductions = [2], steps = [1, 1], upperBoundsGroups = dense<1> : tensor<2xi32>, upperBoundsMap = affine_map<() -> (27, 22)>}> ({
    ^bb0(%arg3: index, %arg4: index):
      %223 = "math.exp"(%97) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf32>) -> tensor<27xf32>
      "affine.yield"(%110) : (f16) -> ()
    }) : () -> memref<27x22xf16>
    %148 = "spirv.GL.SClamp"(%7, %7, %7) : (i32, i32, i32) -> i32
    %149 = "math.fma"(%14, %110, %14) <{fastmath = #arith.fastmath<none>}> : (f16, f16, f16) -> f16
    %150 = "memref.alloc"(%37) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x22xf32>
    "linalg.broadcast"(%53, %150) <{dimensions = array<i64: 1>}> ({
    ^bb0(%arg3: f32, %arg4: f32):
      "linalg.yield"(%arg3) : (f32) -> ()
    }) : (tensor<?xf32>, memref<?x22xf32>) -> ()
    "vector.warp_execute_on_lane_0"(%16) <{warp_size = 32 : i64}> ({
      "bufferization.dealloc_tensor"(%49) : (tensor<?x?xi64>) -> ()
      %223 = "math.atan2"(%94, %2) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %224 = "vector.splat"(%4) : (i1) -> vector<22xi1>
      %225 = "math.log10"(%6) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %226 = "index.and"(%40, %16) : (index, index) -> index
      %227 = "affine.parallel"() <{lowerBoundsGroups = dense<1> : tensor<2xi32>, lowerBoundsMap = affine_map<() -> (0, 0)>, reductions = [0], steps = [1, 1], upperBoundsGroups = dense<1> : tensor<2xi32>, upperBoundsMap = affine_map<() -> (22, 22)>}> ({
      ^bb0(%arg3: index, %arg4: index):
        %232 = "vector.multi_reduction"(%139, %148) <{kind = #vector.kind<minui>, reduction_dims = [0]}> : (vector<2xi32>, i32) -> i32
        "affine.yield"(%132) : (f32) -> ()
      }) : () -> memref<22x22xf32>
      %228 = "vector.broadcast"(%20) : (index) -> vector<4xindex>
      %229 = "vector.broadcast"(%134) : (i1) -> vector<4xi1>
      %230 = "vector.broadcast"(%13) : (i64) -> vector<4xi64>
      "vector.scatter"(%71, %31, %18, %228, %229, %230) : (memref<27x4xi64>, index, index, vector<4xindex>, vector<4xi1>, vector<4xi64>) -> ()
      %231 = "index.shru"(%104, %17) : (index, index) -> index
      "vector.yield"() : () -> ()
    }) : (index) -> ()
    %151 = "spirv.CL.pow"(%6, %87) : (f32, f32) -> f32
    %152 = "spirv.CL.rint"(%111) : (f32) -> f32
    %153 = "arith.subi"(%114, %128) : (i1, i1) -> i1
    %154 = "index.bool.constant"() <{value = true}> : () -> i1
    %155 = "spirv.CL.round"(%138) : (f16) -> f16
    %156 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27x27xf32>
    %157 = "vector.broadcast"(%151) : (f32) -> vector<27x4xf32>
    %158 = "vector.broadcast"(%95) : (i1) -> vector<27x4xi1>
    %159 = "vector.broadcast"(%143) : (i32) -> vector<27x4xi32>
    %160 = "vector.gather"(%156, %25, %35, %159, %158, %157) : (memref<27x27xf32>, index, index, vector<27x4xi32>, vector<27x4xi1>, vector<27x4xf32>) -> vector<27x4xf32>
    %161 = "index.mul"(%28, %34) : (index, index) -> index
    %162 = "vector.broadcast"(%8) : (i1) -> vector<1xi1>
    "vector.compressstore"(%76, %16, %27, %162, %83) : (memref<?x27xi64>, index, index, vector<1xi1>, vector<1xi64>) -> ()
    %163 = "math.tan"(%110) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
    %164 = "spirv.IsNan"(%9) : (f32) -> i1
    %165 = "affine.vector_load"(%75, %33) <{map = affine_map<(d0) -> (d0)>}> : (memref<27xi1>, index) -> vector<22xi1>
    %166 = "spirv.GL.SSign"(%129) : (i32) -> i32
    %167 = "math.powf"(%137, %137) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
    %168 = "math.log2"(%152) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %169 = "spirv.GL.Tan"(%133) : (f16) -> f16
    %170 = "arith.remsi"(%129, %143) : (i32, i32) -> i32
    %171 = "tensor.empty"() : () -> tensor<27xi1>
    %172 = "linalg.dot"(%75, %171, %121) <{operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg3: i1, %arg4: i1, %arg5: i1):
      %223 = "arith.andi"(%arg3, %arg4) : (i1, i1) -> i1
      %224 = "arith.ori"(%arg5, %223) : (i1, i1) -> i1
      "linalg.yield"(%224) : (i1) -> ()
    }) : (memref<27xi1>, tensor<27xi1>, tensor<i1>) -> tensor<i1>
    %173 = "spirv.GL.FMin"(%9, %6) : (f32, f32) -> f32
    %174 = "spirv.CL.s_min"(%15, %7) : (i32, i32) -> i32
    %175 = "spirv.BitFieldUExtract"(%139, %7, %0) : (vector<2xi32>, i32, i64) -> vector<2xi32>
    %176 = "spirv.IsInf"(%12) : (f16) -> i1
    %177 = "spirv.CL.s_min"(%143, %7) : (i32, i32) -> i32
    %178 = "spirv.BitwiseAnd"(%139, %139) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %179 = "arith.remf"(%111, %151) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
    %180 = "arith.remui"(%141, %8) : (i1, i1) -> i1
    %181 = "affine.vector_load"(%70, %161, %93) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (memref<27x27xi64>, index, index) -> vector<22xi64>
    %182 = "vector.load"(%77, %36) : (memref<22xi32>, index) -> vector<27xi32>
    %183 = "math.rsqrt"(%152) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %184 = "vector.load"(%112, %16, %16) : (memref<?x?xf16>, index, index) -> vector<27xf16>
    %185 = "spirv.FUnordLessThanEqual"(%169, %133) : (f16, f16) -> i1
    %186 = "vector.broadcast"(%151) : (f32) -> vector<27xf32>
    %187 = "vector.broadcast"(%128) : (i1) -> vector<27xi1>
    %188 = "vector.maskedload"(%69, %18, %187, %186) : (memref<27xf32>, index, vector<27xi1>, vector<27xf32>) -> vector<27xf32>
    %189 = "arith.shrsi"(%84, %84) : (i64, i64) -> i64
    %190 = "linalg.matmul"(%51, %57, %57) <{operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg3: i16, %arg4: i16, %arg5: i16):
      %223 = "arith.muli"(%arg3, %arg4) : (i16, i16) -> i16
      %224 = "arith.addi"(%arg5, %223) : (i16, i16) -> i16
      "linalg.yield"(%224) : (i16) -> ()
    }) : (tensor<27x27xi16>, tensor<27x27xi16>, tensor<27x27xi16>) -> tensor<27x27xi16>
    %191 = "spirv.GL.UMax"(%13, %13) : (i64, i64) -> i64
    %192 = "vector.splat"(%42) : (index) -> vector<27x27xindex>
    %193 = "vector.insertelement"(%12, %184, %46) : (f16, vector<27xf16>, index) -> vector<27xf16>
    %194 = "spirv.FUnordNotEqual"(%137, %11) : (f32, f32) -> i1
    %195 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<22xf16>
    %196 = "tensor.empty"() : () -> tensor<f16>
    %197 = "linalg.dot"(%63, %195, %196) <{operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg3: f16, %arg4: f16, %arg5: f16):
      %223 = "arith.mulf"(%arg3, %arg4) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %224 = "arith.addf"(%arg5, %223) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      "linalg.yield"(%224) : (f16) -> ()
    }) : (tensor<22xf16>, memref<22xf16>, tensor<f16>) -> tensor<f16>
    %198 = "spirv.GL.FAbs"(%152) : (f32) -> f32
    %199 = "spirv.CL.tanh"(%138) : (f16) -> f16
    %200 = "scf.while"(%49) ({
    ^bb0(%arg3: tensor<?x?xi64>):
      "memref.store"(%3, %65, %16) <{nontemporal = false}> : (i16, memref<?xi16>, index) -> ()
      %223 = "math.ctlz"(%arg3) : (tensor<?x?xi64>) -> tensor<?x?xi64>
      %224 = "vector.matrix_multiply"(%182, %182) <{lhs_columns = 27 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<27xi32>, vector<27xi32>) -> vector<1xi32>
      %225 = "affine.load"(%77, %33) <{map = affine_map<(d0) -> (d0)>}> : (memref<22xi32>, index) -> i32
      %226 = "vector.bitcast"(%126) : (vector<27x4xi64>) -> vector<27x4xi64>
      %227 = "vector.broadcast"(%191) : (i64) -> vector<1x1xi64>
      %228 = "vector.outerproduct"(%83, %83, %227) <{kind = #vector.kind<minsi>}> : (vector<1xi64>, vector<1xi64>, vector<1x1xi64>) -> vector<1x1xi64>
      %229 = "arith.xori"(%164, %115) : (i1, i1) -> i1
      %230 = "math.ipowi"(%174, %129) : (i32, i32) -> i32
      %231 = "tensor.empty"(%30, %106) : (index, index) -> tensor<?x?xi64>
      "scf.condition"(%115, %231) : (i1, tensor<?x?xi64>) -> ()
    }, {
    ^bb0(%arg3: tensor<?x?xi64>):
      %223 = "index.shrs"(%104, %33) : (index, index) -> index
      %224 = "index.and"(%42, %20) : (index, index) -> index
      %225 = "tensor.collapse_shape"(%52) <{reassociation = [[0, 1]]}> : (tensor<?x27xi1>) -> tensor<?xi1>
      %226 = "vector.create_mask"(%36) : (index) -> vector<22xi1>
      %227 = "vector.extract_strided_slice"(%157) <{offsets = [24], sizes = [1], strides = [1]}> : (vector<27x4xf32>) -> vector<1x4xf32>
      %228 = "math.copysign"(%11, %151) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %229 = "arith.remui"(%arg2, %148) : (i32, i32) -> i32
      %230 = "arith.remsi"(%154, %146) : (i1, i1) -> i1
      %231 = "tensor.insert"(%125, %57, %32, %23) : (i16, tensor<27x27xi16>, index, index) -> tensor<27x27xi16>
      %232 = "math.sqrt"(%56) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
      "bufferization.dealloc_tensor"(%197) : (tensor<f16>) -> ()
      %233 = "arith.xori"(%125, %1) : (i16, i16) -> i16
      %234 = "math.absi"(%52) : (tensor<?x27xi1>) -> tensor<?x27xi1>
      %235 = "vector.transpose"(%158) <{transp = [0, 1]}> : (vector<27x4xi1>) -> vector<27x4xi1>
      %236 = "arith.remsi"(%15, %166) : (i32, i32) -> i32
      %237 = "tensor.rank"(%97) : (tensor<27xf32>) -> index
      %238 = "tensor.empty"(%42, %17) : (index, index) -> tensor<?x?xi64>
      "scf.yield"(%238) : (tensor<?x?xi64>) -> ()
    }) : (tensor<?x?xi64>) -> tensor<?x?xi64>
    %201 = "spirv.LogicalNot"(%134) : (i1) -> i1
    %202 = "math.powf"(%86, %155) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %203 = "memref.cast"(%67) : (memref<?xf16>) -> memref<22xf16>
    %204 = "spirv.GL.SAbs"(%15) : (i32) -> i32
    %205 = "vector.broadcast"(%176) : (i1) -> vector<27x27xi1>
    %206 = "vector.broadcast"(%204) : (i32) -> vector<27x27xi32>
    %207 = "vector.gather"(%arg0, %106, %206, %205, %205) : (memref<22xi1>, index, vector<27x27xi32>, vector<27x27xi1>, vector<27x27xi1>) -> vector<27x27xi1>
    %208 = "vector.broadcast"(%194) : (i1) -> vector<1xi1>
    %209 = "vector.mask"(%208) ({
      %223 = "vector.multi_reduction"(%83, %83) <{kind = #vector.kind<maxui>, reduction_dims = []}> : (vector<1xi64>, vector<1xi64>) -> vector<1xi64>
      "vector.yield"(%223) : (vector<1xi64>) -> ()
    }) : (vector<1xi1>) -> vector<1xi64>
    %210 = "spirv.IsInf"(%14) : (f16) -> i1
    %211 = "spirv.BitwiseOr"(%139, %139) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %212 = "spirv.LogicalAnd"(%95, %95) : (i1, i1) -> i1
    %213 = "vector.create_mask"(%46, %46) : (index, index) -> vector<27x27xi1>
    %214 = "vector.load"(%72, %16, %16) : (memref<?x?xi32>, index, index) -> vector<27x4xi32>
    %215 = "spirv.UGreaterThanEqual"(%148, %174) : (i32, i32) -> i1
    %216 = "spirv.FUnordLessThanEqual"(%6, %152) : (f32, f32) -> i1
    %217 = "vector.broadcast"(%145) : (index) -> vector<22xindex>
    "vector.scatter"(%70, %31, %38, %217, %165, %181) : (memref<27x27xi64>, index, index, vector<22xindex>, vector<22xi1>, vector<22xi64>) -> ()
    %218 = "spirv.GL.UMax"(%177, %143) : (i32, i32) -> i32
    %219 = "arith.muli"(%3, %1) : (i16, i16) -> i16
    "vector.compressstore"(%78, %23, %40, %208, %208) : (memref<27x27xi1>, index, index, vector<1xi1>, vector<1xi1>) -> ()
    %220 = "spirv.BitCount"(%174) : (i32) -> i32
    %221 = "spirv.SLessThan"(%arg2, %arg2) : (i32, i32) -> i1
    %222 = "spirv.SGreaterThanEqual"(%13, %13) : (i64, i64) -> i1
    "vector.print"(%83) <{punctuation = #vector.punctuation<newline>}> : (vector<1xi64>) -> ()
    "vector.print"(%99) <{punctuation = #vector.punctuation<newline>}> : (vector<27x27xi16>) -> ()
    "vector.print"(%126) <{punctuation = #vector.punctuation<newline>}> : (vector<27x4xi64>) -> ()
    "vector.print"(%139) <{punctuation = #vector.punctuation<newline>}> : (vector<2xi32>) -> ()
    "vector.print"(%157) <{punctuation = #vector.punctuation<newline>}> : (vector<27x4xf32>) -> ()
    "vector.print"(%158) <{punctuation = #vector.punctuation<newline>}> : (vector<27x4xi1>) -> ()
    "vector.print"(%159) <{punctuation = #vector.punctuation<newline>}> : (vector<27x4xi32>) -> ()
    "vector.print"(%160) <{punctuation = #vector.punctuation<newline>}> : (vector<27x4xf32>) -> ()
    "vector.print"(%165) <{punctuation = #vector.punctuation<newline>}> : (vector<22xi1>) -> ()
    "vector.print"(%181) <{punctuation = #vector.punctuation<newline>}> : (vector<22xi64>) -> ()
    "vector.print"(%182) <{punctuation = #vector.punctuation<newline>}> : (vector<27xi32>) -> ()
    "vector.print"(%184) <{punctuation = #vector.punctuation<newline>}> : (vector<27xf16>) -> ()
    "vector.print"(%186) <{punctuation = #vector.punctuation<newline>}> : (vector<27xf32>) -> ()
    "vector.print"(%187) <{punctuation = #vector.punctuation<newline>}> : (vector<27xi1>) -> ()
    "vector.print"(%188) <{punctuation = #vector.punctuation<newline>}> : (vector<27xf32>) -> ()
    "vector.print"(%205) <{punctuation = #vector.punctuation<newline>}> : (vector<27x27xi1>) -> ()
    "vector.print"(%206) <{punctuation = #vector.punctuation<newline>}> : (vector<27x27xi32>) -> ()
    "vector.print"(%207) <{punctuation = #vector.punctuation<newline>}> : (vector<27x27xi1>) -> ()
    "vector.print"(%208) <{punctuation = #vector.punctuation<newline>}> : (vector<1xi1>) -> ()
    "vector.print"(%213) <{punctuation = #vector.punctuation<newline>}> : (vector<27x27xi1>) -> ()
    "vector.print"(%214) <{punctuation = #vector.punctuation<newline>}> : (vector<27x4xi32>) -> ()
    "vector.print"(%arg2) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%0) <{punctuation = #vector.punctuation<newline>}> : (i64) -> ()
    "vector.print"(%1) <{punctuation = #vector.punctuation<newline>}> : (i16) -> ()
    "vector.print"(%2) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%3) <{punctuation = #vector.punctuation<newline>}> : (i16) -> ()
    "vector.print"(%4) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%5) <{punctuation = #vector.punctuation<newline>}> : (i16) -> ()
    "vector.print"(%6) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%7) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%8) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%9) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%10) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%11) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%12) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%13) <{punctuation = #vector.punctuation<newline>}> : (i64) -> ()
    "vector.print"(%14) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%15) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%84) <{punctuation = #vector.punctuation<newline>}> : (i64) -> ()
    "vector.print"(%86) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%87) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%94) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%95) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%107) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%110) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%111) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%113) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%114) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%115) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%118) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%125) <{punctuation = #vector.punctuation<newline>}> : (i16) -> ()
    "vector.print"(%128) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%129) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%130) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%131) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%132) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%133) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%134) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%135) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%137) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%138) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%141) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%143) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%144) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%146) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%148) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%151) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%152) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%154) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%155) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%164) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%166) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%169) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%173) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%174) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%176) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%177) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%185) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%191) <{punctuation = #vector.punctuation<newline>}> : (i64) -> ()
    "vector.print"(%194) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%198) <{punctuation = #vector.punctuation<newline>}> : (f32) -> ()
    "vector.print"(%199) <{punctuation = #vector.punctuation<newline>}> : (f16) -> ()
    "vector.print"(%201) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%204) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%210) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%212) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%215) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%216) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%218) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%220) <{punctuation = #vector.punctuation<newline>}> : (i32) -> ()
    "vector.print"(%221) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "vector.print"(%222) <{punctuation = #vector.punctuation<newline>}> : (i1) -> ()
    "func.return"() : () -> ()
  }) : () -> ()
  "func.func"() <{function_type = (memref<?xf32>) -> (), sym_name = "func2"}> ({
  ^bb0(%arg0: memref<?xf32>):
    %0 = "arith.constant"() <{value = 515858713 : i64}> : () -> i64
    %1 = "arith.constant"() <{value = -27290 : i16}> : () -> i16
    %2 = "arith.constant"() <{value = 4.182400e+04 : f16}> : () -> f16
    %3 = "arith.constant"() <{value = -32762 : i16}> : () -> i16
    %4 = "arith.constant"() <{value = true}> : () -> i1
    %5 = "arith.constant"() <{value = 8948 : i16}> : () -> i16
    %6 = "arith.constant"() <{value = 1.09343053E+9 : f32}> : () -> f32
    %7 = "arith.constant"() <{value = 1785725212 : i32}> : () -> i32
    %8 = "arith.constant"() <{value = true}> : () -> i1
    %9 = "arith.constant"() <{value = 1.6642999E+9 : f32}> : () -> f32
    %10 = "arith.constant"() <{value = true}> : () -> i1
    %11 = "arith.constant"() <{value = 0x4D68C54C : f32}> : () -> f32
    %12 = "arith.constant"() <{value = 3.096000e+04 : f16}> : () -> f16
    %13 = "arith.constant"() <{value = 234372731 : i64}> : () -> i64
    %14 = "arith.constant"() <{value = 6.416000e+04 : f16}> : () -> f16
    %15 = "arith.constant"() <{value = 1015701890 : i32}> : () -> i32
    %16 = "arith.constant"() <{value = 0 : index}> : () -> index
    %17 = "arith.constant"() <{value = 1 : index}> : () -> index
    %18 = "arith.constant"() <{value = 2 : index}> : () -> index
    %19 = "arith.constant"() <{value = 3 : index}> : () -> index
    %20 = "arith.constant"() <{value = 4 : index}> : () -> index
    %21 = "arith.constant"() <{value = 5 : index}> : () -> index
    %22 = "arith.constant"() <{value = 6 : index}> : () -> index
    %23 = "arith.constant"() <{value = 7 : index}> : () -> index
    %24 = "arith.constant"() <{value = 8 : index}> : () -> index
    %25 = "arith.constant"() <{value = 9 : index}> : () -> index
    %26 = "arith.constant"() <{value = 10 : index}> : () -> index
    %27 = "arith.constant"() <{value = 11 : index}> : () -> index
    %28 = "arith.constant"() <{value = 12 : index}> : () -> index
    %29 = "arith.constant"() <{value = 13 : index}> : () -> index
    %30 = "arith.constant"() <{value = 14 : index}> : () -> index
    %31 = "arith.constant"() <{value = 15 : index}> : () -> index
    %32 = "arith.constant"() <{value = 16 : index}> : () -> index
    %33 = "arith.constant"() <{value = 17 : index}> : () -> index
    %34 = "arith.constant"() <{value = 18 : index}> : () -> index
    %35 = "arith.constant"() <{value = 19 : index}> : () -> index
    %36 = "arith.constant"() <{value = 20 : index}> : () -> index
    %37 = "arith.constant"() <{value = 21 : index}> : () -> index
    %38 = "arith.constant"() <{value = 22 : index}> : () -> index
    %39 = "arith.constant"() <{value = 23 : index}> : () -> index
    %40 = "arith.constant"() <{value = 24 : index}> : () -> index
    %41 = "arith.constant"() <{value = 25 : index}> : () -> index
    %42 = "arith.constant"() <{value = 26 : index}> : () -> index
    %43 = "arith.constant"() <{value = 27 : index}> : () -> index
    %44 = "arith.constant"() <{value = 28 : index}> : () -> index
    %45 = "arith.constant"() <{value = 29 : index}> : () -> index
    %46 = "arith.constant"() <{value = 30 : index}> : () -> index
    %47 = "arith.constant"() <{value = 31 : index}> : () -> index
    %48 = "tensor.empty"(%27) : (index) -> tensor<?xf16>
    %49 = "tensor.empty"(%30, %37) : (index, index) -> tensor<?x?xi64>
    %50 = "tensor.empty"(%18) : (index) -> tensor<?xi64>
    %51 = "tensor.empty"() : () -> tensor<27x27xi16>
    %52 = "tensor.empty"(%44) : (index) -> tensor<?x27xi1>
    %53 = "tensor.empty"(%20) : (index) -> tensor<?xf32>
    %54 = "tensor.empty"() : () -> tensor<22xi1>
    %55 = "tensor.empty"() : () -> tensor<27x4xi32>
    %56 = "tensor.empty"(%35) : (index) -> tensor<?xf16>
    %57 = "tensor.empty"() : () -> tensor<27x27xi16>
    %58 = "tensor.empty"() : () -> tensor<27x27xf32>
    %59 = "tensor.empty"() : () -> tensor<27xi64>
    %60 = "tensor.empty"(%18) : (index) -> tensor<?xf16>
    %61 = "tensor.empty"(%35, %28) : (index, index) -> tensor<?x?xf16>
    %62 = "tensor.empty"() : () -> tensor<27x27xi32>
    %63 = "tensor.empty"() : () -> tensor<22xf16>
    %64 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27x4xi16>
    %65 = "memref.alloc"(%39) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
    %66 = "memref.alloc"(%47) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi32>
    %67 = "memref.alloc"(%24) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xf16>
    %68 = "memref.alloc"(%31) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi32>
    %69 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27xf32>
    %70 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27x27xi64>
    %71 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27x4xi64>
    %72 = "memref.alloc"(%23, %23) <{operandSegmentSizes = array<i32: 2, 0>}> : (index, index) -> memref<?x?xi32>
    %73 = "memref.alloc"(%42) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
    %74 = "memref.alloc"(%16) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
    %75 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27xi1>
    %76 = "memref.alloc"(%21) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x27xi64>
    %77 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<22xi32>
    %78 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27x27xi1>
    %79 = "memref.alloc"(%30) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi32>
    "vector.warp_execute_on_lane_0"(%16) <{warp_size = 32 : i64}> ({
      %218 = "index.casts"(%46) : (index) -> i32
      "affine.store"(%10, %75, %30) <{map = affine_map<(d0) -> (d0)>}> : (i1, memref<27xi1>, index) -> ()
      %219 = "bufferization.clone"(%75) : (memref<27xi1>) -> memref<27xi1>
      %220 = "bufferization.to_memref"(%58) : (tensor<27x27xf32>) -> memref<27x27xf32>
      %221 = "vector.broadcast"(%1) : (i16) -> vector<4xi16>
      %222 = "vector.broadcast"(%8) : (i1) -> vector<4xi1>
      %223 = "vector.maskedload"(%65, %16, %222, %221) : (memref<?xi16>, index, vector<4xi1>, vector<4xi16>) -> vector<4xi16>
      %224 = "vector.mask"(%222) ({
        %228 = "vector.multi_reduction"(%223, %223) <{kind = #vector.kind<or>, reduction_dims = []}> : (vector<4xi16>, vector<4xi16>) -> vector<4xi16>
        "vector.yield"(%228) : (vector<4xi16>) -> ()
      }) : (vector<4xi1>) -> vector<4xi16>
      %225 = "vector.broadcast"(%33) : (index) -> vector<27xindex>
      %226 = "vector.broadcast"(%10) : (i1) -> vector<27xi1>
      %227 = "vector.broadcast"(%5) : (i16) -> vector<27xi16>
      "vector.scatter"(%73, %16, %225, %226, %227) : (memref<?xi16>, index, vector<27xindex>, vector<27xi1>, vector<27xi16>) -> ()
      "affine.for"() <{lowerBoundMap = affine_map<() -> (0)>, operandSegmentSizes = array<i32: 0, 0, 0>, step = 1 : index, upperBoundMap = affine_map<() -> (72)>}> ({
      ^bb0(%arg1: index):
        "affine.yield"() : () -> ()
      }) : () -> ()
      "vector.yield"() : () -> ()
    }) : (index) -> ()
    %80 = "spirv.GL.SSign"(%13) : (i64) -> i64
    %81 = "spirv.GL.FAbs"(%9) : (f32) -> f32
    %82 = "vector.broadcast"(%7) : (i32) -> vector<2xi32>
    %83 = "spirv.BitwiseOr"(%82, %82) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %84 = "arith.constant"() <{value = 958680519 : i32}> : () -> i32
    %85 = "index.castu"(%7) : (i32) -> index
    %86 = "spirv.CL.log"(%9) : (f32) -> f32
    %87 = "vector.extract_strided_slice"(%82) <{offsets = [0], sizes = [2], strides = [1]}> : (vector<2xi32>) -> vector<2xi32>
    %88 = "scf.while"(%59) ({
    ^bb0(%arg1: tensor<27xi64>):
      %218 = "math.fma"(%63, %63, %63) <{fastmath = #arith.fastmath<none>}> : (tensor<22xf16>, tensor<22xf16>, tensor<22xf16>) -> tensor<22xf16>
      %219 = "math.cttz"(%1) : (i16) -> i16
      %220 = "math.log"(%58) <{fastmath = #arith.fastmath<none>}> : (tensor<27x27xf32>) -> tensor<27x27xf32>
      %221 = "index.ceildivs"(%28, %39) : (index, index) -> index
      "memref.store"(%3, %73, %16) <{nontemporal = false}> : (i16, memref<?xi16>, index) -> ()
      "scf.if"(%8) ({
        %226 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<4x27xi32>
        "linalg.transpose"(%55, %226) <{permutation = array<i64: 1, 0>}> ({
        ^bb0(%arg2: i32, %arg3: i32):
          "linalg.yield"(%arg2) : (i32) -> ()
        }) : (tensor<27x4xi32>, memref<4x27xi32>) -> ()
        %227 = "vector.multi_reduction"(%82, %15) <{kind = #vector.kind<minsi>, reduction_dims = [0]}> : (vector<2xi32>, i32) -> i32
        %228 = "arith.minsi"(%4, %8) : (i1, i1) -> i1
        %229 = "math.ctpop"(%80) : (i64) -> i64
        %230 = "tensor.collapse_shape"(%58) <{reassociation = [[0, 1]]}> : (tensor<27x27xf32>) -> tensor<729xf32>
        %231 = "math.log"(%11) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %232 = "math.absi"(%50) : (tensor<?xi64>) -> tensor<?xi64>
        %233 = "vector.create_mask"(%28, %19) : (index, index) -> vector<27x27xi1>
        "scf.yield"() : () -> ()
      }, {
        %226 = "math.log"(%14) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %227 = "arith.divf"(%9, %11) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %228 = "math.roundeven"(%2) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %229 = "tensor.empty"() : () -> tensor<f16>
        %230 = "linalg.dot"(%63, %63, %229) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg2: f16, %arg3: f16, %arg4: f16):
          %234 = "arith.mulf"(%arg2, %arg3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
          %235 = "arith.addf"(%arg4, %234) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
          "linalg.yield"(%235) : (f16) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>]} : (tensor<22xf16>, tensor<22xf16>, tensor<f16>) -> tensor<f16>
        "vector.print"(%87) <{punctuation = #vector.punctuation<newline>}> : (vector<2xi32>) -> ()
        %231 = "arith.xori"(%4, %4) : (i1, i1) -> i1
        %232 = "arith.xori"(%15, %7) : (i32, i32) -> i32
        %233 = "vector.insertelement"(%15, %82, %46) : (i32, vector<2xi32>, index) -> vector<2xi32>
        "scf.yield"() : () -> ()
      }) : (i1) -> ()
      %222 = "vector.broadcast"(%8) : (i1) -> vector<22x22xi1>
      %223 = "vector.broadcast"(%8) : (i1) -> vector<22xi1>
      %224:2 = "vector.scan"(%222, %223) <{inclusive = false, kind = #vector.kind<maxsi>, reduction_dim = 1 : i64}> : (vector<22x22xi1>, vector<22xi1>) -> (vector<22x22xi1>, vector<22xi1>)
      %225 = "math.powf"(%86, %9) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      "scf.condition"(%4, %59) : (i1, tensor<27xi64>) -> ()
    }, {
    ^bb0(%arg1: tensor<27xi64>):
      %218 = "affine.max"(%27, %32, %20) <{map = affine_map<(d0, d1)[s0] -> (-(-(d1 mod 8) - 4))>}> : (index, index, index) -> index
      %219 = "arith.remf"(%86, %6) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %220 = "index.and"(%36, %35) : (index, index) -> index
      %221 = "tensor.empty"() : () -> tensor<27xi64>
      %222 = "linalg.map"(%59, %59, %59, %221) ({
      ^bb0(%arg2: i64, %arg3: i64, %arg4: i64):
        %236 = "math.roundeven"(%48) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
        %237 = "index.castu"(%13) : (i64) -> index
        %238 = "math.rsqrt"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<?x?xf16>) -> tensor<?x?xf16>
        "memref.copy"(%69, %69) : (memref<27xf32>, memref<27xf32>) -> ()
        "memref.assume_alignment"(%78) <{alignment = 16 : i32}> : (memref<27x27xi1>) -> ()
        %239 = "affine.vector_load"(%73, %37) <{map = affine_map<(d0) -> (d0)>}> : (memref<?xi16>, index) -> vector<4xi16>
        %240 = "memref.cast"(%78) : (memref<27x27xi1>) -> memref<?x?xi1>
        %241 = "vector.broadcast"(%4) : (i1) -> vector<2xi1>
        %242 = "vector.mask"(%241) ({
          %268 = "vector.multi_reduction"(%87, %82) <{kind = #vector.kind<xor>, reduction_dims = []}> : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
          "vector.yield"(%268) : (vector<2xi32>) -> ()
        }) : (vector<2xi1>) -> vector<2xi32>
        %243 = "math.powf"(%63, %63) <{fastmath = #arith.fastmath<none>}> : (tensor<22xf16>, tensor<22xf16>) -> tensor<22xf16>
        %244 = "vector.broadcast"(%45) : (index) -> vector<22xindex>
        %245 = "vector.broadcast"(%10) : (i1) -> vector<22xi1>
        %246 = "vector.broadcast"(%13) : (i64) -> vector<22xi64>
        "vector.scatter"(%71, %30, %18, %244, %245, %246) : (memref<27x4xi64>, index, index, vector<22xindex>, vector<22xi1>, vector<22xi64>) -> ()
        %247 = "math.exp"(%58) <{fastmath = #arith.fastmath<none>}> : (tensor<27x27xf32>) -> tensor<27x27xf32>
        %248 = "arith.xori"(%13, %arg3) : (i64, i64) -> i64
        %249 = "arith.floordivsi"(%4, %8) : (i1, i1) -> i1
        %250 = "arith.negf"(%86) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %251 = "vector.reduction"(%82) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<minui>}> : (vector<2xi32>) -> i32
        %252 = "linalg.transpose"(%54, %54) <{permutation = array<i64: 0>}> ({
        ^bb0(%arg5: i1, %arg6: i1):
          "linalg.yield"(%arg5) : (i1) -> ()
        }) : (tensor<22xi1>, tensor<22xi1>) -> tensor<22xi1>
        %253 = "arith.minsi"(%1, %1) : (i16, i16) -> i16
        "memref.assume_alignment"(%arg0) <{alignment = 8 : i32}> : (memref<?xf32>) -> ()
        %254 = "index.bool.constant"() <{value = true}> : () -> i1
        %255 = "math.ctpop"(%54) : (tensor<22xi1>) -> tensor<22xi1>
        %256 = "math.log"(%81) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %257 = "bufferization.clone"(%64) : (memref<27x4xi16>) -> memref<27x4xi16>
        %258 = "arith.subi"(%15, %15) : (i32, i32) -> i32
        %259 = "math.ipowi"(%62, %62) : (tensor<27x27xi32>, tensor<27x27xi32>) -> tensor<27x27xi32>
        %260 = "vector.insertelement"(%5, %239, %43) : (i16, vector<4xi16>, index) -> vector<4xi16>
        %261 = "arith.constant"() <{value = 11636 : i16}> : () -> i16
        %262 = "arith.andi"(%4, %8) : (i1, i1) -> i1
        %263 = "arith.xori"(%arg3, %13) : (i64, i64) -> i64
        %264 = "arith.divsi"(%4, %254) : (i1, i1) -> i1
        %265 = "index.shrs"(%16, %31) : (index, index) -> index
        %266 = "arith.addf"(%6, %11) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %267 = "vector.load"(%67, %16) : (memref<?xf16>, index) -> vector<27x27xf16>
        "linalg.yield"(%arg4) : (i64) -> ()
      }) : (tensor<27xi64>, tensor<27xi64>, tensor<27xi64>, tensor<27xi64>) -> tensor<27xi64>
      %223 = "tensor.empty"() : () -> tensor<108xi32>
      %224 = "tensor.unpack"(%55, %223, %20) <{inner_dims_pos = array<i64: 0>, outer_dims_perm = array<i64: 0>, static_inner_tiles = array<i64: -9223372036854775808>}> : (tensor<27x4xi32>, tensor<108xi32>, index) -> tensor<108xi32>
      %225 = "arith.xori"(%13, %13) : (i64, i64) -> i64
      %226 = "math.cttz"(%51) : (tensor<27x27xi16>) -> tensor<27x27xi16>
      %227 = "math.exp"(%81) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %228 = "arith.mulf"(%12, %12) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %229 = "vector.broadcast"(%8) : (i1) -> vector<2xi1>
      %230 = "vector.mask"(%229) ({
        %236 = "vector.multi_reduction"(%82, %87) <{kind = #vector.kind<and>, reduction_dims = []}> : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
        "vector.yield"(%236) : (vector<2xi32>) -> ()
      }) : (vector<2xi1>) -> vector<2xi32>
      %231 = "arith.cmpf"(%2, %14) <{predicate = 8 : i64}> : (f16, f16) -> i1
      %232 = "math.cos"(%11) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      "scf.index_switch"(%40) <{cases = array<i64: 1, 2>}> ({
        "memref.store"(%3, %64, %36, %16) <{nontemporal = false}> : (i16, memref<27x4xi16>, index, index) -> ()
        %236 = "arith.constant"() <{value = 2133960247 : i64}> : () -> i64
        %237 = "index.shl"(%43, %18) : (index, index) -> index
        %238 = "math.log2"(%81) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %239 = "math.log"(%81) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %240 = "math.exp"(%48) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
        %241 = "index.shl"(%39, %25) : (index, index) -> index
        "memref.assume_alignment"(%75) <{alignment = 4 : i32}> : (memref<27xi1>) -> ()
        %242 = "arith.cmpf"(%14, %12) <{predicate = 4 : i64}> : (f16, f16) -> i1
