"builtin.module"() ({
  "func.func"() <{function_type = (tensor<19x29xi64>) -> (), sym_name = "func1", sym_visibility = "nested"}> ({
  ^bb0(%arg0: tensor<19x29xi64>):
    %0 = "arith.constant"() <{value = 5.484800e+04 : f16}> : () -> f16
    %1 = "arith.constant"() <{value = 27095 : i16}> : () -> i16
    %2 = "arith.constant"() <{value = 0x4DE956D6 : f32}> : () -> f32
    %3 = "arith.constant"() <{value = -8011 : i16}> : () -> i16
    %4 = "arith.constant"() <{value = -25992 : i16}> : () -> i16
    %5 = "arith.constant"() <{value = 6.788000e+03 : f16}> : () -> f16
    %6 = "arith.constant"() <{value = 1.49357018E+9 : f32}> : () -> f32
    %7 = "arith.constant"() <{value = 1.72445862E+9 : f32}> : () -> f32
    %8 = "arith.constant"() <{value = 939857957 : i64}> : () -> i64
    %9 = "arith.constant"() <{value = 2032878246 : i64}> : () -> i64
    %10 = "arith.constant"() <{value = 9.592000e+03 : f16}> : () -> f16
    %11 = "arith.constant"() <{value = 1078630833 : i64}> : () -> i64
    %12 = "arith.constant"() <{value = 2.299200e+04 : f16}> : () -> f16
    %13 = "arith.constant"() <{value = 4.057600e+04 : f16}> : () -> f16
    %14 = "arith.constant"() <{value = 560718294 : i32}> : () -> i32
    %15 = "arith.constant"() <{value = 1175396684 : i32}> : () -> i32
    %16 = "arith.constant"() <{value = 0 : index}> : () -> index
    %17 = "arith.constant"() <{value = 1 : index}> : () -> index
    %18 = "arith.constant"() <{value = 2 : index}> : () -> index
    %19 = "arith.constant"() <{value = 3 : index}> : () -> index
    %20 = "arith.constant"() <{value = 4 : index}> : () -> index
    %21 = "arith.constant"() <{value = 5 : index}> : () -> index
    %22 = "arith.constant"() <{value = 6 : index}> : () -> index
    %23 = "arith.constant"() <{value = 7 : index}> : () -> index
    %24 = "arith.constant"() <{value = 8 : index}> : () -> index
    %25 = "arith.constant"() <{value = 9 : index}> : () -> index
    %26 = "arith.constant"() <{value = 10 : index}> : () -> index
    %27 = "arith.constant"() <{value = 11 : index}> : () -> index
    %28 = "arith.constant"() <{value = 12 : index}> : () -> index
    %29 = "arith.constant"() <{value = 13 : index}> : () -> index
    %30 = "arith.constant"() <{value = 14 : index}> : () -> index
    %31 = "arith.constant"() <{value = 15 : index}> : () -> index
    %32 = "arith.constant"() <{value = 16 : index}> : () -> index
    %33 = "arith.constant"() <{value = 17 : index}> : () -> index
    %34 = "arith.constant"() <{value = 18 : index}> : () -> index
    %35 = "arith.constant"() <{value = 19 : index}> : () -> index
    %36 = "arith.constant"() <{value = 20 : index}> : () -> index
    %37 = "arith.constant"() <{value = 21 : index}> : () -> index
    %38 = "arith.constant"() <{value = 22 : index}> : () -> index
    %39 = "arith.constant"() <{value = 23 : index}> : () -> index
    %40 = "arith.constant"() <{value = 24 : index}> : () -> index
    %41 = "arith.constant"() <{value = 25 : index}> : () -> index
    %42 = "arith.constant"() <{value = 26 : index}> : () -> index
    %43 = "arith.constant"() <{value = 27 : index}> : () -> index
    %44 = "arith.constant"() <{value = 28 : index}> : () -> index
    %45 = "arith.constant"() <{value = 29 : index}> : () -> index
    %46 = "arith.constant"() <{value = 30 : index}> : () -> index
    %47 = "arith.constant"() <{value = 31 : index}> : () -> index
    %48 = "tensor.empty"(%17) : (index) -> tensor<?xi16>
    %49 = "tensor.empty"(%16, %33) : (index, index) -> tensor<?x?xi16>
    %50 = "tensor.empty"(%16) : (index) -> tensor<?xi1>
    %51 = "tensor.empty"() : () -> tensor<19x29xf32>
    %52 = "tensor.empty"(%41) : (index) -> tensor<?xi16>
    %53 = "tensor.empty"() : () -> tensor<19x29xi64>
    %54 = "tensor.empty"() : () -> tensor<29xi32>
    %55 = "tensor.empty"(%46) : (index) -> tensor<?xf32>
    %56 = "tensor.empty"(%26) : (index) -> tensor<?x29xf16>
    %57 = "tensor.empty"() : () -> tensor<29xi64>
    %58 = "tensor.empty"(%41) : (index) -> tensor<?x29xf32>
    %59 = "tensor.empty"() : () -> tensor<19x29xi16>
    %60 = "tensor.empty"() : () -> tensor<19x29xi64>
    %61 = "tensor.empty"(%35) : (index) -> tensor<?xi64>
    %62 = "tensor.empty"(%22) : (index) -> tensor<?xi64>
    %63 = "tensor.empty"(%36) : (index) -> tensor<?xf32>
    %64 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<19x29xf16>
    %65 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<19x29xi1>
    %66 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<28xi32>
    %67 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<28xf16>
    %68 = "memref.alloc"(%16) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x29xi32>
    %69 = "memref.alloc"(%16) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x29xi32>
    %70 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<28xi16>
    %71 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29xf16>
    %72 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<19x29xi32>
    %73 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<19x29xf32>
    %74 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<19x29xi64>
    %75 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<19x29xi1>
    %76 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<19x29xi32>
    %77 = "memref.alloc"(%25) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi64>
    %78 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<19x29xi32>
    %79 = "memref.alloc"(%30) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xf32>
    %80 = "vector.broadcast"(%9) : (i64) -> vector<12xi64>
    %81 = "vector.flat_transpose"(%80) <{columns = 3 : i32, rows = 4 : i32}> : (vector<12xi64>) -> vector<12xi64>
    %82 = "spirv.GL.SMax"(%3, %4) : (i16, i16) -> i16
    %83 = "spirv.GL.SSign"(%15) : (i32) -> i32
    %84 = "linalg.copy"(%53, %60) <{operandSegmentSizes = array<i32: 1, 1>}> ({
    ^bb0(%arg1: i64, %arg2: i64):
      "linalg.yield"(%arg1) : (i64) -> ()
    }) : (tensor<19x29xi64>, tensor<19x29xi64>) -> tensor<19x29xi64>
    %85 = "vector.broadcast"(%14) : (i32) -> vector<2xi32>
    %86 = "spirv.BitwiseXor"(%85, %85) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %87 = "spirv.CL.erf"(%6) : (f32) -> f32
    %88 = "bufferization.to_tensor"(%73) : (memref<19x29xf32>) -> tensor<19x29xf32>
    %89 = "index.shl"(%33, %39) : (index, index) -> index
    %90 = "index.shl"(%23, %25) : (index, index) -> index
    %91 = "spirv.ULessThanEqual"(%85, %85) : (vector<2xi32>, vector<2xi32>) -> vector<2xi1>
    %92 = "spirv.CL.cos"(%5) : (f16) -> f16
    %93 = "spirv.CL.u_max"(%11, %11) : (i64, i64) -> i64
    %94 = "spirv.CL.erf"(%10) : (f16) -> f16
    "memref.assume_alignment"(%66) <{alignment = 8 : i32}> : (memref<28xi32>) -> ()
    %95 = "linalg.copy"(%50, %50) <{operandSegmentSizes = array<i32: 1, 1>}> ({
    ^bb0(%arg1: i1, %arg2: i1):
      "linalg.yield"(%arg1) : (i1) -> ()
    }) : (tensor<?xi1>, tensor<?xi1>) -> tensor<?xi1>
    %96 = "arith.addi"(%9, %9) : (i64, i64) -> i64
    %97 = "spirv.BitwiseXor"(%85, %85) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %98 = "spirv.GL.UMax"(%83, %14) : (i32, i32) -> i32
    %99 = "spirv.GL.Cosh"(%94) : (f16) -> f16
    %100 = "spirv.FOrdLessThan"(%13, %0) : (f16, f16) -> i1
    %101 = "spirv.SGreaterThan"(%9, %8) : (i64, i64) -> i1
    %102 = "spirv.IsInf"(%2) : (f32) -> i1
    %103 = "spirv.GL.Sinh"(%12) : (f16) -> f16
    %104 = "spirv.GL.SClamp"(%3, %4, %4) : (i16, i16, i16) -> i16
    %105 = "index.sub"(%43, %18) : (index, index) -> index
    %106 = "vector.broadcast"(%15) : (i32) -> vector<19x29xi32>
    %107 = "vector.broadcast"(%100) : (i1) -> vector<19x29xi1>
    %108 = "vector.gather"(%72, %37, %89, %106, %107, %106) : (memref<19x29xi32>, index, index, vector<19x29xi32>, vector<19x29xi1>, vector<19x29xi32>) -> vector<19x29xi32>
    %109 = "memref.load"(%74, %34, %28) <{nontemporal = false}> : (memref<19x29xi64>, index, index) -> i64
    %110 = "math.round"(%0) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
    %111 = "spirv.UGreaterThan"(%85, %85) : (vector<2xi32>, vector<2xi32>) -> vector<2xi1>
    %112 = "spirv.FUnordGreaterThanEqual"(%92, %5) : (f16, f16) -> i1
    %113 = "spirv.CL.ceil"(%0) : (f16) -> f16
    %114 = "bufferization.clone"(%72) : (memref<19x29xi32>) -> memref<19x29xi32>
    %115 = "bufferization.to_memref"(%48) : (tensor<?xi16>) -> memref<?xi16>
    %116 = "spirv.GL.Sinh"(%5) : (f16) -> f16
    %117 = "arith.ceildivsi"(%98, %98) : (i32, i32) -> i32
    %118 = "index.floordivs"(%29, %105) : (index, index) -> index
    %119 = "spirv.CL.round"(%6) : (f32) -> f32
    %120 = "vector.broadcast"(%113) : (f16) -> vector<12xf16>
    "vector.transfer_write"(%120, %64, %89, %47) <{operandSegmentSizes = array<i32: 1, 1, 2, 0>, permutation_map = affine_map<(d0, d1) -> (d0)>}> : (vector<12xf16>, memref<19x29xf16>, index, index) -> ()
    %121 = "vector.flat_transpose"(%81) <{columns = 3 : i32, rows = 4 : i32}> : (vector<12xi64>) -> vector<12xi64>
    %122 = "spirv.FUnordNotEqual"(%0, %13) : (f16, f16) -> i1
    %123 = "vector.broadcast"(%8) : (i64) -> vector<12x12xi64>
    %124 = "vector.outerproduct"(%121, %80, %123) <{kind = #vector.kind<and>}> : (vector<12xi64>, vector<12xi64>, vector<12x12xi64>) -> vector<12x12xi64>
    %125 = "math.tanh"(%92) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
    %126 = "spirv.CL.round"(%6) : (f32) -> f32
    %127 = "math.log10"(%51) <{fastmath = #arith.fastmath<none>}> : (tensor<19x29xf32>) -> tensor<19x29xf32>
    %128 = "spirv.CL.log"(%113) : (f16) -> f16
    %129 = "spirv.CL.cos"(%92) : (f16) -> f16
    "scf.parallel"(%118, %89, %42) <{operandSegmentSizes = array<i32: 1, 1, 1, 0>}> ({
    ^bb0(%arg1: index):
      "vector.warp_execute_on_lane_0"(%16) <{warp_size = 32 : i64}> ({
        %236 = "vector.broadcast"(%8) : (i64) -> vector<i64>
        %237 = "vector.transfer_write"(%236, %62, %118) <{operandSegmentSizes = array<i32: 1, 1, 1, 0>, permutation_map = affine_map<(d0) -> ()>}> : (vector<i64>, tensor<?xi64>, index) -> tensor<?xi64>
        %238 = "math.ctlz"(%8) : (i64) -> i64
        %239 = "tensor.extract"(%60, %28, %34) : (tensor<19x29xi64>, index, index) -> i64
        %240 = "math.round"(%51) <{fastmath = #arith.fastmath<none>}> : (tensor<19x29xf32>) -> tensor<19x29xf32>
        %241 = "vector.broadcast"(%122) : (i1) -> vector<19xi1>
        %242:2 = "vector.scan"(%107, %241) <{inclusive = true, kind = #vector.kind<maxui>, reduction_dim = 1 : i64}> : (vector<19x29xi1>, vector<19xi1>) -> (vector<19x29xi1>, vector<19xi1>)
        %243 = "math.roundeven"(%6) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %244 = "bufferization.clone"(%65) : (memref<19x29xi1>) -> memref<19x29xi1>
        %245 = "vector.matrix_multiply"(%85, %85) <{lhs_columns = 2 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<2xi32>, vector<2xi32>) -> vector<1xi32>
        "vector.yield"() : () -> ()
      }) : (index) -> ()
      %215 = "tensor.empty"(%17) : (index) -> tensor<?xi1>
      %216 = "linalg.map"(%50, %215) ({
      ^bb0(%arg2: i1):
        %236 = "vector.mask"(%107) ({
          %270 = "vector.multi_reduction"(%107, %107) <{kind = #vector.kind<xor>, reduction_dims = []}> : (vector<19x29xi1>, vector<19x29xi1>) -> vector<19x29xi1>
          "vector.yield"(%270) : (vector<19x29xi1>) -> ()
        }) : (vector<19x29xi1>) -> vector<19x29xi1>
        %237 = "vector.broadcast"(%33) : (index) -> vector<28xindex>
        %238 = "vector.broadcast"(%100) : (i1) -> vector<28xi1>
        %239 = "vector.broadcast"(%14) : (i32) -> vector<28xi32>
        "vector.scatter"(%76, %23, %42, %237, %238, %239) : (memref<19x29xi32>, index, index, vector<28xindex>, vector<28xi1>, vector<28xi32>) -> ()
        %240 = "math.rsqrt"(%51) <{fastmath = #arith.fastmath<none>}> : (tensor<19x29xf32>) -> tensor<19x29xf32>
        %241 = "arith.remf"(%7, %2) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %242 = "vector.insertelement"(%11, %81, %24) : (i64, vector<12xi64>, index) -> vector<12xi64>
        %243 = "arith.andi"(%8, %9) : (i64, i64) -> i64
        %244 = "vector.insertelement"(%13, %120, %29) : (f16, vector<12xf16>, index) -> vector<12xf16>
        %245 = "tensor.cast"(%60) : (tensor<19x29xi64>) -> tensor<?x?xi64>
        %246 = "vector.broadcast"(%126) : (f32) -> vector<28xf32>
        %247 = "vector.fma"(%246, %246, %246) : (vector<28xf32>, vector<28xf32>, vector<28xf32>) -> vector<28xf32>
        %248 = "tensor.rank"(%50) : (tensor<?xi1>) -> index
        %249 = "math.atan2"(%128, %94) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %250 = "vector.broadcast"(%9) : (i64) -> vector<19x29xi64>
        %251 = "vector.gather"(%57, %27, %108, %107, %250) : (tensor<29xi64>, index, vector<19x29xi32>, vector<19x29xi1>, vector<19x29xi64>) -> vector<19x29xi64>
        %252 = "vector.insert"(%11, %81) <{static_position = array<i64: 0>}> : (i64, vector<12xi64>) -> vector<12xi64>
        %253 = "memref.cast"(%79) : (memref<?xf32>) -> memref<12xf32>
        %254 = "arith.cmpf"(%5, %128) <{predicate = 0 : i64}> : (f16, f16) -> i1
        %255 = "math.expm1"(%2) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %256 = "math.log"(%58) <{fastmath = #arith.fastmath<none>}> : (tensor<?x29xf32>) -> tensor<?x29xf32>
        "bufferization.dealloc_tensor"(%52) : (tensor<?xi16>) -> ()
        %257 = "index.bool.constant"() <{value = false}> : () -> i1
        %258 = "index.shrs"(%44, %39) : (index, index) -> index
        %259 = "tensor.expand_shape"(%57) <{reassociation = [[0, 1]]}> : (tensor<29xi64>) -> tensor<29x1xi64>
        %260 = "math.rsqrt"(%128) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %261 = "index.sizeof"() : () -> index
        %262 = "index.or"(%47, %23) : (index, index) -> index
        "memref.copy"(%78, %114) : (memref<19x29xi32>, memref<19x29xi32>) -> ()
        %263 = "vector.shuffle"(%81, %81) <{mask = [1, 4, 6, 11, 12, 17, 19, 21, 23]}> : (vector<12xi64>, vector<12xi64>) -> vector<9xi64>
        %264 = "index.divu"(%41, %36) : (index, index) -> index
        %265 = "math.ceil"(%63) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %266 = "arith.andi"(%3, %82) : (i16, i16) -> i16
        %267 = "index.xor"(%18, %258) : (index, index) -> index
        %268 = "memref.cast"(%114) : (memref<19x29xi32>) -> memref<?x29xi32>
        %269 = "arith.remui"(%104, %4) : (i16, i16) -> i16
        "linalg.yield"(%102) : (i1) -> ()
      }) : (tensor<?xi1>, tensor<?xi1>) -> tensor<?xi1>
      %217 = "vector.broadcast"(%10) : (f16) -> vector<19x29xf16>
      %218 = "vector.gather"(%64, %40, %arg1, %108, %107, %217) : (memref<19x29xf16>, index, index, vector<19x29xi32>, vector<19x29xi1>, vector<19x29xf16>) -> vector<19x29xf16>
      %219 = "tensor.from_elements"(%94, %13, %13, %103, %129, %94, %129, %94, %10, %92, %94, %94, %116, %113, %103, %128, %10, %128, %128, %116, %92, %128, %13, %12, %92, %128, %103, %94, %129) : (f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16) -> tensor<29xf16>
      %220 = "math.round"(%55) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
      %221 = "vector.broadcast"(%0) : (f16) -> vector<29xf16>
      %222:2 = "vector.scan"(%217, %221) <{inclusive = false, kind = #vector.kind<add>, reduction_dim = 0 : i64}> : (vector<19x29xf16>, vector<29xf16>) -> (vector<19x29xf16>, vector<29xf16>)
      %223 = "math.tan"(%5) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %224 = "bufferization.to_tensor"(%75) : (memref<19x29xi1>) -> tensor<19x29xi1>
      %225 = "index.maxu"(%30, %26) : (index, index) -> index
      %226 = "memref.alloca"(%105) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi1>
      %227 = "bufferization.clone"(%114) : (memref<19x29xi32>) -> memref<19x29xi32>
      %228 = "arith.cmpi"(%101, %122) <{predicate = 1 : i64}> : (i1, i1) -> i1
      %229 = "index.floordivs"(%23, %45) : (index, index) -> index
      %230 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29xi32>
      %231 = "vector.broadcast"(%83) : (i32) -> vector<28xi32>
      %232 = "vector.broadcast"(%102) : (i1) -> vector<28xi1>
      %233 = "vector.gather"(%230, %36, %231, %232, %231) : (memref<29xi32>, index, vector<28xi32>, vector<28xi1>, vector<28xi32>) -> vector<28xi32>
      %234 = "vector.broadcast"(%92) : (f16) -> vector<f16>
      "vector.transfer_write"(%234, %71, %28) <{operandSegmentSizes = array<i32: 1, 1, 1, 0>, permutation_map = affine_map<(d0) -> ()>}> : (vector<f16>, memref<29xf16>, index) -> ()
      %235 = "math.tan"(%56) <{fastmath = #arith.fastmath<none>}> : (tensor<?x29xf16>) -> tensor<?x29xf16>
      "scf.yield"() : () -> ()
    }) : (index, index, index) -> ()
    %130 = "memref.cast"(%64) : (memref<19x29xf16>) -> memref<?x?xf16>
    %131 = "spirv.BitFieldInsert"(%85, %85, %3, %83) : (vector<2xi32>, vector<2xi32>, i16, i32) -> vector<2xi32>
    %132 = "math.roundeven"(%128) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
    %133 = "spirv.LogicalEqual"(%112, %101) : (i1, i1) -> i1
    "memref.copy"(%79, %79) : (memref<?xf32>, memref<?xf32>) -> ()
    %134 = "scf.parallel"(%44, %43, %24, %35, %32, %22, %61) <{operandSegmentSizes = array<i32: 2, 2, 2, 1>}> ({
    ^bb0(%arg1: index, %arg2: index):
      %215 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29x12xi64>
      %216 = "tensor.empty"() : () -> tensor<19x12xi64>
      %217 = "linalg.matmul"(%74, %215, %216) <{operandSegmentSizes = array<i32: 2, 1>}> ({
      ^bb0(%arg3: i64, %arg4: i64, %arg5: i64):
        %236 = "arith.muli"(%arg3, %arg4) : (i64, i64) -> i64
        %237 = "arith.addi"(%arg5, %236) : (i64, i64) -> i64
        "linalg.yield"(%237) : (i64) -> ()
      }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (memref<19x29xi64>, memref<29x12xi64>, tensor<19x12xi64>) -> tensor<19x12xi64>
      %218 = "arith.cmpi"(%83, %14) <{predicate = 4 : i64}> : (i32, i32) -> i1
      %219 = "index.bool.constant"() <{value = true}> : () -> i1
      %220 = "vector.broadcast"(%128) : (f16) -> vector<19xf16>
      %221 = "vector.broadcast"(%122) : (i1) -> vector<19xi1>
      %222 = "vector.maskedload"(%67, %36, %221, %220) : (memref<28xf16>, index, vector<19xi1>, vector<19xf16>) -> vector<19xf16>
      %223 = "math.atan2"(%13, %129) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %224 = "memref.load"(%71, %37) <{nontemporal = false}> : (memref<29xf16>, index) -> f16
      %225 = "vector.contract"(%221, %221, %133) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<xor>}> : (vector<19xi1>, vector<19xi1>, i1) -> i1
      %226 = "vector.broadcast"(%102) : (i1) -> vector<29xi1>
      %227 = "vector.multi_reduction"(%107, %226) <{kind = #vector.kind<mul>, reduction_dims = [0]}> : (vector<19x29xi1>, vector<29xi1>) -> vector<29xi1>
      "memref.alloca_scope"() ({
        "memref.copy"(%69, %69) : (memref<?x29xi32>, memref<?x29xi32>) -> ()
        %236 = "tensor.empty"() : () -> tensor<29x19xf16>
        %237 = "linalg.broadcast"(%71, %236) <{dimensions = array<i64: 1>}> ({
        ^bb0(%arg3: f16, %arg4: f16):
          "linalg.yield"(%arg3) : (f16) -> ()
        }) : (memref<29xf16>, tensor<29x19xf16>) -> tensor<29x19xf16>
        %238 = "memref.cast"(%67) : (memref<28xf16>) -> memref<?xf16>
        %239 = "arith.cmpi"(%98, %83) <{predicate = 0 : i64}> : (i32, i32) -> i1
        %240 = "vector.insertelement"(%219, %226, %25) : (i1, vector<29xi1>, index) -> vector<29xi1>
        %241 = "memref.cast"(%114) : (memref<19x29xi32>) -> memref<19x?xi32>
        %242 = "memref.load"(%73, %29, %40) <{nontemporal = false}> : (memref<19x29xf32>, index, index) -> f32
        %243 = "arith.mulf"(%119, %2) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %244 = "tensor.rank"(%60) : (tensor<19x29xi64>) -> index
        %245 = "math.ctlz"(%4) : (i16) -> i16
        %246 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<28xi1>
        %247 = "memref.cast"(%114) : (memref<19x29xi32>) -> memref<19x29xi32>
        %248 = "vector.matrix_multiply"(%221, %221) <{lhs_columns = 19 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<19xi1>, vector<19xi1>) -> vector<1xi1>
        "memref.copy"(%65, %75) : (memref<19x29xi1>, memref<19x29xi1>) -> ()
        %249 = "memref.load"(%75, %16, %35) <{nontemporal = false}> : (memref<19x29xi1>, index, index) -> i1
        %250 = "memref.alloca"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<19x29xi64>
        "bufferization.dealloc_tensor"(%84) : (tensor<19x29xi64>) -> ()
        %251 = "index.sizeof"() : () -> index
        %252 = "arith.mulf"(%116, %13) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %253 = "vector.transfer_read"(%74, %43, %16, %11) <{operandSegmentSizes = array<i32: 1, 2, 1, 0>, permutation_map = affine_map<(d0, d1) -> (d1)>}> : (memref<19x29xi64>, index, index, i64) -> vector<12xi64>
        "memref.copy"(%115, %115) : (memref<?xi16>, memref<?xi16>) -> ()
        %254 = "vector.extract_strided_slice"(%120) <{offsets = [6], sizes = [5], strides = [1]}> : (vector<12xf16>) -> vector<5xf16>
        "memref.store"(%112, %75, %27, %37) <{nontemporal = false}> : (i1, memref<19x29xi1>, index, index) -> ()
        %255 = "index.mul"(%29, %39) : (index, index) -> index
        %256 = "tensor.collapse_shape"(%216) <{reassociation = [[0, 1]]}> : (tensor<19x12xi64>) -> tensor<228xi64>
        %257 = "math.tan"(%56) <{fastmath = #arith.fastmath<none>}> : (tensor<?x29xf16>) -> tensor<?x29xf16>
        %258 = "linalg.copy"(%53, %84) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg3: i64, %arg4: i64):
          "linalg.yield"(%arg3) : (i64) -> ()
        }) : (tensor<19x29xi64>, tensor<19x29xi64>) -> tensor<19x29xi64>
        %259 = "math.expm1"(%12) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %260 = "affine.min"(%arg1, %37) <{map = affine_map<(d0, d1) -> (d0 * 32 - 128)>}> : (index, index) -> index
        %261 = "math.tan"(%119) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %262 = "memref.load"(%115, %16) <{nontemporal = false}> : (memref<?xi16>, index) -> i16
        %263 = "tensor.empty"() : () -> tensor<29x19xi64>
        %264 = "tensor.empty"() : () -> tensor<19x19xi64>
        %265 = "linalg.matmul"(%60, %263, %264) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg3: i64, %arg4: i64, %arg5: i64):
          %266 = "arith.muli"(%arg3, %arg4) : (i64, i64) -> i64
          %267 = "arith.addi"(%arg5, %266) : (i64, i64) -> i64
          "linalg.yield"(%267) : (i64) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<19x29xi64>, tensor<29x19xi64>, tensor<19x19xi64>) -> tensor<19x19xi64>
        "memref.alloca_scope.return"() : () -> ()
      }) : () -> ()
      %228 = "tensor.empty"() : () -> tensor<551xi64>
      %229 = "tensor.unpack"(%84, %228, %45) <{inner_dims_pos = array<i64: 0>, outer_dims_perm = array<i64: 0>, static_inner_tiles = array<i64: -9223372036854775808>}> : (tensor<19x29xi64>, tensor<551xi64>, index) -> tensor<551xi64>
      %230 = "arith.shrsi"(%82, %82) : (i16, i16) -> i16
      %231 = "index.bool.constant"() <{value = true}> : () -> i1
      %232 = "math.log10"(%119) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %233 = "arith.cmpi"(%14, %98) <{predicate = 5 : i64}> : (i32, i32) -> i1
      %234 = "affine.load"(%67, %25) <{map = affine_map<(d0) -> (d0)>}> : (memref<28xf16>, index) -> f16
      %235 = "math.rsqrt"(%88) <{fastmath = #arith.fastmath<none>}> : (tensor<19x29xf32>) -> tensor<19x29xf32>
      "scf.reduce"(%61) ({
      ^bb0(%arg3: tensor<?xi64>, %arg4: tensor<?xi64>):
        %236 = "affine.load"(%65, %26, %26) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (memref<19x29xi1>, index, index) -> i1
        %237 = "math.log"(%58) <{fastmath = #arith.fastmath<none>}> : (tensor<?x29xf32>) -> tensor<?x29xf32>
        %238 = "math.ctlz"(%122) : (i1) -> i1
        %239:2 = "vector.scan"(%107, %226) <{inclusive = false, kind = #vector.kind<maxui>, reduction_dim = 0 : i64}> : (vector<19x29xi1>, vector<29xi1>) -> (vector<19x29xi1>, vector<29xi1>)
        %240 = "math.cttz"(%62) : (tensor<?xi64>) -> tensor<?xi64>
        %241 = "index.maxs"(%45, %27) : (index, index) -> index
        %242 = "vector.broadcast"(%6) : (f32) -> vector<29xf32>
        %243 = "vector.fma"(%242, %242, %242) : (vector<29xf32>, vector<29xf32>, vector<29xf32>) -> vector<29xf32>
        %244 = "tensor.extract"(%51, %16, %39) : (tensor<19x29xf32>, index, index) -> f32
        "scf.reduce.return"(%62) : (tensor<?xi64>) -> ()
      }) : (tensor<?xi64>) -> ()
      "scf.yield"() : () -> ()
    }) : (index, index, index, index, index, index, tensor<?xi64>) -> tensor<?xi64>
    %135 = "spirv.GL.Exp"(%126) : (f32) -> f32
    %136 = "math.atan2"(%113, %103) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %137 = "index.shrs"(%32, %22) : (index, index) -> index
    %138 = "vector.contract"(%80, %121, %11) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<minui>}> : (vector<12xi64>, vector<12xi64>, i64) -> i64
    %139 = "arith.ceildivsi"(%1, %3) : (i16, i16) -> i16
    %140 = "spirv.LogicalAnd"(%133, %100) : (i1, i1) -> i1
    %141 = "vector.load"(%71, %23) : (memref<29xf16>, index) -> vector<29xf16>
    %142 = "spirv.GL.Asin"(%129) : (f16) -> f16
    %143 = "spirv.GL.FAbs"(%119) : (f32) -> f32
    %144 = "bufferization.clone"(%66) : (memref<28xi32>) -> memref<28xi32>
    %145 = "spirv.GL.SAbs"(%4) : (i16) -> i16
    %146 = "spirv.BitCount"(%3) : (i16) -> i16
    %147 = "memref.alloca"(%40) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi1>
    %148 = "index.and"(%35, %33) : (index, index) -> index
    %149 = "arith.remf"(%135, %126) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
    %150 = "math.tan"(%6) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %151 = "vector.broadcast"(%101) : (i1) -> vector<19xi1>
    %152:2 = "vector.scan"(%107, %151) <{inclusive = false, kind = #vector.kind<maxui>, reduction_dim = 1 : i64}> : (vector<19x29xi1>, vector<19xi1>) -> (vector<19x29xi1>, vector<19xi1>)
    "bufferization.dealloc_tensor"(%51) : (tensor<19x29xf32>) -> ()
    %153 = "spirv.CL.erf"(%129) : (f16) -> f16
    %154 = "spirv.BitFieldUExtract"(%85, %145, %11) : (vector<2xi32>, i16, i64) -> vector<2xi32>
    %155 = "tensor.insert"(%104, %49, %16, %16) : (i16, tensor<?x?xi16>, index, index) -> tensor<?x?xi16>
    %156 = "spirv.BitCount"(%104) : (i16) -> i16
    %157 = "vector.broadcast"(%98) : (i32) -> vector<19xi32>
    %158 = "vector.mask"(%107) ({
      %215 = "vector.multi_reduction"(%108, %157) <{kind = #vector.kind<add>, reduction_dims = [1]}> : (vector<19x29xi32>, vector<19xi32>) -> vector<19xi32>
      "vector.yield"(%215) : (vector<19xi32>) -> ()
    }) : (vector<19x29xi1>) -> vector<19xi32>
    %159 = "affine.min"(%28) <{map = affine_map<(d0) -> (d0 * 2)>}> : (index) -> index
    %160 = "spirv.GL.Sinh"(%13) : (f16) -> f16
    %161 = "math.log2"(%55) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
    %162 = "index.maxu"(%159, %17) : (index, index) -> index
    %163 = "arith.ceildivsi"(%145, %145) : (i16, i16) -> i16
    %164 = "index.floordivs"(%34, %41) : (index, index) -> index
    %165 = "spirv.BitwiseOr"(%85, %85) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %166 = "scf.execute_region"() ({
      %215 = "affine.for"(%30) <{lowerBoundMap = affine_map<() -> (0)>, operandSegmentSizes = array<i32: 0, 0, 1>, step = 1 : index, upperBoundMap = affine_map<() -> (112)>}> ({
      ^bb0(%arg1: index, %arg2: index):
        "affine.yield"(%18) : (index) -> ()
      }) : (index) -> index
      %216 = "math.round"(%10) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      "bufferization.dealloc_tensor"(%58) : (tensor<?x29xf32>) -> ()
      %217 = "math.fma"(%116, %116, %12) <{fastmath = #arith.fastmath<none>}> : (f16, f16, f16) -> f16
      %218 = "vector.insert"(%5, %120) <{static_position = array<i64: 3>}> : (f16, vector<12xf16>) -> vector<12xf16>
      %219 = "tensor.expand_shape"(%58) <{reassociation = [[0], [1, 2]]}> : (tensor<?x29xf32>) -> tensor<?x29x1xf32>
      %220 = "memref.alloca"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29xi32>
      "scf.if"(%112) ({
        %231 = "linalg.copy"(%49, %49) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg1: i16, %arg2: i16):
          "linalg.yield"(%arg1) : (i16) -> ()
        }) : (tensor<?x?xi16>, tensor<?x?xi16>) -> tensor<?x?xi16>
        "affine.vector_store"(%80, %74, %18, %20) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (vector<12xi64>, memref<19x29xi64>, index, index) -> ()
        %232 = "tensor.cast"(%53) : (tensor<19x29xi64>) -> tensor<?x?xi64>
        %233 = "arith.remui"(%82, %146) : (i16, i16) -> i16
        %234 = "vector.multi_reduction"(%157, %157) <{kind = #vector.kind<minsi>, reduction_dims = []}> : (vector<19xi32>, vector<19xi32>) -> vector<19xi32>
        %235 = "math.expm1"(%55) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %236 = "math.log"(%103) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %237:2 = "vector.scan"(%108, %157) <{inclusive = false, kind = #vector.kind<maxui>, reduction_dim = 1 : i64}> : (vector<19x29xi32>, vector<19xi32>) -> (vector<19x29xi32>, vector<19xi32>)
        "scf.yield"() : () -> ()
      }, {
      }) : (i1) -> ()
      %221 = "tensor.empty"() : () -> tensor<28xi1>
      %222 = "vector.broadcast"(%101) : (i1) -> vector<28xi1>
      %223 = "vector.broadcast"(%14) : (i32) -> vector<28xi32>
      %224 = "vector.gather"(%221, %21, %223, %222, %222) : (tensor<28xi1>, index, vector<28xi32>, vector<28xi1>, vector<28xi1>) -> vector<28xi1>
      "memref.copy"(%76, %78) : (memref<19x29xi32>, memref<19x29xi32>) -> ()
      %225 = "vector.matrix_multiply"(%223, %157) <{lhs_columns = 1 : i32, lhs_rows = 28 : i32, rhs_columns = 19 : i32}> : (vector<28xi32>, vector<19xi32>) -> vector<532xi32>
      %226 = "arith.cmpi"(%100, %112) <{predicate = 5 : i64}> : (i1, i1) -> i1
      %227 = "arith.shrui"(%140, %102) : (i1, i1) -> i1
      %228 = "math.copysign"(%153, %153) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %229 = "math.rsqrt"(%94) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %230 = "scf.if"(%140) ({
        %231 = "tensor.empty"() : () -> tensor<29xi1>
        %232 = "vector.gather"(%231, %32, %223, %224, %224) : (tensor<29xi1>, index, vector<28xi32>, vector<28xi1>, vector<28xi1>) -> vector<28xi1>
        %233 = "vector.broadcast"(%156) : (i16) -> vector<19x29xi16>
        %234 = "affine.apply"(%46, %37, %25, %164) <{map = affine_map<(d0, d1, d2)[s0] -> (d0 + 30)>}> : (index, index, index, index) -> index
        %235 = "arith.shrui"(%112, %100) : (i1, i1) -> i1
        %236 = "vector.broadcast"(%102) : (i1) -> vector<19xi1>
        %237:2 = "vector.scan"(%107, %236) <{inclusive = false, kind = #vector.kind<xor>, reduction_dim = 1 : i64}> : (vector<19x29xi1>, vector<19xi1>) -> (vector<19x29xi1>, vector<19xi1>)
        %238 = "vector.flat_transpose"(%224) <{columns = 7 : i32, rows = 4 : i32}> : (vector<28xi1>) -> vector<28xi1>
        %239 = "vector.shuffle"(%121, %81) <{mask = [1, 6, 8, 10, 16, 17, 22]}> : (vector<12xi64>, vector<12xi64>) -> vector<7xi64>
        %240 = "math.exp2"(%88) <{fastmath = #arith.fastmath<none>}> : (tensor<19x29xf32>) -> tensor<19x29xf32>
        "scf.yield"(%140) : (i1) -> ()
      }, {
        "affine.vector_store"(%121, %74, %148, %118) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (vector<12xi64>, memref<19x29xi64>, index, index) -> ()
        %231 = "arith.remf"(%99, %94) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %232 = "index.mul"(%33, %44) : (index, index) -> index
        %233 = "math.rsqrt"(%58) <{fastmath = #arith.fastmath<none>}> : (tensor<?x29xf32>) -> tensor<?x29xf32>
        %234 = "tensor.from_elements"(%112, %100, %133, %100, %101, %112, %102, %122, %140, %122, %140, %101, %122, %122, %101, %133, %140, %122, %133, %101, %140, %112, %133, %112, %122, %101, %133, %140, %133) : (i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1) -> tensor<29xi1>
        %235 = "index.add"(%22, %23) : (index, index) -> index
        %236 = "arith.cmpi"(%98, %15) <{predicate = 0 : i64}> : (i32, i32) -> i1
        %237 = "math.atan2"(%126, %126) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        "scf.yield"(%133) : (i1) -> ()
      }) : (i1) -> i1
      "scf.yield"(%93) : (i64) -> ()
    }) : () -> i64
    %167 = "tensor.generate"(%37) ({
    ^bb0(%arg1: index):
      %215 = "memref.load"(%114, %22, %38) <{nontemporal = false}> : (memref<19x29xi32>, index, index) -> i32
      %216 = "index.maxu"(%28, %33) : (index, index) -> index
      %217 = "vector.broadcast"(%30) : (index) -> vector<12xindex>
      %218 = "vector.broadcast"(%100) : (i1) -> vector<12xi1>
      %219 = "vector.broadcast"(%119) : (f32) -> vector<12xf32>
      "vector.scatter"(%79, %16, %217, %218, %219) : (memref<?xf32>, index, vector<12xindex>, vector<12xi1>, vector<12xf32>) -> ()
      "memref.tensor_store"(%62, %77) : (tensor<?xi64>, memref<?xi64>) -> ()
      "tensor.yield"(%166) : (i64) -> ()
    }) : (index) -> tensor<?xi64>
    %168 = "spirv.CL.log"(%13) : (f16) -> f16
    %169 = "spirv.GL.SSign"(%15) : (i32) -> i32
    %170 = "vector.splat"(%0) : (f16) -> vector<29xf16>
    %171 = "arith.remf"(%13, %12) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %172 = "spirv.ULessThan"(%14, %14) : (i32, i32) -> i1
    %173 = "bufferization.to_tensor"(%66) : (memref<28xi32>) -> tensor<28xi32>
    %174 = "spirv.FOrdGreaterThan"(%94, %160) : (f16, f16) -> i1
    %175 = "spirv.CL.s_abs"(%156) : (i16) -> i16
    %176 = "tensor.empty"() : () -> tensor<19x29xi64>
    %177 = "linalg.map"(%53, %176) ({
    ^bb0(%arg1: i64):
      %215 = "math.sqrt"(%128) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      "affine.vector_store"(%141, %67, %35) <{map = affine_map<(d0) -> (d0)>}> : (vector<29xf16>, memref<28xf16>, index) -> ()
      %216 = "vector.load"(%114, %33, %22) : (memref<19x29xi32>, index, index) -> vector<29xi32>
      %217 = "tensor.empty"() : () -> tensor<28xf16>
      %218 = "tensor.empty"() : () -> tensor<f16>
      %219 = "linalg.dot"(%67, %217, %218) <{operandSegmentSizes = array<i32: 2, 1>}> ({
      ^bb0(%arg2: f16, %arg3: f16, %arg4: f16):
        %243 = "arith.mulf"(%arg2, %arg3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %244 = "arith.addf"(%arg4, %243) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        "linalg.yield"(%244) : (f16) -> ()
      }) {linalg.memoized_indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>]} : (memref<28xf16>, tensor<28xf16>, tensor<f16>) -> tensor<f16>
      %220 = "index.or"(%35, %38) : (index, index) -> index
      %221 = "index.or"(%137, %33) : (index, index) -> index
      %222 = "affine.vector_load"(%78, %35, %148) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (memref<19x29xi32>, index, index) -> vector<29xi32>
      "memref.copy"(%65, %65) : (memref<19x29xi1>, memref<19x29xi1>) -> ()
      %223 = "vector.extract"(%81) <{static_position = array<i64: 10>}> : (vector<12xi64>) -> i64
      %224 = "memref.load"(%70, %21) <{nontemporal = false}> : (memref<28xi16>, index) -> i16
      %225 = "math.log"(%113) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %226 = "math.atan2"(%10, %160) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %227 = "tensor.dim"(%57, %16) : (tensor<29xi64>, index) -> index
      %228 = "tensor.dim"(%54, %16) : (tensor<29xi32>, index) -> index
      %229 = "arith.divsi"(%174, %101) : (i1, i1) -> i1
      %230 = "vector.flat_transpose"(%157) <{columns = 19 : i32, rows = 1 : i32}> : (vector<19xi32>) -> vector<19xi32>
      %231 = "math.tan"(%153) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %232 = "vector.transpose"(%108) <{transp = [0, 1]}> : (vector<19x29xi32>) -> vector<19x29xi32>
      "affine.vector_store"(%121, %77, %23) <{map = affine_map<(d0) -> (d0)>}> : (vector<12xi64>, memref<?xi64>, index) -> ()
      "scf.parallel"(%34, %23, %39, %159, %18, %33) <{operandSegmentSizes = array<i32: 2, 2, 2, 0>}> ({
      ^bb0(%arg2: index, %arg3: index):
        %243 = "vector.broadcast"(%133) : (i1) -> vector<29xi1>
        %244 = "vector.mask"(%243) ({
          %261 = "vector.multi_reduction"(%216, %216) <{kind = #vector.kind<minui>, reduction_dims = []}> : (vector<29xi32>, vector<29xi32>) -> vector<29xi32>
          "vector.yield"(%261) : (vector<29xi32>) -> ()
        }) : (vector<29xi1>) -> vector<29xi32>
        %245 = "affine.load"(%68, %18, %23) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (memref<?x29xi32>, index, index) -> i32
        %246 = "math.tanh"(%51) <{fastmath = #arith.fastmath<none>}> : (tensor<19x29xf32>) -> tensor<19x29xf32>
        %247 = "tensor.cast"(%52) : (tensor<?xi16>) -> tensor<19xi16>
        %248 = "memref.alloca"(%159) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x29xi32>
        %249 = "vector.broadcast"(%245) : (i32) -> vector<2x2xi32>
        %250 = "vector.outerproduct"(%85, %85, %249) <{kind = #vector.kind<maxsi>}> : (vector<2xi32>, vector<2xi32>, vector<2x2xi32>) -> vector<2x2xi32>
        "memref.store"(%166, %77, %16) <{nontemporal = false}> : (i64, memref<?xi64>, index) -> ()
        %251 = "arith.cmpf"(%94, %92) <{predicate = 2 : i64}> : (f16, f16) -> i1
        %252 = "tensor.empty"() : () -> tensor<19x29xi32>
        %253 = "vector.gather"(%252, %34, %36, %106, %107, %106) : (tensor<19x29xi32>, index, index, vector<19x29xi32>, vector<19x29xi1>, vector<19x29xi32>) -> vector<19x29xi32>
        %254 = "arith.shrui"(%8, %166) : (i64, i64) -> i64
        %255 = "math.tan"(%217) <{fastmath = #arith.fastmath<none>}> : (tensor<28xf16>) -> tensor<28xf16>
        %256 = "arith.cmpi"(%133, %100) <{predicate = 1 : i64}> : (i1, i1) -> i1
        %257 = "vector.extract_strided_slice"(%107) <{offsets = [8], sizes = [8], strides = [1]}> : (vector<19x29xi1>) -> vector<8x29xi1>
        %258 = "tensor.cast"(%219) : (tensor<f16>) -> tensor<f16>
        %259 = "vector.matrix_multiply"(%120, %120) <{lhs_columns = 12 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<12xf16>, vector<12xf16>) -> vector<1xf16>
        %260 = "affine.min"(%32) <{map = affine_map<(d0) -> ((d0 floordiv 8) mod 4)>}> : (index) -> index
        "scf.yield"() : () -> ()
      }) : (index, index, index, index, index, index) -> ()
      %233 = "math.powf"(%12, %94) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %234 = "vector.flat_transpose"(%230) <{columns = 19 : i32, rows = 1 : i32}> : (vector<19xi32>) -> vector<19xi32>
      %235 = "vector.shuffle"(%121, %81) <{mask = [2, 4, 6, 8, 9, 11, 15, 20, 21, 22]}> : (vector<12xi64>, vector<12xi64>) -> vector<10xi64>
      %236 = "arith.mulf"(%135, %7) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %237 = "index.floordivs"(%22, %27) : (index, index) -> index
      %238 = "vector.transpose"(%216) <{transp = [0]}> : (vector<29xi32>) -> vector<29xi32>
      "affine.vector_store"(%234, %144, %18) <{map = affine_map<(d0) -> (d0)>}> : (vector<19xi32>, memref<28xi32>, index) -> ()
      %239 = "math.fma"(%168, %129, %12) <{fastmath = #arith.fastmath<none>}> : (f16, f16, f16) -> f16
      %240 = "scf.index_switch"(%18) <{cases = array<i64: 1, 2>}> ({
        "bufferization.dealloc_tensor"(%63) : (tensor<?xf32>) -> ()
        %243 = "math.log10"(%12) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %244 = "vector.transfer_read"(%49, %220, %137, %104) <{operandSegmentSizes = array<i32: 1, 2, 1, 0>, permutation_map = affine_map<(d0, d1) -> (d1)>}> : (tensor<?x?xi16>, index, index, i16) -> vector<12xi16>
        %245 = "memref.cast"(%114) : (memref<19x29xi32>) -> memref<?x?xi32>
        %246 = "affine.min"(%17) <{map = affine_map<(d0) -> (d0 * 2)>}> : (index) -> index
        %247 = "tensor.dim"(%56, %16) : (tensor<?x29xf16>, index) -> index
        %248 = "vector.insertelement"(%98, %216, %25) : (i32, vector<29xi32>, index) -> vector<29xi32>
        %249 = "vector.matrix_multiply"(%222, %222) <{lhs_columns = 29 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<29xi32>, vector<29xi32>) -> vector<1xi32>
        %250 = "math.exp"(%129) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %251 = "arith.divsi"(%15, %169) : (i32, i32) -> i32
        %252 = "bufferization.to_tensor"(%78) : (memref<19x29xi32>) -> tensor<19x29xi32>
        %253 = "arith.shrui"(%175, %175) : (i16, i16) -> i16
        %254 = "index.floordivs"(%19, %17) : (index, index) -> index
        %255 = "vector.multi_reduction"(%157, %157) <{kind = #vector.kind<maxsi>, reduction_dims = []}> : (vector<19xi32>, vector<19xi32>) -> vector<19xi32>
        %256 = "vector.transpose"(%120) <{transp = [0]}> : (vector<12xf16>) -> vector<12xf16>
        %257 = "index.floordivs"(%22, %23) : (index, index) -> index
        "scf.yield"(%74) : (memref<19x29xi64>) -> ()
      }, {
        %243 = "vector.insert"(%169, %230) <{static_position = array<i64: 18>}> : (i32, vector<19xi32>) -> vector<19xi32>
        %244 = "vector.transfer_read"(%52, %20, %156) <{operandSegmentSizes = array<i32: 1, 1, 1, 0>, permutation_map = affine_map<(d0) -> ()>}> : (tensor<?xi16>, index, i16) -> vector<i16>
        %245 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29x12xi64>
        %246 = "tensor.empty"() : () -> tensor<19x12xi64>
        %247 = "linalg.matmul"(%74, %245, %246) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg2: i64, %arg3: i64, %arg4: i64):
          %267 = "arith.muli"(%arg2, %arg3) : (i64, i64) -> i64
          %268 = "arith.addi"(%arg4, %267) : (i64, i64) -> i64
          "linalg.yield"(%268) : (i64) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (memref<19x29xi64>, memref<29x12xi64>, tensor<19x12xi64>) -> tensor<19x12xi64>
        %248 = "linalg.copy"(%50, %50) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg2: i1, %arg3: i1):
          "linalg.yield"(%arg2) : (i1) -> ()
        }) : (tensor<?xi1>, tensor<?xi1>) -> tensor<?xi1>
        %249 = "vector.contract"(%141, %141, %10) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<minf>}> : (vector<29xf16>, vector<29xf16>, f16) -> f16
        %250 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29x12xi32>
        %251 = "tensor.empty"() : () -> tensor<19x12xi32>
        %252 = "linalg.matmul"(%72, %250, %251) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg2: i32, %arg3: i32, %arg4: i32):
          %267 = "arith.muli"(%arg2, %arg3) : (i32, i32) -> i32
          %268 = "arith.addi"(%arg4, %267) : (i32, i32) -> i32
          "linalg.yield"(%268) : (i32) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (memref<19x29xi32>, memref<29x12xi32>, tensor<19x12xi32>) -> tensor<19x12xi32>
        %253 = "tensor.empty"() : () -> tensor<28xf32>
        %254 = "vector.broadcast"(%7) : (f32) -> vector<19x29xf32>
        %255 = "vector.gather"(%253, %159, %108, %107, %254) : (tensor<28xf32>, index, vector<19x29xi32>, vector<19x29xi1>, vector<19x29xf32>) -> vector<19x29xf32>
        %256 = "vector.transpose"(%107) <{transp = [0, 1]}> : (vector<19x29xi1>) -> vector<19x29xi1>
        %257 = "tensor.empty"() : () -> tensor<29x19xi64>
        %258 = "tensor.empty"() : () -> tensor<19x19xi64>
        %259 = "linalg.matmul"(%53, %257, %258) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg2: i64, %arg3: i64, %arg4: i64):
          %267 = "arith.muli"(%arg2, %arg3) : (i64, i64) -> i64
          %268 = "arith.addi"(%arg4, %267) : (i64, i64) -> i64
          "linalg.yield"(%268) : (i64) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<19x29xi64>, tensor<29x19xi64>, tensor<19x19xi64>) -> tensor<19x19xi64>
        "memref.assume_alignment"(%71) <{alignment = 16 : i32}> : (memref<29xf16>) -> ()
        %260 = "bufferization.clone"(%75) : (memref<19x29xi1>) -> memref<19x29xi1>
        %261 = "index.shru"(%105, %34) : (index, index) -> index
        %262 = "bufferization.clone"(%114) : (memref<19x29xi32>) -> memref<19x29xi32>
        %263 = "tensor.splat"(%8) : (i64) -> tensor<19x29xi64>
        %264 = "linalg.copy"(%48, %52) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg2: i16, %arg3: i16):
          "linalg.yield"(%arg2) : (i16) -> ()
        }) : (tensor<?xi16>, tensor<?xi16>) -> tensor<?xi16>
        %265 = "tensor.empty"() : () -> tensor<19x29xi32>
        %266 = "math.fpowi"(%51, %265) <{fastmath = #arith.fastmath<none>}> : (tensor<19x29xf32>, tensor<19x29xi32>) -> tensor<19x29xf32>
        "scf.yield"(%74) : (memref<19x29xi64>) -> ()
      }, {
        %243 = "math.roundeven"(%103) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %244 = "arith.shrui"(%172, %112) : (i1, i1) -> i1
        %245 = "affine.load"(%73, %30, %44) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (memref<19x29xf32>, index, index) -> f32
        %246 = "memref.cast"(%72) : (memref<19x29xi32>) -> memref<?x29xi32>
        "bufferization.dealloc_tensor"(%176) : (tensor<19x29xi64>) -> ()
        %247 = "index.floordivs"(%46, %31) : (index, index) -> index
        %248 = "vector.broadcast"(%2) : (f32) -> vector<29xf32>
        %249 = "vector.broadcast"(%122) : (i1) -> vector<29xi1>
        %250 = "vector.maskedload"(%73, %33, %30, %249, %248) : (memref<19x29xf32>, index, index, vector<29xi1>, vector<29xf32>) -> vector<29xf32>
        %251 = "math.log10"(%119) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        "vector.transfer_write"(%141, %64, %220, %237) <{operandSegmentSizes = array<i32: 1, 1, 2, 0>, permutation_map = affine_map<(d0, d1) -> (d0)>}> : (vector<29xf16>, memref<19x29xf16>, index, index) -> ()
        %252 = "math.round"(%99) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %253 = "math.copysign"(%5, %142) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %254 = "index.mul"(%32, %45) : (index, index) -> index
        %255 = "linalg.copy"(%51, %51) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg2: f32, %arg3: f32):
          "linalg.yield"(%arg2) : (f32) -> ()
        }) : (tensor<19x29xf32>, tensor<19x29xf32>) -> tensor<19x29xf32>
        %256 = "vector.broadcast"(%20) : (index) -> vector<29xindex>
        "vector.scatter"(%64, %24, %24, %256, %249, %141) : (memref<19x29xf16>, index, index, vector<29xindex>, vector<29xi1>, vector<29xf16>) -> ()
        %257 = "memref.alloca"(%36) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi1>
        %258 = "affine.load"(%77, %32) <{map = affine_map<(d0) -> (d0)>}> : (memref<?xi64>, index) -> i64
        "scf.yield"(%74) : (memref<19x29xi64>) -> ()
      }) : (index) -> memref<19x29xi64>
      %241 = "math.fpowi"(%92, %83) <{fastmath = #arith.fastmath<none>}> : (f16, i32) -> f16
      "affine.for"() <{lowerBoundMap = affine_map<() -> (0)>, operandSegmentSizes = array<i32: 0, 0, 0>, step = 1 : index, upperBoundMap = affine_map<() -> (28)>}> ({
      ^bb0(%arg2: index):
        "affine.yield"() : () -> ()
      }) : () -> ()
      %242 = "memref.load"(%79, %16) <{nontemporal = false}> : (memref<?xf32>, index) -> f32
      "linalg.yield"(%11) : (i64) -> ()
    }) : (tensor<19x29xi64>, tensor<19x29xi64>) -> tensor<19x29xi64>
    %178 = "vector.broadcast"(%14) : (i32) -> vector<29xi32>
    %179:2 = "vector.scan"(%106, %178) <{inclusive = true, kind = #vector.kind<xor>, reduction_dim = 0 : i64}> : (vector<19x29xi32>, vector<29xi32>) -> (vector<19x29xi32>, vector<29xi32>)
    %180 = "spirv.ULessThanEqual"(%156, %145) : (i16, i16) -> i1
    %181 = "math.ceil"(%6) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %182 = "spirv.SGreaterThan"(%3, %156) : (i16, i16) -> i1
    %183 = "spirv.CL.sin"(%119) : (f32) -> f32
    %184 = "spirv.GL.Pow"(%103, %113) : (f16, f16) -> f16
    %185 = "spirv.FOrdLessThan"(%153, %113) : (f16, f16) -> i1
    %186 = "spirv.BitReverse"(%98) : (i32) -> i32
    %187 = "arith.remf"(%153, %94) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %188 = "spirv.CL.erf"(%87) : (f32) -> f32
    %189 = "vector.insertelement"(%113, %141, %17) : (f16, vector<29xf16>, index) -> vector<29xf16>
    "vector.warp_execute_on_lane_0"(%16) <{warp_size = 32 : i64}> ({
      %215 = "arith.cmpi"(%102, %182) <{predicate = 3 : i64}> : (i1, i1) -> i1
