module {
  func.func nested @func1() -> tensor<12xi64> {
    %cst = arith.constant 4.921600e+04 : f16
    %c-10120_i16 = arith.constant -10120 : i16
    %c-20163_i16 = arith.constant -20163 : i16
    %c314936925_i64 = arith.constant 314936925 : i64
    %c1830635293_i64 = arith.constant 1830635293 : i64
    %cst_0 = arith.constant 4.982400e+04 : f16
    %cst_1 = arith.constant 5.171200e+04 : f16
    %c-14386_i16 = arith.constant -14386 : i16
    %true = arith.constant true
    %c1139289150_i64 = arith.constant 1139289150 : i64
    %false = arith.constant false
    %c1541256711_i64 = arith.constant 1541256711 : i64
    %c19273_i16 = arith.constant 19273 : i16
    %cst_2 = arith.constant 0x4DBCC2DB : f32
    %c14405_i16 = arith.constant 14405 : i16
    %c19611_i16 = arith.constant 19611 : i16
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %c16 = arith.constant 16 : index
    %c17 = arith.constant 17 : index
    %c18 = arith.constant 18 : index
    %c19 = arith.constant 19 : index
    %c20 = arith.constant 20 : index
    %c21 = arith.constant 21 : index
    %c22 = arith.constant 22 : index
    %c23 = arith.constant 23 : index
    %c24 = arith.constant 24 : index
    %c25 = arith.constant 25 : index
    %c26 = arith.constant 26 : index
    %c27 = arith.constant 27 : index
    %c28 = arith.constant 28 : index
    %c29 = arith.constant 29 : index
    %c30 = arith.constant 30 : index
    %c31 = arith.constant 31 : index
    %0 = tensor.empty() : tensor<12xf32>
    %1 = tensor.empty() : tensor<30xf32>
    %2 = tensor.empty(%c27) : tensor<?xi1>
    %3 = tensor.empty(%c20) : tensor<?xi16>
    %4 = tensor.empty(%c7, %c6) : tensor<?x?xi64>
    %5 = tensor.empty(%c15, %c3) : tensor<?x?xi32>
    %6 = tensor.empty(%c17, %c6) : tensor<?x?xi64>
    %7 = tensor.empty() : tensor<30xi32>
    %8 = tensor.empty(%c17) : tensor<?xf16>
    %9 = tensor.empty(%c21) : tensor<?xi1>
    %10 = tensor.empty() : tensor<30xf32>
    %11 = tensor.empty() : tensor<12xi64>
    %12 = tensor.empty() : tensor<12x22xi32>
    %13 = tensor.empty(%c24) : tensor<?x22xi16>
    %14 = tensor.empty() : tensor<30xi64>
    %15 = tensor.empty(%c23) : tensor<?x22xi16>
    %alloc = memref.alloc(%c2) : memref<?x22xf16>
    %alloc_3 = memref.alloc() : memref<12xi16>
    %alloc_4 = memref.alloc(%c3, %c10) : memref<?x?xi16>
    %alloc_5 = memref.alloc() : memref<13x22xi32>
    %alloc_6 = memref.alloc() : memref<30xf16>
    %alloc_7 = memref.alloc() : memref<12xf16>
    %alloc_8 = memref.alloc() : memref<13x22xi16>
    %alloc_9 = memref.alloc(%c18) : memref<?xi16>
    %alloc_10 = memref.alloc() : memref<30xf16>
    %alloc_11 = memref.alloc() : memref<12x22xi16>
    %alloc_12 = memref.alloc(%c30) : memref<?xi32>
    %alloc_13 = memref.alloc() : memref<30xf32>
    %alloc_14 = memref.alloc(%c8, %c12) : memref<?x?xi32>
    %alloc_15 = memref.alloc(%c26, %c4) : memref<?x?xf32>
    %alloc_16 = memref.alloc() : memref<30xi64>
    %alloc_17 = memref.alloc() : memref<30xf32>
    %16 = tensor.empty() : tensor<i64>
    %17 = linalg.dot ins(%14, %alloc_16 : tensor<30xi64>, memref<30xi64>) outs(%16 : tensor<i64>) -> tensor<i64>
    %18 = math.copysign %cst_2, %cst_2 : f32
    %19 = index.maxu %c12, %c24
    %20 = spirv.CL.u_min %c1830635293_i64, %c1541256711_i64 : i64
    %alloc_18 = memref.alloc() : memref<12xi64>
    linalg.transpose ins(%11 : tensor<12xi64>) outs(%alloc_18 : memref<12xi64>) permutation = [0] 
    %21 = spirv.SLessThan %c19611_i16, %c-10120_i16 : i16
    %22 = math.ipowi %c-14386_i16, %c19611_i16 : i16
    %c0_i32 = arith.constant 0 : i32
    %23 = vector.broadcast %c0_i32 : i32 to vector<2xi32>
    %24 = spirv.BitFieldSExtract %23, %c314936925_i64, %20 : vector<2xi32>, i64, i64
    %25 = math.tanh %8 : tensor<?xf16>
    %26 = arith.minsi %c1541256711_i64, %c1541256711_i64 : i64
    %27 = spirv.ULessThan %c1830635293_i64, %c1139289150_i64 : i64
    memref.assume_alignment %alloc_12, 16 : memref<?xi32>
    %28 = scf.while (%arg0 = %8) : (tensor<?xf16>) -> tensor<?xf16> {
      %141 = vector.insertelement %c0_i32, %23[%c22 : index] : vector<2xi32>
      %142 = arith.addf %cst_0, %cst_1 : f16
      affine.store %cst_2, %alloc_17[%c18] : memref<30xf32>
      %143 = index.sub %c22, %c22
      %144 = vector.multi_reduction <add>, %23, %c0_i32 [0] : vector<2xi32> to i32
      %145 = math.cttz %20 : i64
      %146 = arith.minui %c19273_i16, %c-14386_i16 : i16
      %147 = math.absi %144 : i32
      %148 = tensor.empty(%c7) : tensor<?xf16>
      scf.condition(%27) %148 : tensor<?xf16>
    } do {
    ^bb0(%arg0: tensor<?xf16>):
      %141 = math.tanh %cst_2 : f32
      %142 = math.ipowi %14, %14 : tensor<30xi64>
      %143 = arith.shrsi %c14405_i16, %c19273_i16 : i16
      %144 = arith.divui %c19611_i16, %c-10120_i16 : i16
      %145 = math.expm1 %10 : tensor<30xf32>
      %146 = arith.shli %false, %27 : i1
      %unpack_22 = tensor.unpack %17 inner_dims_pos = [] inner_tiles = [] into %16 : tensor<i64> -> tensor<i64>
      %147 = arith.andi %20, %c1541256711_i64 : i64
      %148 = arith.divsi %c-10120_i16, %c-14386_i16 : i16
      %149 = index.sizeof
      %150 = bufferization.to_tensor %alloc_5 : memref<13x22xi32>
      linalg.transpose ins(%11 : tensor<12xi64>) outs(%alloc_18 : memref<12xi64>) permutation = [0] 
      %151 = index.add %c7, %c24
      affine.for %arg1 = 0 to 30 {
      }
      %152 = math.atan %10 : tensor<30xf32>
      %c0_i16 = arith.constant 0 : i16
      %153 = vector.transfer_read %15[%c28, %c30], %c0_i16 : tensor<?x22xi16>, vector<i16>
      %154 = tensor.empty(%c1) : tensor<?xf16>
      scf.yield %154 : tensor<?xf16>
    }
    %29 = vector.broadcast %20 : i64 to vector<13x12xi64>
    %30 = vector.broadcast %c1541256711_i64 : i64 to vector<13xi64>
    %dest, %accumulated_value = vector.scan <and>, %29, %30 {inclusive = true, reduction_dim = 1 : i64} : vector<13x12xi64>, vector<13xi64>
    %31 = spirv.GL.FAbs %cst_0 : f16
    %32 = math.roundeven %10 : tensor<30xf32>
    %33 = spirv.CL.fabs %cst_1 : f16
    %34 = spirv.GL.Cos %cst : f16
    %35 = spirv.GL.Sinh %cst_2 : f32
    vector.warp_execute_on_lane_0(%c0)[32] {
      %141 = tensor.empty() : tensor<f32>
      %142 = linalg.dot ins(%1, %1 : tensor<30xf32>, tensor<30xf32>) outs(%141 : tensor<f32>) -> tensor<f32>
      memref.copy %alloc_11, %alloc_11 : memref<12x22xi16> to memref<12x22xi16>
      %143 = vector.broadcast %31 : f16 to vector<22xf16>
      %144 = vector.broadcast %21 : i1 to vector<22xi1>
      vector.compressstore %alloc[%c0, %c21], %144, %143 : memref<?x22xf16>, vector<22xi1>, vector<22xf16>
      %145 = math.tanh %31 : f16
      affine.store %20, %alloc_16[%c10] : memref<30xi64>
      %cast = memref.cast %alloc_14 : memref<?x?xi32> to memref<?x?xi32>
      %alloc_22 = memref.alloc(%c4, %c6) : memref<?x?xi64>
      memref.tensor_store %4, %alloc_22 : memref<?x?xi64>
      %146 = memref.atomic_rmw mins %c314936925_i64, %alloc_18[%c5] : (i64, memref<12xi64>) -> i64
    }
    %36 = arith.divui %c14405_i16, %c-14386_i16 : i16
    %37 = math.rsqrt %0 : tensor<12xf32>
    %38 = spirv.Not %c-20163_i16 : i16
    %39 = bufferization.clone %alloc_3 : memref<12xi16> to memref<12xi16>
    %40 = math.floor %1 : tensor<30xf32>
    %41 = spirv.CL.rsqrt %35 : f32
    %42 = math.ceil %10 : tensor<30xf32>
    %43 = vector.insertelement %c0_i32, %23[%c14 : index] : vector<2xi32>
    %44 = spirv.INotEqual %c0_i32, %c0_i32 : i32
    %45 = math.ctlz %38 : i16
    %46 = spirv.GL.Cosh %33 : f16
    %47 = spirv.SGreaterThanEqual %c14405_i16, %38 : i16
    %48 = spirv.Not %c19273_i16 : i16
    %49 = index.floordivs %c11, %c11
    %50 = spirv.GL.Tan %46 : f16
    %51 = spirv.CL.sqrt %50 : f16
    %52 = spirv.CL.s_min %38, %c-10120_i16 : i16
    %53 = spirv.SLessThan %c314936925_i64, %20 : i64
    %54 = memref.realloc %alloc_18 : memref<12xi64> to memref<22xi64>
    %55 = spirv.CL.round %cst_0 : f16
    %56 = affine.if affine_set<(d0, d1) : (d1 - d0 == 0, d0 - (d0 - 64) - ((d0 ceildiv 16) ceildiv 32) mod 8 - 8 >= 0, d0 ceildiv 16 == 0, d1 + 128 >= 0)>(%c15, %c7) -> f32 {
      %141 = arith.minui %c1139289150_i64, %c1541256711_i64 : i64
      %142 = math.ctpop %7 : tensor<30xi32>
      %dim = tensor.dim %14, %c0 : tensor<30xi64>
      %143 = vector.flat_transpose %23 {columns = 1 : i32, rows = 2 : i32} : vector<2xi32> -> vector<2xi32>
      %144 = memref.load %alloc_5[%c11, %c11] : memref<13x22xi32>
      vector.warp_execute_on_lane_0(%c0)[32] {
        %147 = vector.shuffle %23, %143 [2] : vector<2xi32>, vector<2xi32>
        %148 = vector.broadcast %48 : i16 to vector<30xi16>
        %149 = vector.broadcast %27 : i1 to vector<30xi1>
        %150 = vector.maskedload %alloc_8[%c6, %c20], %149, %148 : memref<13x22xi16>, vector<30xi1>, vector<30xi16> into vector<30xi16>
        vector.print %149 : vector<30xi1>
        %151 = arith.addf %34, %34 : f16
        %152 = arith.shrsi %c0_i32, %c0_i32 : i32
        %153 = index.maxs %c13, %c4
        %154 = vector.extract_strided_slice %143 {offsets = [0], sizes = [1], strides = [1]} : vector<2xi32> to vector<1xi32>
        %155 = index.shrs %153, %c31
      }
      %145 = math.rsqrt %cst : f16
      %146 = math.atan2 %1, %1 : tensor<30xf32>
      affine.yield %cst_2 : f32
    } else {
      %141 = arith.addf %35, %35 : f32
      %142 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minsi>} %23, %23, %c0_i32 : vector<2xi32>, vector<2xi32> into i32
      %143 = math.atan2 %10, %1 : tensor<30xf32>
      %144 = vector.extract_strided_slice %23 {offsets = [0], sizes = [2], strides = [1]} : vector<2xi32> to vector<2xi32>
      %145 = arith.addi %c0_i32, %c0_i32 : i32
      %146 = affine.load %alloc[%c24, %c24] : memref<?x22xf16>
      %147 = arith.divui %53, %27 : i1
      %148 = arith.minsi %38, %c14405_i16 : i16
      affine.yield %35 : f32
    }
    %57 = tensor.empty(%c8) : tensor<?xi1>
    %mapped = linalg.map ins(%9, %9, %9 : tensor<?xi1>, tensor<?xi1>, tensor<?xi1>) outs(%57 : tensor<?xi1>)
      (%in: i1, %in_22: i1, %in_23: i1) {
        %141 = math.roundeven %35 : f32
        vector.print %23 : vector<2xi32>
        scf.index_switch %c9 
        case 1 {
          %169 = arith.minsi %in_22, %47 : i1
          %170 = vector.flat_transpose %23 {columns = 1 : i32, rows = 2 : i32} : vector<2xi32> -> vector<2xi32>
          %171 = math.round %1 : tensor<30xf32>
          %172 = index.castu %48 : i16 to index
          %173 = vector.transpose %170, [0] : vector<2xi32> to vector<2xi32>
          %174 = index.add %c0, %c27
          %175 = arith.shrui %c14405_i16, %c19273_i16 : i16
          %176 = math.round %33 : f16
          %177 = vector.extract_strided_slice %170 {offsets = [0], sizes = [2], strides = [1]} : vector<2xi32> to vector<2xi32>
          affine.vector_store %177, %alloc_12[%c18] : memref<?xi32>, vector<2xi32>
          %178 = tensor.empty() : tensor<22x13xi16>
          %transposed_26 = linalg.transpose ins(%alloc_8 : memref<13x22xi16>) outs(%178 : tensor<22x13xi16>) permutation = [1, 0] 
          %179 = math.tan %cst : f16
          %180 = arith.negf %34 : f16
          %181 = index.ceildivs %c30, %c16
          %182 = vector.flat_transpose %177 {columns = 1 : i32, rows = 2 : i32} : vector<2xi32> -> vector<2xi32>
          %183 = vector.insert %c0_i32, %177 [0] : i32 into vector<2xi32>
          scf.yield
        }
        case 2 {
          %169 = bufferization.clone %alloc_13 : memref<30xf32> to memref<30xf32>
          %170 = affine.min affine_map<(d0, d1)[s0] -> (d1)>(%c0, %c24)[%c18]
          %171 = math.atan2 %cst, %cst : f16
          %172 = index.shrs %c28, %c27
          %173 = index.and %c22, %c5
          %174 = vector.insert %c0_i32, %23 [0] : i32 into vector<2xi32>
          %175 = index.divs %c31, %19
          %176 = arith.divui %c-20163_i16, %c19273_i16 : i16
          %177 = vector.load %alloc_8[%c0, %c17] : memref<13x22xi16>, vector<13x22xi16>
          %178 = arith.cmpi ugt, %20, %c314936925_i64 : i64
          %179 = vector.extract_strided_slice %23 {offsets = [0], sizes = [1], strides = [1]} : vector<2xi32> to vector<1xi32>
          %180 = tensor.empty() : tensor<30xf16>
          %transposed_26 = linalg.transpose ins(%alloc_10 : memref<30xf16>) outs(%180 : tensor<30xf16>) permutation = [0] 
          %cst_27 = arith.constant 0.000000e+00 : f32
          %181 = vector.transfer_read %10[%c14], %cst_27 : tensor<30xf32>, vector<f32>
          %182 = vector.insert %c0_i32, %23 [1] : i32 into vector<2xi32>
          %183 = index.shru %c2, %c21
          %184 = index.mul %c28, %c7
          scf.yield
        }
        default {
          %169 = vector.broadcast %c0_i32 : i32 to vector<22x22xi32>
          %170 = vector.broadcast %c0_i32 : i32 to vector<22xi32>
          %dest_26, %accumulated_value_27 = vector.scan <xor>, %169, %170 {inclusive = false, reduction_dim = 1 : i64} : vector<22x22xi32>, vector<22xi32>
          vector.print %23 : vector<2xi32>
          %171 = arith.remf %41, %cst_2 : f32
          linalg.transpose ins(%5 : tensor<?x?xi32>) outs(%alloc_14 : memref<?x?xi32>) permutation = [1, 0] 
          %172 = arith.negf %cst_0 : f16
          %173 = math.tanh %1 : tensor<30xf32>
          %174 = index.castu %c7 : index to i32
          %175 = arith.minsi %c1139289150_i64, %c1541256711_i64 : i64
          %176 = arith.xori %c14405_i16, %c19611_i16 : i16
          %177 = vector.broadcast %c0_i32 : i32 to vector<2x2xi32>
          %178 = vector.outerproduct %23, %23, %177 {kind = #vector.kind<or>} : vector<2xi32>, vector<2xi32>
          %179 = math.tanh %41 : f32
          %alloc_28 = memref.alloc(%c26) : memref<?xi1>
          memref.tensor_store %9, %alloc_28 : memref<?xi1>
          %180 = math.atan2 %1, %10 : tensor<30xf32>
          vector.print %23 : vector<2xi32>
          %181 = index.castu %c21 : index to i32
          %inserted_29 = tensor.insert %c1830635293_i64 into %6[%c0, %c0] : tensor<?x?xi64>
        }
        %142 = arith.shli %in, %in_22 : i1
        %inserted = tensor.insert %20 into %11[%c8] : tensor<12xi64>
        %143 = arith.remsi %20, %c1139289150_i64 : i64
        %144 = index.shrs %c13, %c23
        %145 = vector.insertelement %c0_i32, %23[%c20 : index] : vector<2xi32>
        %146 = index.shru %c5, %c19
        %147 = arith.shrsi %in, %27 : i1
        %148 = math.tan %8 : tensor<?xf16>
        %149 = index.divu %c15, %c30
        %150 = math.exp %10 : tensor<30xf32>
        %151 = arith.remui %false, %true : i1
        %152 = vector.broadcast %c19611_i16 : i16 to vector<22x13xi16>
        %153 = vector.broadcast %c14405_i16 : i16 to vector<22xi16>
        %dest_24, %accumulated_value_25 = vector.scan <maxui>, %152, %153 {inclusive = true, reduction_dim = 1 : i64} : vector<22x13xi16>, vector<22xi16>
        %154 = arith.remsi %c314936925_i64, %c1541256711_i64 : i64
        %155 = bufferization.to_tensor %alloc_17 : memref<30xf32>
        %156 = index.divu %c10, %c6
        %cast = tensor.cast %9 : tensor<?xi1> to tensor<22xi1>
        %157 = math.ctlz %3 : tensor<?xi16>
        %158 = math.atan2 %55, %cst : f16
        %159 = bufferization.clone %alloc_17 : memref<30xf32> to memref<30xf32>
        %160 = affine.vector_load %alloc[%c9, %c7] : memref<?x22xf16>, vector<13xf16>
        %161 = math.log %0 : tensor<12xf32>
        %162 = arith.divui %c-10120_i16, %c-20163_i16 : i16
        memref.copy %alloc_8, %alloc_8 : memref<13x22xi16> to memref<13x22xi16>
        %163 = arith.addf %cst_0, %51 : f16
        %164 = index.castu %c1 : index to i32
        %165 = vector.broadcast %in : i1 to vector<2xi1>
        vector.compressstore %alloc_5[%c7, %c19], %165, %23 : memref<13x22xi32>, vector<2xi1>, vector<2xi32>
        %166 = index.divs %c15, %c27
        %167 = math.fpowi %10, %7 : tensor<30xf32>, tensor<30xi32>
        %168 = vector.load %alloc_12[%c0] : memref<?xi32>, vector<12x22xi32>
        linalg.yield %in_22 : i1
      }
    %58 = index.sizeof
    %59 = spirv.CL.round %50 : f16
    %60 = index.castu %c28 : index to i32
    %61 = spirv.CL.rint %cst : f16
    %62 = math.log2 %33 : f16
    %from_elements = tensor.from_elements %46, %34, %cst, %59, %61, %cst_0, %cst_1, %59, %55, %61, %cst_0, %51 : tensor<12xf16>
    %63 = spirv.CL.fabs %35 : f32
    %64 = arith.xori %c1139289150_i64, %c314936925_i64 : i64
    %65 = spirv.CL.log %cst_0 : f16
    %66 = math.atan2 %41, %41 : f32
    %67 = arith.cmpi eq, %27, %53 : i1
    %68 = spirv.GL.FAbs %61 : f16
    %69 = scf.while (%arg0 = %c1139289150_i64) : (i64) -> i64 {
      %141 = vector.broadcast %c0_i32 : i32 to vector<2x2xi32>
      %142 = vector.outerproduct %23, %23, %141 {kind = #vector.kind<xor>} : vector<2xi32>, vector<2xi32>
      %143 = index.sub %c19, %c6
      %144 = arith.cmpi ule, %true, %21 : i1
      %145 = arith.xori %c314936925_i64, %c1541256711_i64 : i64
      %146 = index.and %c27, %c3
      %147 = math.fma %0, %0, %0 : tensor<12xf32>
      memref.assume_alignment %alloc_6, 16 : memref<30xf16>
      %148 = index.divs %c14, %c28
      scf.condition(%false) %c314936925_i64 : i64
    } do {
    ^bb0(%arg0: i64):
      %expanded = tensor.expand_shape %0 [[0, 1]] : tensor<12xf32> into tensor<12x1xf32>
      %141 = tensor.empty() : tensor<13x22xi1>
      %142 = arith.xori %52, %38 : i16
      %143 = arith.remf %50, %31 : f16
      %144 = arith.remf %cst_0, %34 : f16
      %145 = math.exp %34 : f16
      %alloc_22 = memref.alloc() : memref<12x1xf32>
      memref.tensor_store %expanded, %alloc_22 : memref<12x1xf32>
      %rank = tensor.rank %15 : tensor<?x22xi16>
      %146 = math.tan %61 : f16
      %147 = tensor.empty() : tensor<12xi1>
      %148 = vector.broadcast %53 : i1 to vector<12xi1>
      %149 = vector.broadcast %c0_i32 : i32 to vector<12xi32>
      %150 = vector.gather %147[%c8] [%149], %148, %148 : tensor<12xi1>, vector<12xi32>, vector<12xi1>, vector<12xi1> into vector<12xi1>
      %151 = arith.minsi %arg0, %c1541256711_i64 : i64
      %152 = arith.floordivsi %c-10120_i16, %c-14386_i16 : i16
      %153 = math.roundeven %cst_0 : f16
      %154 = math.expm1 %59 : f16
      %155 = vector.flat_transpose %150 {columns = 3 : i32, rows = 4 : i32} : vector<12xi1> -> vector<12xi1>
      %156 = vector.broadcast %c0_i32 : i32 to vector<13x22xi32>
      %157 = vector.broadcast %44 : i1 to vector<13x22xi1>
      %158 = vector.gather %alloc_5[%c21, %19] [%156], %157, %156 : memref<13x22xi32>, vector<13x22xi32>, vector<13x22xi1>, vector<13x22xi32> into vector<13x22xi32>
      scf.yield %c1139289150_i64 : i64
    }
    %70 = spirv.GL.Cosh %cst_0 : f16
    vector.print %23 : vector<2xi32>
    %71 = math.log10 %0 : tensor<12xf32>
    %72 = affine.if affine_set<(d0, d1) : (0 == 0, (d0 - (d0 - 1) + d1 + 16) * -16 >= 0, d0 - (d0 - 1) + d1 + 24 >= 0)>(%c14, %c2) -> memref<13x22xf16> {
      %141 = bufferization.clone %alloc_13 : memref<30xf32> to memref<30xf32>
      %142 = math.exp %8 : tensor<?xf16>
      %143 = arith.negf %46 : f16
      %144 = arith.xori %47, %27 : i1
      %145 = math.round %46 : f16
      %146 = index.floordivs %c29, %c14
      %147 = index.ceildivs %c19, %c23
      %148 = index.sub %c22, %c3
      %alloc_22 = memref.alloc() : memref<13x22xf16>
      affine.yield %alloc_22 : memref<13x22xf16>
    } else {
      %dim = tensor.dim %12, %c0 : tensor<12x22xi32>
      %141 = math.expm1 %cst_1 : f16
      %transposed_22 = linalg.transpose ins(%from_elements : tensor<12xf16>) outs(%from_elements : tensor<12xf16>) permutation = [0] 
      %expanded = tensor.expand_shape %0 [[0, 1]] : tensor<12xf32> into tensor<12x1xf32>
      %142 = arith.remui %c0_i32, %c0_i32 : i32
      %143 = tensor.empty() : tensor<12xi32>
      %144 = vector.insertelement %c0_i32, %23[%c25 : index] : vector<2xi32>
      %rank = tensor.rank %0 : tensor<12xf32>
      %alloc_23 = memref.alloc() : memref<13x22xf16>
      affine.yield %alloc_23 : memref<13x22xf16>
    }
    %73 = vector.splat %70 : vector<12xf16>
    %74 = arith.remsi %44, %21 : i1
    %75 = spirv.CL.sqrt %34 : f16
    %76 = index.shru %c26, %c15
    %77 = spirv.GL.Asin %31 : f16
    vector.warp_execute_on_lane_0(%c0)[32] {
      %141 = math.log2 %33 : f16
      %inserted = tensor.insert %c14405_i16 into %3[%c0] : tensor<?xi16>
      %142 = index.ceildivu %c2, %c20
      %alloc_22 = memref.alloc() : memref<13x22xi32>
      %143 = affine.load %alloc_12[%c31] : memref<?xi32>
      %144 = tensor.empty(%c19) : tensor<?xf32>
      memref.copy %alloc_6, %alloc_10 : memref<30xf16> to memref<30xf16>
      %145 = affine.if affine_set<(d0, d1, d2, d3) : (-d2 == 0, -(d1 - d2) >= 0)>(%c8, %c16, %c0, %c31) -> i32 {
        %146 = arith.remsi %c1139289150_i64, %c1830635293_i64 : i64
        %147 = index.ceildivu %c27, %c9
        %148 = bufferization.clone %39 : memref<12xi16> to memref<12xi16>
        %149 = arith.ceildivsi %true, %47 : i1
        %150 = bufferization.clone %alloc_17 : memref<30xf32> to memref<30xf32>
        %151 = vector.broadcast %true : i1 to vector<2xi1>
        %152 = vector.mask %151 { vector.multi_reduction <minsi>, %23, %23 [] : vector<2xi32> to vector<2xi32> } : vector<2xi1> -> vector<2xi32>
        %alloc_23 = memref.alloc(%c14) : memref<?x22xi16>
        memref.tensor_store %15, %alloc_23 : memref<?x22xi16>
        %153 = math.tan %65 : f16
        affine.yield %143 : i32
      } else {
        %146 = index.shrs %c19, %c3
        memref.copy %alloc_16, %alloc_16 : memref<30xi64> to memref<30xi64>
        %147 = arith.divsi %c314936925_i64, %20 : i64
        %148 = memref.realloc %alloc_17 : memref<30xf32> to memref<30xf32>
        %cast = tensor.cast %3 : tensor<?xi16> to tensor<22xi16>
        %149 = vector.insertelement %143, %23[%49 : index] : vector<2xi32>
        %150 = vector.broadcast %c1830635293_i64 : i64 to vector<12xi64>
        %151 = vector.broadcast %false : i1 to vector<12xi1>
        %152 = vector.maskedload %alloc_16[%c9], %151, %150 : memref<30xi64>, vector<12xi1>, vector<12xi64> into vector<12xi64>
        %153 = math.expm1 %cst_2 : f32
        affine.yield %143 : i32
      }
    }
    %78 = spirv.FOrdLessThan %cst, %33 : f16
    %79 = arith.mulf %41, %41 : f32
    %80 = tensor.empty() : tensor<22x22xi16>
    %81 = tensor.empty() : tensor<13x22xi16>
    %82 = linalg.matmul ins(%alloc_8, %80 : memref<13x22xi16>, tensor<22x22xi16>) outs(%81 : tensor<13x22xi16>) -> tensor<13x22xi16>
    %83 = scf.execute_region -> f16 {
      %141 = index.sizeof
      %142 = memref.load %alloc_14[%c0, %c0] : memref<?x?xi32>
      %143 = affine.if affine_set<(d0) : (-d0 == 0)>(%c20) -> f32 {
        %155 = tensor.empty() : tensor<264xi32>
        %unpack_22 = tensor.unpack %12 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [%c22] into %155 : tensor<12x22xi32> -> tensor<264xi32>
        %unpack_23 = tensor.unpack %12 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [%c22] into %155 : tensor<12x22xi32> -> tensor<264xi32>
        %156 = arith.xori %52, %c14405_i16 : i16
        %157 = arith.cmpi ult, %c0_i32, %c0_i32 : i32
        %158 = vector.splat %c3 : vector<12xindex>
        %159 = vector.insertelement %c0_i32, %23[%c31 : index] : vector<2xi32>
        memref.copy %alloc_6, %alloc_10 : memref<30xf16> to memref<30xf16>
        %160 = index.maxu %c24, %c26
        affine.yield %35 : f32
      } else {
        %155 = math.roundeven %10 : tensor<30xf32>
        %156 = vector.broadcast %c0_i32 : i32 to vector<22x22xi32>
        %157 = vector.broadcast %c0_i32 : i32 to vector<22xi32>
        %dest_22, %accumulated_value_23 = vector.scan <minsi>, %156, %157 {inclusive = false, reduction_dim = 1 : i64} : vector<22x22xi32>, vector<22xi32>
        %158 = vector.transpose %23, [0] : vector<2xi32> to vector<2xi32>
        %expanded = tensor.expand_shape %15 [[0], [1, 2]] : tensor<?x22xi16> into tensor<?x22x1xi16>
        %159 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxui>} %23, %23, %c0_i32 : vector<2xi32>, vector<2xi32> into i32
        %160 = bufferization.clone %alloc_16 : memref<30xi64> to memref<30xi64>
        %161 = vector.insert %c0_i32, %23 [0] : i32 into vector<2xi32>
        %162 = math.cttz %6 : tensor<?x?xi64>
        affine.yield %35 : f32
      }
      %144 = vector.broadcast %c0_i32 : i32 to vector<2x2xi32>
      %145 = vector.outerproduct %23, %23, %144 {kind = #vector.kind<maxsi>} : vector<2xi32>, vector<2xi32>
      %146 = vector.broadcast %77 : f16 to vector<30xf16>
      %147 = vector.broadcast %47 : i1 to vector<30xi1>
      %148 = vector.maskedload %alloc_6[%c16], %147, %146 : memref<30xf16>, vector<30xi1>, vector<30xf16> into vector<30xf16>
      affine.for %arg0 = 0 to 123 {
      }
      %149 = math.round %35 : f32
      %150 = vector.flat_transpose %146 {columns = 5 : i32, rows = 6 : i32} : vector<30xf16> -> vector<30xf16>
      memref.assume_alignment %alloc, 4 : memref<?x22xf16>
      %151 = vector.splat %76 : vector<30xindex>
      %152 = arith.minsi %21, %21 : i1
      %153 = arith.subi %c1541256711_i64, %c1830635293_i64 : i64
      memref.copy %alloc_11, %alloc_11 : memref<12x22xi16> to memref<12x22xi16>
      %rank = tensor.rank %13 : tensor<?x22xi16>
      vector.warp_execute_on_lane_0(%c0)[32] {
        %155 = vector.multi_reduction <maxf>, %148, %146 [] : vector<30xf16> to vector<30xf16>
        %cast = tensor.cast %6 : tensor<?x?xi64> to tensor<22x12xi64>
        vector.compressstore %alloc_10[%c28], %147, %150 : memref<30xf16>, vector<30xi1>, vector<30xf16>
        %156 = affine.min affine_map<(d0, d1, d2) -> (d1 mod 32 - d0 mod 4)>(%c3, %c16, %58)
        %157 = index.add %c15, %c11
        %158 = math.exp %59 : f16
        %cast_22 = memref.cast %alloc_18 : memref<12xi64> to memref<12xi64>
        %159 = vector.broadcast %c19273_i16 : i16 to vector<i16>
        %160 = vector.transfer_write %159, %3[%c17] : vector<i16>, tensor<?xi16>
      }
      %154 = arith.muli %false, %true : i1
      scf.yield %50 : f16
    }
    %84 = spirv.GL.FMin %33, %70 : f16
    %85 = spirv.GL.SSign %c19611_i16 : i16
    %86 = vector.extract_strided_slice %23 {offsets = [0], sizes = [2], strides = [1]} : vector<2xi32> to vector<2xi32>
    %87 = spirv.CL.round %51 : f16
    %88 = affine.vector_load %alloc_5[%c2, %c19] : memref<13x22xi32>, vector<13xi32>
    %89 = vector.shuffle %23, %86 [0, 1] : vector<2xi32>, vector<2xi32>
    %90 = index.sizeof
    %91 = spirv.SGreaterThanEqual %48, %38 : i16
    %92 = vector.flat_transpose %23 {columns = 1 : i32, rows = 2 : i32} : vector<2xi32> -> vector<2xi32>
    %false_19 = index.bool.constant false
    %93 = math.tanh %75 : f16
    %94 = spirv.FOrdEqual %68, %59 : f16
    %95 = spirv.GL.Tanh %46 : f16
    %96 = vector.broadcast %33 : f16 to vector<30xf16>
    %97 = vector.broadcast %true : i1 to vector<30xi1>
    vector.compressstore %alloc_6[%c29], %97, %96 : memref<30xf16>, vector<30xi1>, vector<30xf16>
    %98 = memref.atomic_rmw addf %46, %alloc_7[%c11] : (f16, memref<12xf16>) -> f16
    %99 = vector.multi_reduction <and>, %23, %c0_i32 [0] : vector<2xi32> to i32
    %100 = tensor.empty() : tensor<30xf16>
    %transposed = linalg.transpose ins(%alloc_6 : memref<30xf16>) outs(%100 : tensor<30xf16>) permutation = [0] 
    %101 = math.rsqrt %100 : tensor<30xf16>
    %102 = arith.andi %85, %38 : i16
    %alloc_20 = memref.alloc() : memref<13x22x12xi16>
    linalg.broadcast ins(%alloc_8 : memref<13x22xi16>) outs(%alloc_20 : memref<13x22x12xi16>) dimensions = [2] 
    %103 = spirv.FUnordNotEqual %34, %83 : f16
    %104 = math.log10 %65 : f16
    %105 = arith.remui %27, %78 : i1
    %106 = spirv.CL.rint %cst_0 : f16
    %alloc_21 = memref.alloc(%c10) : memref<?x22x12xf16>
    linalg.broadcast ins(%alloc : memref<?x22xf16>) outs(%alloc_21 : memref<?x22x12xf16>) dimensions = [2] 
    %107 = index.shl %c28, %19
    %108 = spirv.GL.FMix %70 : f16, %83 : f16, %55 : f16 -> f16
    %109 = spirv.FUnordGreaterThan %33, %106 : f16
    %unpack = tensor.unpack %16 inner_dims_pos = [] inner_tiles = [] into %17 : tensor<i64> -> tensor<i64>
    %110 = arith.remf %65, %75 : f16
    %111 = scf.index_switch %c7 -> tensor<?x?xi1> 
    case 1 {
      %141 = index.shl %c16, %76
      %142 = tensor.empty(%c2) : tensor<?xi1>
      %mapped_22 = linalg.map ins(%57, %9, %9 : tensor<?xi1>, tensor<?xi1>, tensor<?xi1>) outs(%142 : tensor<?xi1>)
        (%in: i1, %in_23: i1, %in_24: i1) {
          %156 = math.tan %77 : f16
          %157 = math.ipowi %52, %c14405_i16 : i16
          %158 = arith.shli %99, %99 : i32
          %159 = vector.multi_reduction <minsi>, %23, %99 [0] : vector<2xi32> to i32
          %160 = index.and %c20, %c6
          %alloca = memref.alloca() : memref<12x22xf16>
          %161 = math.floor %83 : f16
          %162 = math.tan %87 : f16
          %163 = vector.shuffle %86, %86 [0, 1, 3] : vector<2xi32>, vector<2xi32>
          %alloca_25 = memref.alloca() : memref<12x22xf32>
          %164 = index.divs %c24, %160
          %165 = math.atan %1 : tensor<30xf32>
          %166 = arith.divsi %c1830635293_i64, %20 : i64
          %167 = arith.minui %false_19, %94 : i1
          %168 = math.atan2 %cst_0, %31 : f16
          %169 = math.roundeven %cst_1 : f16
          %170 = memref.realloc %39 : memref<12xi16> to memref<22xi16>
          %171 = vector.insertelement %99, %23[%c10 : index] : vector<2xi32>
          %172 = math.log1p %95 : f16
          memref.store %c1139289150_i64, %alloc_18[%c9] : memref<12xi64>
          %173 = math.fpowi %cst, %159 : f16, i32
          %174 = index.divu %141, %c8
          %175 = memref.realloc %alloc_6 : memref<30xf16> to memref<13xf16>
          %176 = tensor.empty(%c16) : tensor<13x?xi64>
          %expanded = tensor.expand_shape %14 [[0, 1]] : tensor<30xi64> into tensor<30x1xi64>
          %cast = memref.cast %alloc_20 : memref<13x22x12xi16> to memref<13x22x?xi16>
          %177 = vector.shuffle %86, %86 [3] : vector<2xi32>, vector<2xi32>
          %178 = arith.ori %c-14386_i16, %c19273_i16 : i16
          %179 = vector.shuffle %23, %86 [2, 3] : vector<2xi32>, vector<2xi32>
          %180 = linalg.copy ins(%0 : tensor<12xf32>) outs(%0 : tensor<12xf32>) -> tensor<12xf32>
          %181 = index.castu %78 : i1 to index
          %182 = vector.broadcast %85 : i16 to vector<22xi16>
          %183 = vector.broadcast %in : i1 to vector<22xi1>
          vector.compressstore %alloc_9[%c0], %183, %182 : memref<?xi16>, vector<22xi1>, vector<22xi16>
          linalg.yield %true : i1
        }
      %143 = index.shru %141, %c27
      vector.print %23 : vector<2xi32>
      %144 = math.exp %59 : f16
      %145 = vector.multi_reduction <maxui>, %86, %c0_i32 [0] : vector<2xi32> to i32
      %146 = math.ctlz %4 : tensor<?x?xi64>
      %147 = index.sizeof
      affine.vector_store %23, %alloc_5[%c28, %c24] : memref<13x22xi32>, vector<2xi32>
      %rank = tensor.rank %7 : tensor<30xi32>
      %148 = vector.load %alloc_5[%c10, %c1] : memref<13x22xi32>, vector<13x22xi32>
      %149 = tensor.empty() : tensor<12x22xi64>
      %150 = vector.broadcast %c1830635293_i64 : i64 to vector<13x22xi64>
      %151 = vector.broadcast %44 : i1 to vector<13x22xi1>
      %152 = vector.gather %149[%c14, %107] [%148], %151, %150 : tensor<12x22xi64>, vector<13x22xi32>, vector<13x22xi1>, vector<13x22xi64> into vector<13x22xi64>
      %153 = arith.remui %78, %53 : i1
      %154 = affine.min affine_map<(d0, d1) -> (-d0)>(%c10, %c30)
      memref.assume_alignment %alloc_11, 4 : memref<12x22xi16>
      memref.assume_alignment %alloc_3, 1 : memref<12xi16>
      %155 = tensor.empty(%c7, %c14) : tensor<?x?xi1>
      scf.yield %155 : tensor<?x?xi1>
    }
    case 2 {
      %141 = math.fpowi %61, %c0_i32 : f16, i32
      %142 = arith.xori %true, %false : i1
      %143 = math.rsqrt %33 : f16
      %144 = vector.insertelement %99, %92[%c13 : index] : vector<2xi32>
      scf.index_switch %c20 
      case 1 {
        %155 = arith.divui %48, %c19611_i16 : i16
        %156 = arith.ceildivsi %c-14386_i16, %c19611_i16 : i16
        %157 = vector.broadcast %27 : i1 to vector<2xi1>
        vector.compressstore %alloc_14[%c0, %c0], %157, %23 : memref<?x?xi32>, vector<2xi1>, vector<2xi32>
        vector.print %88 : vector<13xi32>
        %158 = math.expm1 %cst_0 : f16
        %159 = tensor.empty() : tensor<22x30xi16>
        %160 = tensor.empty() : tensor<13x30xi16>
        %161 = linalg.matmul ins(%alloc_8, %159 : memref<13x22xi16>, tensor<22x30xi16>) outs(%160 : tensor<13x30xi16>) -> tensor<13x30xi16>
        %162 = arith.remf %68, %55 : f16
        %163 = memref.load %alloc_5[%c9, %c10] : memref<13x22xi32>
        %164 = vector.insertelement %99, %23[%c27 : index] : vector<2xi32>
        %true_22 = index.bool.constant true
        %165 = arith.shrsi %47, %27 : i1
        %alloc_23 = memref.alloc(%c15, %c8) : memref<?x?xi64>
        memref.tensor_store %6, %alloc_23 : memref<?x?xi64>
        %166 = memref.realloc %39 : memref<12xi16> to memref<22xi16>
        linalg.transpose ins(%39 : memref<12xi16>) outs(%39 : memref<12xi16>) permutation = [0] 
        %167 = math.round %41 : f32
        %168 = tensor.empty(%c7) : tensor<12x?xi64>
        scf.yield
      }
      case 2 {
        %155 = bufferization.clone %alloc_5 : memref<13x22xi32> to memref<13x22xi32>
        %156 = vector.insert %c0_i32, %86 [1] : i32 into vector<2xi32>
        %157 = math.atan2 %cst, %46 : f16
        %158 = index.castu %c30 : index to i32
        %159 = vector.broadcast %c0_i32 : i32 to vector<30xi32>
        %160 = vector.broadcast %78 : i1 to vector<30xi1>
        %161 = vector.gather %7[%c21] [%159], %160, %159 : tensor<30xi32>, vector<30xi32>, vector<30xi1>, vector<30xi32> into vector<30xi32>
        %162 = memref.load %alloc_16[%c13] : memref<30xi64>
        %163 = arith.shrsi %94, %109 : i1
        %164 = index.ceildivs %c11, %c27
        %165 = vector.splat %c31 : vector<30xindex>
        %166 = vector.extract_strided_slice %159 {offsets = [6], sizes = [22], strides = [1]} : vector<30xi32> to vector<22xi32>
        %167 = index.castu %c314936925_i64 : i64 to index
        %168 = math.absi %5 : tensor<?x?xi32>
        %169 = vector.load %alloc_7[%c1] : memref<12xf16>, vector<13x22xf16>
        %170 = index.and %c31, %c15
        %171 = arith.shrui %103, %91 : i1
        %172 = arith.remf %51, %106 : f16
        scf.yield
      }
      case 3 {
        %155 = arith.addf %83, %cst_0 : f16
        %156 = vector.matrix_multiply %92, %92 {lhs_columns = 2 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<2xi32>, vector<2xi32>) -> vector<1xi32>
        %157 = arith.cmpi uge, %c19611_i16, %38 : i16
        %158 = vector.insertelement %c0_i32, %156[%c19 : index] : vector<1xi32>
        %159 = math.round %83 : f16
        %160 = vector.extract_strided_slice %88 {offsets = [1], sizes = [8], strides = [1]} : vector<13xi32> to vector<8xi32>
        %rank = tensor.rank %13 : tensor<?x22xi16>
        %161 = affine.apply affine_map<(d0) -> ((d0 ceildiv 4) ceildiv 32)>(%c28)
        %162 = math.log1p %77 : f16
        %163 = vector.load %alloc_9[%c0] : memref<?xi16>, vector<12xi16>
        %164 = math.round %55 : f16
        %alloca = memref.alloca(%c10) : memref<?x22xf32>
        bufferization.dealloc_tensor %15 : tensor<?x22xi16>
        %165 = arith.xori %53, %false : i1
        %166 = index.castu %c13 : index to i32
        %167 = arith.cmpf uge, %65, %75 : f16
        scf.yield
      }
      default {
        %155 = vector.shuffle %86, %86 [1] : vector<2xi32>, vector<2xi32>
        %156 = tensor.empty() : tensor<22x13xi16>
        %157 = tensor.empty(%c10) : tensor<?x13xi16>
        %158 = linalg.matmul ins(%13, %156 : tensor<?x22xi16>, tensor<22x13xi16>) outs(%157 : tensor<?x13xi16>) -> tensor<?x13xi16>
        %159 = vector.insertelement %c0_i32, %92[%c0 : index] : vector<2xi32>
        %160 = bufferization.to_tensor %alloc_3 : memref<12xi16>
        %161 = math.round %transposed : tensor<30xf16>
        %162 = index.and %c20, %c28
        %163 = vector.shuffle %86, %92 [0, 1] : vector<2xi32>, vector<2xi32>
        %164 = vector.broadcast %c0_i32 : i32 to vector<13x13xi32>
        %165 = vector.outerproduct %88, %88, %164 {kind = #vector.kind<xor>} : vector<13xi32>, vector<13xi32>
        %166 = arith.remui %c19273_i16, %85 : i16
        memref.copy %alloc_5, %alloc_5 : memref<13x22xi32> to memref<13x22xi32>
        %167 = tensor.empty() : tensor<264xi32>
        %unpack_22 = tensor.unpack %12 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [%c22] into %167 : tensor<12x22xi32> -> tensor<264xi32>
        %cast = memref.cast %alloc_4 : memref<?x?xi16> to memref<?x22xi16>
        vector.print %92 : vector<2xi32>
        vector.print %88 : vector<13xi32>
        %168 = math.floor %75 : f16
        %169 = linalg.copy ins(%15 : tensor<?x22xi16>) outs(%15 : tensor<?x22xi16>) -> tensor<?x22xi16>
      }
      %145 = memref.load %alloc[%c0, %c14] : memref<?x22xf16>
      scf.execute_region {
        affine.store %20, %alloc_18[%c15] : memref<12xi64>
        %155 = bufferization.clone %alloc_10 : memref<30xf16> to memref<30xf16>
        %156 = vector.shuffle %23, %92 [1, 3] : vector<2xi32>, vector<2xi32>
        %157 = math.log10 %transposed : tensor<30xf16>
        %158 = math.log2 %84 : f16
        %159 = bufferization.clone %alloc_13 : memref<30xf32> to memref<30xf32>
        %160 = vector.matrix_multiply %92, %23 {lhs_columns = 2 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<2xi32>, vector<2xi32>) -> vector<1xi32>
        %161 = arith.xori %44, %53 : i1
        %162 = math.atan2 %35, %35 : f32
        %alloc_22 = memref.alloc(%c12) : memref<?x30xi1>
        linalg.broadcast ins(%57 : tensor<?xi1>) outs(%alloc_22 : memref<?x30xi1>) dimensions = [1] 
        %163 = tensor.empty(%c3) : tensor<?xi16>
        %164 = arith.divsi %44, %109 : i1
        %165 = math.floor %35 : f32
        %166 = vector.insertelement %c0_i32, %23[%c28 : index] : vector<2xi32>
        %167 = vector.extract_strided_slice %92 {offsets = [0], sizes = [2], strides = [1]} : vector<2xi32> to vector<2xi32>
        %168 = arith.shli %78, %47 : i1
        scf.yield
      }
      %146 = math.ceil %61 : f16
      %147 = scf.while (%arg0 = %4) : (tensor<?x?xi64>) -> tensor<?x?xi64> {
        bufferization.dealloc_tensor %10 : tensor<30xf32>
        %inserted = tensor.insert %c1541256711_i64 into %17[] : tensor<i64>
        %155 = vector.broadcast %78 : i1 to vector<2xi1>
        vector.compressstore %alloc_5[%c11, %c21], %155, %92 : memref<13x22xi32>, vector<2xi1>, vector<2xi32>
        %156 = vector.extract_strided_slice %86 {offsets = [0], sizes = [2], strides = [1]} : vector<2xi32> to vector<2xi32>
        %157 = math.tanh %46 : f16
        %158 = math.ceil %106 : f16
        %159 = vector.insert %99, %86 [1] : i32 into vector<2xi32>
        %expanded = tensor.expand_shape %10 [[0, 1]] : tensor<30xf32> into tensor<30x1xf32>
        %160 = tensor.empty(%c26, %c18) : tensor<?x?xi64>
        scf.condition(%78) %160 : tensor<?x?xi64>
      } do {
      ^bb0(%arg0: tensor<?x?xi64>):
        vector.print %88 : vector<13xi32>
        %155 = math.ipowi %48, %38 : i16
        %156 = vector.flat_transpose %23 {columns = 1 : i32, rows = 2 : i32} : vector<2xi32> -> vector<2xi32>
        %157 = tensor.empty() : tensor<264xi32>
        %unpack_22 = tensor.unpack %12 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [%c22] into %157 : tensor<12x22xi32> -> tensor<264xi32>
        %true_23 = index.bool.constant true
        %158 = math.absi %53 : i1
        %159 = index.xor %c13, %c15
        affine.store %35, %alloc_15[%c5, %c25] : memref<?x?xf32>
        %160 = arith.floordivsi %47, %109 : i1
        %161 = arith.minsi %true_23, %47 : i1
        %162 = linalg.copy ins(%from_elements : tensor<12xf16>) outs(%from_elements : tensor<12xf16>) -> tensor<12xf16>
        %163 = math.roundeven %35 : f32
        %164 = vector.broadcast %c-10120_i16 : i16 to vector<30xi16>
        %165 = vector.transfer_write %164, %15[%c14, %c3] {permutation_map = affine_map<(d0, d1) -> (d0)>} : vector<30xi16>, tensor<?x22xi16>
        %rank = tensor.rank %2 : tensor<?xi1>
        %166 = bufferization.clone %alloc_11 : memref<12x22xi16> to memref<12x22xi16>
        %rank_24 = tensor.rank %157 : tensor<264xi32>
        %167 = tensor.empty(%c12, %58) : tensor<?x?xi64>
        scf.yield %167 : tensor<?x?xi64>
      }
      %148 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minsi>} %88, %88, %c0_i32 : vector<13xi32>, vector<13xi32> into i32
      %149 = index.xor %c0, %c4
      %150 = arith.remf %33, %46 : f16
      memref.assume_alignment %alloc, 16 : memref<?x22xf16>
      %151 = vector.insert %99, %92 [1] : i32 into vector<2xi32>
      %152 = affine.if affine_set<(d0, d1) : (d0 * 2 - 1 >= 0, (d0 + d0 * 2 - 1 - (d0 * 32 + d0 * 2 - 64)) ceildiv 4 >= 0, d0 * 32 >= 0)>(%c24, %c13) -> memref<12xi32> {
        %155 = math.ctpop %57 : tensor<?xi1>
        %unpack_22 = tensor.unpack %17 inner_dims_pos = [] inner_tiles = [] into %17 : tensor<i64> -> tensor<i64>
        %156 = memref.load %alloc_17[%c16] : memref<30xf32>
        %157 = index.castu %c8 : index to i32
        %158 = vector.insert %c0_i32, %88 [0] : i32 into vector<13xi32>
        %159 = index.divs %c9, %c12
        %160 = memref.load %alloc_16[%c17] : memref<30xi64>
        %true_23 = index.bool.constant true
        %alloc_24 = memref.alloc() : memref<12xi32>
        affine.yield %alloc_24 : memref<12xi32>
      } else {
        %155 = index.maxu %c1, %c23
        %156 = index.xor %c20, %c12
        %157 = vector.load %alloc_20[%c11, %c2, %c11] : memref<13x22x12xi16>, vector<12xi16>
        %158 = vector.insert %99, %23 [1] : i32 into vector<2xi32>
        %159 = math.exp %34 : f16
        %cast = tensor.cast %7 : tensor<30xi32> to tensor<?xi32>
        %160 = affine.apply affine_map<(d0, d1, d2) -> ((-d2) mod 2)>(%107, %c10, %c11)
        %161 = math.expm1 %100 : tensor<30xf16>
        %alloc_22 = memref.alloc() : memref<12xi32>
        affine.yield %alloc_22 : memref<12xi32>
      }
      %153 = math.log %61 : f16
      %154 = tensor.empty(%c1, %c15) : tensor<?x?xi1>
      scf.yield %154 : tensor<?x?xi1>
    }
    case 3 {
      %141 = tensor.empty() : tensor<22x22xi16>
      %142 = linalg.matmul ins(%alloc_8, %141 : memref<13x22xi16>, tensor<22x22xi16>) outs(%81 : tensor<13x22xi16>) -> tensor<13x22xi16>
      %143 = vector.multi_reduction <minui>, %86, %c0_i32 [0] : vector<2xi32> to i32
      %144 = affine.if affine_set<(d0) : (-d0 == 0)>(%c23) -> memref<12xf16> {
        %162 = memref.load %alloc[%c0, %c1] : memref<?x22xf16>
        %163 = vector.load %alloc_10[%c21] : memref<30xf16>, vector<30xf16>
        %164 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<mul>} %88, %88, %99 : vector<13xi32>, vector<13xi32> into i32
        %165 = arith.remf %cst_0, %70 : f16
        %166 = bufferization.clone %alloc_20 : memref<13x22x12xi16> to memref<13x22x12xi16>
        %167 = index.divs %c13, %c17
        bufferization.dealloc_tensor %6 : tensor<?x?xi64>
        %168 = affine.apply affine_map<(d0, d1, d2) -> ((-d2) mod 2)>(%c20, %c15, %c13)
        affine.yield %alloc_7 : memref<12xf16>
      } else {
        %162 = vector.create_mask %c6, %c10 : vector<13x22xi1>
        %163 = index.maxs %c19, %c6
        %164 = affine.min affine_map<(d0) -> ((d0 ceildiv 4) ceildiv 32)>(%c29)
        %165 = index.add %c25, %c21
        %166 = index.divs %c11, %c7
        %167 = math.log1p %1 : tensor<30xf32>
        %168 = vector.extract %88[4] : i32 from vector<13xi32>
        %169 = math.tanh %from_elements : tensor<12xf16>
        affine.yield %alloc_7 : memref<12xf16>
      }
      %145 = scf.if %53 -> (memref<30xi1>) {
        %162 = math.ceil %87 : f16
        %163 = vector.splat %99 : vector<12x22xi32>
        %164 = arith.divui %91, %44 : i1
        %165 = arith.ori %true, %53 : i1
        affine.store %c19273_i16, %alloc_20[%c8, %c25, %c13] : memref<13x22x12xi16>
        %166 = affine.apply affine_map<(d0, d1)[s0] -> (d0)>(%c15, %c28)[%c1]
        %167 = index.castu %19 : index to i32
        %true_22 = index.bool.constant true
        %alloc_23 = memref.alloc() : memref<30xi1>
        scf.yield %alloc_23 : memref<30xi1>
      } else {
        %162 = math.round %1 : tensor<30xf32>
        %from_elements_22 = tensor.from_elements %c1830635293_i64, %c1541256711_i64, %c314936925_i64, %c1139289150_i64, %20, %c1830635293_i64, %c1830635293_i64, %c1139289150_i64, %20, %c1830635293_i64, %c314936925_i64, %c1830635293_i64, %c314936925_i64, %c1830635293_i64, %c1139289150_i64, %c1541256711_i64, %c1830635293_i64, %c1139289150_i64, %c314936925_i64, %c1541256711_i64, %c314936925_i64, %c314936925_i64, %c1830635293_i64, %c1139289150_i64, %c1830635293_i64, %c1541256711_i64, %c1830635293_i64, %c314936925_i64, %20, %c314936925_i64 : tensor<30xi64>
        %163 = index.floordivs %c31, %c16
        %164 = index.divu %c4, %c4
        %165 = index.and %163, %c19
        affine.store %50, %alloc_21[%c1, %c21, %c8] : memref<?x22x12xf16>
        %166 = arith.minui %103, %21 : i1
        %167 = math.ceil %41 : f32
        %alloc_23 = memref.alloc() : memref<30xi1>
        scf.yield %alloc_23 : memref<30xi1>
      }
      %146 = scf.execute_region -> tensor<12xf16> {
        %162 = vector.extract %92[0] : i32 from vector<2xi32>
        %163 = math.ctpop %9 : tensor<?xi1>
        %164 = math.tan %0 : tensor<12xf32>
        %expanded = tensor.expand_shape %12 [[0], [1, 2]] : tensor<12x22xi32> into tensor<12x22x1xi32>
        %165 = arith.cmpi ult, %c-20163_i16, %48 : i16
        %166 = index.divs %c29, %c20
        memref.assume_alignment %alloc_14, 1 : memref<?x?xi32>
        %167 = math.log %59 : f16
        %168 = math.ipowi %c314936925_i64, %c314936925_i64 : i64
        %169 = arith.cmpf ult, %75, %65 : f16
        %expanded_22 = tensor.expand_shape %1 [[0, 1]] : tensor<30xf32> into tensor<30x1xf32>
        %170 = math.rsqrt %from_elements : tensor<12xf16>
        %171 = arith.negf %61 : f16
        %alloc_23 = memref.alloc(%166, %90) : memref<?x?x13xf32>
        linalg.broadcast ins(%alloc_15 : memref<?x?xf32>) outs(%alloc_23 : memref<?x?x13xf32>) dimensions = [2] 
        %172 = vector.broadcast %48 : i16 to vector<22xi16>
        %173 = vector.broadcast %true : i1 to vector<22xi1>
        %174 = vector.maskedload %alloc_20[%c3, %c4, %c9], %173, %172 : memref<13x22x12xi16>, vector<22xi1>, vector<22xi16> into vector<22xi16>
        %175 = memref.realloc %alloc_7 : memref<12xf16> to memref<13xf16>
        scf.yield %from_elements : tensor<12xf16>
      }
      %147 = vector.broadcast %c26 : index to vector<13xindex>
      %148 = vector.broadcast %109 : i1 to vector<13xi1>
      %149 = vector.broadcast %38 : i16 to vector<13xi16>
      vector.scatter %alloc_11[%c3, %c6] [%147], %148, %149 : memref<12x22xi16>, vector<13xindex>, vector<13xi1>, vector<13xi16>
      %150 = math.expm1 %cst_0 : f16
      %151 = affine.apply affine_map<(d0, d1)[s0] -> (d1)>(%c5, %c21)[%c4]
      %152 = math.atan %50 : f16
      %153 = index.divu %151, %c12
      %154 = vector.broadcast %cst_2 : f32 to vector<12xf32>
      %155 = vector.broadcast %53 : i1 to vector<12xi1>
      %156 = vector.maskedload %alloc_15[%c0, %c0], %155, %154 : memref<?x?xf32>, vector<12xi1>, vector<12xf32> into vector<12xf32>
      %157 = bufferization.clone %145 : memref<30xi1> to memref<30xi1>
      %158 = vector.extract_strided_slice %23 {offsets = [0], sizes = [2], strides = [1]} : vector<2xi32> to vector<2xi32>
      %159 = math.tanh %50 : f16
      %160 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<or>} %23, %158, %99 : vector<2xi32>, vector<2xi32> into i32
      %cast = memref.cast %alloc_8 : memref<13x22xi16> to memref<13x22xi16>
      %161 = tensor.empty(%c1, %c25) : tensor<?x?xi1>
      scf.yield %161 : tensor<?x?xi1>
    }
    default {
      memref.assume_alignment %alloc_17, 2 : memref<30xf32>
      memref.copy %alloc_21, %alloc_21 : memref<?x22x12xf16> to memref<?x22x12xf16>
      %141 = arith.negf %70 : f16
      %142 = arith.divsi %99, %99 : i32
      %143 = arith.remf %84, %51 : f16
      %144 = tensor.empty(%c26) : tensor<?x12xi32>
      %145 = tensor.empty(%19) : tensor<?xi32>
      %alloc_22 = memref.alloc(%c2) : memref<?x12xi32>
      %146 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%144, %145, %alloc_22 : tensor<?x12xi32>, tensor<?xi32>, memref<?x12xi32>) outs(%144 : tensor<?x12xi32>) {
      ^bb0(%in: i32, %in_25: i32, %in_26: i32, %out: i32):
        %alloc_27 = memref.alloc() : memref<22x12xi32>
        %158 = tensor.empty() : tensor<12x12xi32>
        %159 = linalg.matmul ins(%12, %alloc_27 : tensor<12x22xi32>, memref<22x12xi32>) outs(%158 : tensor<12x12xi32>) -> tensor<12x12xi32>
        linalg.yield %in : i32
      } -> tensor<?x12xi32>
      %147 = arith.remsi %48, %48 : i16
      %148 = arith.divsi %c-10120_i16, %85 : i16
      affine.store %63, %alloc_13[%c27] : memref<30xf32>
