"builtin.module"() ({
  "func.func"() <{function_type = (memref<27xi16>, tensor<?x?xi16>) -> (), sym_name = "func1", sym_visibility = "private"}> ({
  ^bb0(%arg0: memref<27xi16>, %arg1: tensor<?x?xi16>):
    %0 = "arith.constant"() <{value = false}> : () -> i1
    %1 = "arith.constant"() <{value = 1.69219059E+9 : f32}> : () -> f32
    %2 = "arith.constant"() <{value = 1905812428 : i32}> : () -> i32
    %3 = "arith.constant"() <{value = 1.804800e+04 : f16}> : () -> f16
    %4 = "arith.constant"() <{value = 6.390400e+04 : f16}> : () -> f16
    %5 = "arith.constant"() <{value = 761049849 : i64}> : () -> i64
    %6 = "arith.constant"() <{value = 156620613 : i32}> : () -> i32
    %7 = "arith.constant"() <{value = 1442552898 : i64}> : () -> i64
    %8 = "arith.constant"() <{value = 1499810190 : i32}> : () -> i32
    %9 = "arith.constant"() <{value = 778845842 : i64}> : () -> i64
    %10 = "arith.constant"() <{value = 748778423 : i32}> : () -> i32
    %11 = "arith.constant"() <{value = false}> : () -> i1
    %12 = "arith.constant"() <{value = 570316698 : i32}> : () -> i32
    %13 = "arith.constant"() <{value = 1.00791827E+9 : f32}> : () -> f32
    %14 = "arith.constant"() <{value = 1.022400e+04 : f16}> : () -> f16
    %15 = "arith.constant"() <{value = 5.529600e+04 : f16}> : () -> f16
    %16 = "arith.constant"() <{value = 0 : index}> : () -> index
    %17 = "arith.constant"() <{value = 1 : index}> : () -> index
    %18 = "arith.constant"() <{value = 2 : index}> : () -> index
    %19 = "arith.constant"() <{value = 3 : index}> : () -> index
    %20 = "arith.constant"() <{value = 4 : index}> : () -> index
    %21 = "arith.constant"() <{value = 5 : index}> : () -> index
    %22 = "arith.constant"() <{value = 6 : index}> : () -> index
    %23 = "arith.constant"() <{value = 7 : index}> : () -> index
    %24 = "arith.constant"() <{value = 8 : index}> : () -> index
    %25 = "arith.constant"() <{value = 9 : index}> : () -> index
    %26 = "arith.constant"() <{value = 10 : index}> : () -> index
    %27 = "arith.constant"() <{value = 11 : index}> : () -> index
    %28 = "arith.constant"() <{value = 12 : index}> : () -> index
    %29 = "arith.constant"() <{value = 13 : index}> : () -> index
    %30 = "arith.constant"() <{value = 14 : index}> : () -> index
    %31 = "arith.constant"() <{value = 15 : index}> : () -> index
    %32 = "arith.constant"() <{value = 16 : index}> : () -> index
    %33 = "arith.constant"() <{value = 17 : index}> : () -> index
    %34 = "arith.constant"() <{value = 18 : index}> : () -> index
    %35 = "arith.constant"() <{value = 19 : index}> : () -> index
    %36 = "arith.constant"() <{value = 20 : index}> : () -> index
    %37 = "arith.constant"() <{value = 21 : index}> : () -> index
    %38 = "arith.constant"() <{value = 22 : index}> : () -> index
    %39 = "arith.constant"() <{value = 23 : index}> : () -> index
    %40 = "arith.constant"() <{value = 24 : index}> : () -> index
    %41 = "arith.constant"() <{value = 25 : index}> : () -> index
    %42 = "arith.constant"() <{value = 26 : index}> : () -> index
    %43 = "arith.constant"() <{value = 27 : index}> : () -> index
    %44 = "arith.constant"() <{value = 28 : index}> : () -> index
    %45 = "arith.constant"() <{value = 29 : index}> : () -> index
    %46 = "arith.constant"() <{value = 30 : index}> : () -> index
    %47 = "arith.constant"() <{value = 31 : index}> : () -> index
    %48 = "tensor.empty"(%39) : (index) -> tensor<?x9xi32>
    %49 = "tensor.empty"(%34) : (index) -> tensor<?x27xi1>
    %50 = "tensor.empty"(%23) : (index) -> tensor<?x27xi1>
    %51 = "tensor.empty"() : () -> tensor<27xf16>
    %52 = "tensor.empty"(%17) : (index) -> tensor<?x27xi1>
    %53 = "tensor.empty"(%30) : (index) -> tensor<?x27xf16>
    %54 = "tensor.empty"(%44, %23) : (index, index) -> tensor<?x?xi16>
    %55 = "tensor.empty"(%18, %24) : (index, index) -> tensor<?x?xi64>
    %56 = "tensor.empty"() : () -> tensor<3x27xi32>
    %57 = "tensor.empty"(%23) : (index) -> tensor<?x9xi16>
    %58 = "tensor.empty"() : () -> tensor<3x27xi1>
    %59 = "tensor.empty"() : () -> tensor<3x27xf16>
    %60 = "tensor.empty"() : () -> tensor<9x27xi32>
    %61 = "tensor.empty"() : () -> tensor<9x27xi64>
    %62 = "tensor.empty"() : () -> tensor<3x27xf32>
    %63 = "tensor.empty"(%29) : (index) -> tensor<?x27xf32>
    %64 = "memref.alloc"(%24) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
    %65 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<26x9xi32>
    %66 = "memref.alloc"(%23, %25) <{operandSegmentSizes = array<i32: 2, 0>}> : (index, index) -> memref<?x?xi16>
    %67 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<3x27xi32>
    %68 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<9x27xi32>
    %69 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<9x27xi1>
    %70 = "memref.alloc"(%27) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xf32>
    %71 = "memref.alloc"(%21) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x9xf16>
    %72 = "memref.alloc"(%30) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x27xi32>
    %73 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<26x9xf32>
    %74 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<9x27xf32>
    %75 = "memref.alloc"(%16) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x27xf16>
    %76 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<3x27xi32>
    %77 = "memref.alloc"(%24) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi32>
    %78 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<3x27xi64>
    %79 = "memref.alloc"(%40, %33) <{operandSegmentSizes = array<i32: 2, 0>}> : (index, index) -> memref<?x?xi64>
    %80 = "vector.broadcast"(%11) : (i1) -> vector<1xi1>
    %81 = "vector.mask"(%80) ({
      %221 = "vector.multi_reduction"(%80, %80) <{kind = #vector.kind<maxui>, reduction_dims = []}> : (vector<1xi1>, vector<1xi1>) -> vector<1xi1>
      "vector.yield"(%221) : (vector<1xi1>) -> ()
    }) : (vector<1xi1>) -> vector<1xi1>
    %82 = "arith.constant"() <{value = 0 : i16}> : () -> i16
    "affine.store"(%82, %arg0, %31) <{map = affine_map<(d0) -> (d0)>}> : (i16, memref<27xi16>, index) -> ()
    %83 = "arith.minui"(%2, %6) : (i32, i32) -> i32
    %84 = "arith.divui"(%5, %9) : (i64, i64) -> i64
    %85 = "arith.divsi"(%2, %10) : (i32, i32) -> i32
    %86 = "linalg.copy"(%60, %60) <{operandSegmentSizes = array<i32: 1, 1>}> ({
    ^bb0(%arg2: i32, %arg3: i32):
      "linalg.yield"(%arg2) : (i32) -> ()
    }) : (tensor<9x27xi32>, tensor<9x27xi32>) -> tensor<9x27xi32>
    %87 = "spirv.ULessThan"(%8, %8) : (i32, i32) -> i1
    %88 = "vector.broadcast"(%8) : (i32) -> vector<2xi32>
    %89 = "spirv.BitwiseOr"(%88, %88) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %90 = "tensor.empty"() : () -> tensor<27x27xf16>
    %91 = "linalg.matmul"(%59, %90, %59) <{operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg2: f16, %arg3: f16, %arg4: f16):
      %221 = "arith.mulf"(%arg2, %arg3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %222 = "arith.addf"(%arg4, %221) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      "linalg.yield"(%222) : (f16) -> ()
    }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<3x27xf16>, tensor<27x27xf16>, tensor<3x27xf16>) -> tensor<3x27xf16>
    %92 = "math.absi"(%48) : (tensor<?x9xi32>) -> tensor<?x9xi32>
    %93 = "spirv.CL.erf"(%13) : (f32) -> f32
    %94 = "spirv.GL.FMax"(%15, %14) : (f16, f16) -> f16
    %95 = "arith.cmpf"(%1, %13) <{predicate = 0 : i64}> : (f32, f32) -> i1
    %96 = "arith.constant"() <{value = -11852 : i16}> : () -> i16
    %97 = "scf.if"(%0) ({
      %221 = "index.casts"(%27) : (index) -> i32
      %222 = "arith.divf"(%3, %15) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %223 = "scf.index_switch"(%26) <{cases = array<i64: 1, 2, 3, 4>}> ({
        %229 = "tensor.empty"() : () -> tensor<9x3xf16>
        %230 = "tensor.empty"(%46) : (index) -> tensor<?x3xf16>
        %231 = "linalg.matmul"(%71, %229, %230) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg2: f16, %arg3: f16, %arg4: f16):
          %247 = "arith.mulf"(%arg2, %arg3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
          %248 = "arith.addf"(%arg4, %247) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
          "linalg.yield"(%248) : (f16) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (memref<?x9xf16>, tensor<9x3xf16>, tensor<?x3xf16>) -> tensor<?x3xf16>
        %232 = "vector.broadcast"(%94) : (f16) -> vector<27xf16>
        %233 = "math.round"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<?x27xf16>) -> tensor<?x27xf16>
        %234 = "arith.cmpi"(%87, %11) <{predicate = 0 : i64}> : (i1, i1) -> i1
        %235 = "tensor.expand_shape"(%49) <{reassociation = [[0], [1, 2]]}> : (tensor<?x27xi1>) -> tensor<?x27x1xi1>
        "memref.assume_alignment"(%77) <{alignment = 2 : i32}> : (memref<?xi32>) -> ()
        %236 = "tensor.expand_shape"(%50) <{reassociation = [[0], [1, 2]]}> : (tensor<?x27xi1>) -> tensor<?x27x1xi1>
        %237 = "vector.splat"(%34) : (index) -> vector<26x9xindex>
        %238 = "math.ipowi"(%82, %82) : (i16, i16) -> i16
        %239 = "math.fpowi"(%59, %56) <{fastmath = #arith.fastmath<none>}> : (tensor<3x27xf16>, tensor<3x27xi32>) -> tensor<3x27xf16>
        %240 = "tensor.collapse_shape"(%52) <{reassociation = [[0, 1]]}> : (tensor<?x27xi1>) -> tensor<?xi1>
        %241 = "tensor.empty"() : () -> tensor<81xf16>
        %242 = "tensor.unpack"(%59, %241, %43) <{inner_dims_pos = array<i64: 0>, outer_dims_perm = array<i64: 0>, static_inner_tiles = array<i64: -9223372036854775808>}> : (tensor<3x27xf16>, tensor<81xf16>, index) -> tensor<81xf16>
        %243 = "math.round"(%63) <{fastmath = #arith.fastmath<none>}> : (tensor<?x27xf32>) -> tensor<?x27xf32>
        %244 = "vector.matrix_multiply"(%232, %232) <{lhs_columns = 27 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<27xf16>, vector<27xf16>) -> vector<1xf16>
        %245 = "index.divu"(%16, %42) : (index, index) -> index
        "affine.store"(%2, %68, %36, %28) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (i32, memref<9x27xi32>, index, index) -> ()
        %246 = "tensor.empty"() : () -> tensor<26x9xi16>
        "scf.yield"(%246) : (tensor<26x9xi16>) -> ()
      }, {
        %229 = "math.powf"(%1, %1) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %230 = "arith.divf"(%3, %15) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %231 = "arith.negf"(%14) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %232 = "vector.multi_reduction"(%88, %88) <{kind = #vector.kind<xor>, reduction_dims = []}> : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
        %233 = "arith.divf"(%13, %93) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %234 = "index.castu"(%87) : (i1) -> index
        %235 = "math.log1p"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<?x27xf16>) -> tensor<?x27xf16>
        "memref.store"(%7, %78, %18, %25) <{nontemporal = false}> : (i64, memref<3x27xi64>, index, index) -> ()
        %236 = "arith.shli"(%12, %10) : (i32, i32) -> i32
        %237 = "math.roundeven"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<?x27xf16>) -> tensor<?x27xf16>
        %238 = "tensor.dim"(%59, %16) : (tensor<3x27xf16>, index) -> index
        %239 = "math.powf"(%59, %59) <{fastmath = #arith.fastmath<none>}> : (tensor<3x27xf16>, tensor<3x27xf16>) -> tensor<3x27xf16>
        %240 = "vector.contract"(%88, %88, %2) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<minui>}> : (vector<2xi32>, vector<2xi32>, i32) -> i32
        %241 = "tensor.empty"() : () -> tensor<f16>
        %242 = "linalg.dot"(%51, %51, %241) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg2: f16, %arg3: f16, %arg4: f16):
          %246 = "arith.mulf"(%arg2, %arg3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
          %247 = "arith.addf"(%arg4, %246) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
          "linalg.yield"(%247) : (f16) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>]} : (tensor<27xf16>, tensor<27xf16>, tensor<f16>) -> tensor<f16>
        %243 = "vector.contract"(%88, %88, %12) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<mul>}> : (vector<2xi32>, vector<2xi32>, i32) -> i32
        %244 = "arith.floordivsi"(%9, %5) : (i64, i64) -> i64
        %245 = "tensor.empty"() : () -> tensor<26x9xi16>
        "scf.yield"(%245) : (tensor<26x9xi16>) -> ()
      }, {
        %229 = "index.xor"(%23, %16) : (index, index) -> index
        %230 = "vector.create_mask"(%30) : (index) -> vector<27xi1>
        %231 = "tensor.dim"(%86, %17) : (tensor<9x27xi32>, index) -> index
        %232 = "math.round"(%51) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf16>) -> tensor<27xf16>
        %233 = "arith.ori"(%87, %0) : (i1, i1) -> i1
        "bufferization.dealloc_tensor"(%56) : (tensor<3x27xi32>) -> ()
        %234 = "tensor.cast"(%52) : (tensor<?x27xi1>) -> tensor<26x27xi1>
        %235 = "memref.load"(%75, %16, %34) <{nontemporal = false}> : (memref<?x27xf16>, index, index) -> f16
        %236 = "math.absf"(%63) <{fastmath = #arith.fastmath<none>}> : (tensor<?x27xf32>) -> tensor<?x27xf32>
        %237 = "linalg.copy"(%62, %62) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg2: f32, %arg3: f32):
          "linalg.yield"(%arg2) : (f32) -> ()
        }) : (tensor<3x27xf32>, tensor<3x27xf32>) -> tensor<3x27xf32>
        %238 = "vector.broadcast"(%17) : (index) -> vector<9xindex>
        %239 = "vector.broadcast"(%87) : (i1) -> vector<9xi1>
        %240 = "vector.broadcast"(%6) : (i32) -> vector<9xi32>
        "vector.scatter"(%65, %34, %18, %238, %239, %240) : (memref<26x9xi32>, index, index, vector<9xindex>, vector<9xi1>, vector<9xi32>) -> ()
        "memref.copy"(%73, %73) : (memref<26x9xf32>, memref<26x9xf32>) -> ()
        %241 = "math.round"(%1) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %242 = "index.xor"(%22, %20) : (index, index) -> index
        %243 = "math.cttz"(%7) : (i64) -> i64
        %244 = "vector.create_mask"(%38, %19) : (index, index) -> vector<26x9xi1>
        %245 = "tensor.empty"() : () -> tensor<26x9xi16>
        "scf.yield"(%245) : (tensor<26x9xi16>) -> ()
      }, {
        %229 = "arith.muli"(%82, %82) : (i16, i16) -> i16
        %230 = "memref.load"(%75, %16, %30) <{nontemporal = false}> : (memref<?x27xf16>, index, index) -> f16
        %231 = "vector.extract_strided_slice"(%88) <{offsets = [0], sizes = [1], strides = [1]}> : (vector<2xi32>) -> vector<1xi32>
        %232 = "arith.floordivsi"(%12, %8) : (i32, i32) -> i32
        %233 = "index.bool.constant"() <{value = false}> : () -> i1
        %234 = "tensor.splat"(%7) : (i64) -> tensor<3x27xi64>
        %235 = "math.copysign"(%51, %51) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf16>, tensor<27xf16>) -> tensor<27xf16>
        "affine.store"(%6, %76, %16, %43) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (i32, memref<3x27xi32>, index, index) -> ()
        %236 = "math.log"(%3) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %237 = "arith.muli"(%12, %12) : (i32, i32) -> i32
        %238 = "index.shrs"(%41, %17) : (index, index) -> index
        %239 = "index.divs"(%23, %42) : (index, index) -> index
        %240 = "arith.addf"(%94, %3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        "memref.copy"(%78, %78) : (memref<3x27xi64>, memref<3x27xi64>) -> ()
        %241 = "math.atan"(%4) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %242 = "index.shl"(%27, %41) : (index, index) -> index
        %243 = "tensor.empty"() : () -> tensor<26x9xi16>
        "scf.yield"(%243) : (tensor<26x9xi16>) -> ()
      }, {
        %229 = "linalg.copy"(%49, %49) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg2: i1, %arg3: i1):
          "linalg.yield"(%arg2) : (i1) -> ()
        }) : (tensor<?x27xi1>, tensor<?x27xi1>) -> tensor<?x27xi1>
        %230 = "vector.broadcast"(%87) : (i1) -> vector<1x1xi1>
        %231 = "vector.outerproduct"(%80, %80, %230) <{kind = #vector.kind<maxsi>}> : (vector<1xi1>, vector<1xi1>, vector<1x1xi1>) -> vector<1x1xi1>
        %232 = "math.absf"(%51) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf16>) -> tensor<27xf16>
        %233 = "index.bool.constant"() <{value = false}> : () -> i1
        %234 = "math.fpowi"(%59, %56) <{fastmath = #arith.fastmath<none>}> : (tensor<3x27xf16>, tensor<3x27xi32>) -> tensor<3x27xf16>
        %235 = "math.log1p"(%51) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf16>) -> tensor<27xf16>
        %236 = "math.roundeven"(%93) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %237 = "vector.create_mask"(%33, %18) : (index, index) -> vector<9x27xi1>
        "memref.store"(%9, %79, %16, %16) <{nontemporal = false}> : (i64, memref<?x?xi64>, index, index) -> ()
        %238 = "math.cttz"(%82) : (i16) -> i16
        "memref.tensor_store"(%arg1, %66) : (tensor<?x?xi16>, memref<?x?xi16>) -> ()
        %239 = "index.add"(%20, %39) : (index, index) -> index
        %240 = "arith.floordivsi"(%12, %10) : (i32, i32) -> i32
        %241 = "vector.splat"(%22) : (index) -> vector<26x9xindex>
        %242 = "arith.ori"(%0, %11) : (i1, i1) -> i1
        %243 = "index.shrs"(%39, %18) : (index, index) -> index
        %244 = "tensor.empty"() : () -> tensor<26x9xi16>
        "scf.yield"(%244) : (tensor<26x9xi16>) -> ()
      }) : (index) -> tensor<26x9xi16>
      %224 = "linalg.copy"(%57, %57) <{operandSegmentSizes = array<i32: 1, 1>}> ({
      ^bb0(%arg2: i16, %arg3: i16):
        "linalg.yield"(%arg2) : (i16) -> ()
      }) : (tensor<?x9xi16>, tensor<?x9xi16>) -> tensor<?x9xi16>
      %225 = "vector.transpose"(%80) <{transp = [0]}> : (vector<1xi1>) -> vector<1xi1>
      %226 = "index.add"(%25, %22) : (index, index) -> index
      %227 = "arith.muli"(%6, %10) : (i32, i32) -> i32
      %228 = "arith.addi"(%2, %2) : (i32, i32) -> i32
      "scf.yield"(%67) : (memref<3x27xi32>) -> ()
    }, {
      %221 = "math.round"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<?x27xf16>) -> tensor<?x27xf16>
      %222 = "vector.reduction"(%80) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<mul>}> : (vector<1xi1>) -> i1
      %223 = "tensor.empty"(%33) : (index) -> tensor<9x?xi16>
      %224 = "linalg.transpose"(%57, %223) <{permutation = array<i64: 1, 0>}> ({
      ^bb0(%arg2: i16, %arg3: i16):
        "linalg.yield"(%arg2) : (i16) -> ()
      }) : (tensor<?x9xi16>, tensor<9x?xi16>) -> tensor<9x?xi16>
      %225 = "index.ceildivs"(%41, %25) : (index, index) -> index
      %226 = "arith.addi"(%82, %82) : (i16, i16) -> i16
      %227 = "arith.divf"(%93, %93) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %228 = "arith.divui"(%0, %11) : (i1, i1) -> i1
      %229 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27xf16>
      "scf.yield"(%76) : (memref<3x27xi32>) -> ()
    }) : (i1) -> memref<3x27xi32>
    %98 = "spirv.CL.floor"(%93) : (f32) -> f32
    %99 = "spirv.CL.sin"(%3) : (f16) -> f16
    %100 = "arith.floordivsi"(%7, %7) : (i64, i64) -> i64
    %101 = "tensor.splat"(%98) : (f32) -> tensor<9x27xf32>
    %102 = "memref.realloc"(%64) : (memref<?xi16>) -> memref<3xi16>
    %103 = "tensor.empty"(%44) : (index) -> tensor<9x?xf32>
    %104 = "spirv.CL.tanh"(%98) : (f32) -> f32
    %105 = "affine.apply"(%37) <{map = affine_map<(d0) -> (-d0 + 12)>}> : (index) -> index
    %106 = "scf.while"(%99) ({
    ^bb0(%arg2: f16):
      %221 = "arith.shli"(%2, %8) : (i32, i32) -> i32
      %222 = "vector.contract"(%80, %80, %11) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<xor>}> : (vector<1xi1>, vector<1xi1>, i1) -> i1
      %223 = "arith.addf"(%94, %4) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      "bufferization.dealloc_tensor"(%55) : (tensor<?x?xi64>) -> ()
      %224 = "math.sqrt"(%13) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %225 = "math.ipowi"(%12, %8) : (i32, i32) -> i32
      %226 = "memref.load"(%68, %20, %31) <{nontemporal = false}> : (memref<9x27xi32>, index, index) -> i32
      %227 = "index.xor"(%20, %33) : (index, index) -> index
      "scf.condition"(%87, %4) : (i1, f16) -> ()
    }, {
    ^bb0(%arg2: f16):
      %221 = "memref.realloc"(%arg0) : (memref<27xi16>) -> memref<3xi16>
      %222 = "index.casts"(%17) : (index) -> i32
      %223 = "arith.xori"(%9, %7) : (i64, i64) -> i64
      %224 = "vector.matrix_multiply"(%88, %88) <{lhs_columns = 2 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<2xi32>, vector<2xi32>) -> vector<1xi32>
      %225 = "math.powf"(%99, %4) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %226 = "arith.divui"(%6, %6) : (i32, i32) -> i32
      %227 = "tensor.splat"(%12) : (i32) -> tensor<9x27xi32>
      %228 = "index.maxu"(%18, %32) : (index, index) -> index
      %229 = "affine.apply"(%24, %31) <{map = affine_map<(d0, d1) -> (d1 mod 64)>}> : (index, index) -> index
      %230 = "math.exp"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<3x27xf16>) -> tensor<3x27xf16>
      %231 = "index.shl"(%22, %31) : (index, index) -> index
      %232 = "arith.andi"(%11, %0) : (i1, i1) -> i1
      %233 = "memref.realloc"(%70) : (memref<?xf32>) -> memref<27xf32>
      %234 = "bufferization.clone"(%78) : (memref<3x27xi64>) -> memref<3x27xi64>
      %235 = "math.absi"(%87) : (i1) -> i1
      %236 = "index.or"(%39, %29) : (index, index) -> index
      "scf.yield"(%15) : (f16) -> ()
    }) : (f16) -> f16
    %107 = "math.log1p"(%51) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf16>) -> tensor<27xf16>
    %108 = "linalg.copy"(%48, %48) <{operandSegmentSizes = array<i32: 1, 1>}> ({
    ^bb0(%arg2: i32, %arg3: i32):
      "linalg.yield"(%arg2) : (i32) -> ()
    }) : (tensor<?x9xi32>, tensor<?x9xi32>) -> tensor<?x9xi32>
    %109 = "spirv.ULessThanEqual"(%88, %88) : (vector<2xi32>, vector<2xi32>) -> vector<2xi1>
    %110 = "tensor.expand_shape"(%53) <{reassociation = [[0], [1, 2]]}> : (tensor<?x27xf16>) -> tensor<?x27x1xf16>
    %111 = "vector.broadcast"(%1) : (f32) -> vector<f32>
    "vector.transfer_write"(%111, %74, %26, %31) <{operandSegmentSizes = array<i32: 1, 1, 2, 0>, permutation_map = affine_map<(d0, d1) -> ()>}> : (vector<f32>, memref<9x27xf32>, index, index) -> ()
    %112 = "tensor.empty"() : () -> tensor<81xf16>
    %113 = "tensor.unpack"(%59, %112, %43) <{inner_dims_pos = array<i64: 0>, outer_dims_perm = array<i64: 0>, static_inner_tiles = array<i64: -9223372036854775808>}> : (tensor<3x27xf16>, tensor<81xf16>, index) -> tensor<81xf16>
    %114 = "spirv.GL.UMax"(%8, %10) : (i32, i32) -> i32
    %115 = "vector.create_mask"(%29, %40) : (index, index) -> vector<26x9xi1>
    %116 = "spirv.IsNan"(%14) : (f16) -> i1
    %117 = "spirv.LogicalEqual"(%116, %116) : (i1, i1) -> i1
    %118 = "spirv.CL.fma"(%15, %4, %99) : (f16, f16, f16) -> f16
    %119 = "spirv.CL.tanh"(%104) : (f32) -> f32
    %120 = "math.cos"(%112) <{fastmath = #arith.fastmath<none>}> : (tensor<81xf16>) -> tensor<81xf16>
    %121 = "vector.reduction"(%88) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<or>}> : (vector<2xi32>) -> i32
    %122 = "spirv.CL.fabs"(%118) : (f16) -> f16
    %123 = "tensor.empty"() : () -> tensor<243xi64>
    %124 = "tensor.unpack"(%61, %123, %43) <{inner_dims_pos = array<i64: 0>, outer_dims_perm = array<i64: 0>, static_inner_tiles = array<i64: -9223372036854775808>}> : (tensor<9x27xi64>, tensor<243xi64>, index) -> tensor<243xi64>
    %125 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<9x27x26xi64>
    "linalg.broadcast"(%61, %125) <{dimensions = array<i64: 2>}> ({
    ^bb0(%arg2: i64, %arg3: i64):
      "linalg.yield"(%arg2) : (i64) -> ()
    }) : (tensor<9x27xi64>, memref<9x27x26xi64>) -> ()
    %126 = "arith.floordivsi"(%116, %117) : (i1, i1) -> i1
    %127 = "spirv.CL.fmax"(%98, %104) : (f32, f32) -> f32
    %128 = "spirv.BitFieldInsert"(%88, %88, %12, %9) : (vector<2xi32>, vector<2xi32>, i32, i64) -> vector<2xi32>
    %129 = "spirv.GL.FAbs"(%122) : (f16) -> f16
    %130 = "spirv.CL.sin"(%127) : (f32) -> f32
    "scf.if"(%116) ({
      %221 = "scf.while"(%56) ({
      ^bb0(%arg2: tensor<3x27xi32>):
        %228 = "arith.cmpi"(%82, %82) <{predicate = 4 : i64}> : (i16, i16) -> i1
        %229 = "bufferization.to_tensor"(%71) : (memref<?x9xf16>) -> tensor<?x9xf16>
        %230 = "math.absf"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<?x27xf16>) -> tensor<?x27xf16>
        %231 = "vector.contract"(%80, %80, %0) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<maxui>}> : (vector<1xi1>, vector<1xi1>, i1) -> i1
        %232 = "math.ipowi"(%12, %8) : (i32, i32) -> i32
        %233 = "math.ctlz"(%7) : (i64) -> i64
        %234 = "math.tanh"(%13) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %235 = "math.ceil"(%98) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        "scf.condition"(%116, %56) : (i1, tensor<3x27xi32>) -> ()
      }, {
      ^bb0(%arg2: tensor<3x27xi32>):
        %228 = "math.rsqrt"(%1) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %229 = "vector.create_mask"(%24, %24) : (index, index) -> vector<9x27xi1>
        %230 = "vector.broadcast"(%11) : (i1) -> vector<9xi1>
        %231:2 = "vector.scan"(%115, %230) <{inclusive = true, kind = #vector.kind<and>, reduction_dim = 0 : i64}> : (vector<26x9xi1>, vector<9xi1>) -> (vector<26x9xi1>, vector<9xi1>)
        %232 = "index.castu"(%0) : (i1) -> index
        %233 = "tensor.empty"() : () -> tensor<81xi32>
        %234 = "math.fpowi"(%112, %233) <{fastmath = #arith.fastmath<none>}> : (tensor<81xf16>, tensor<81xi32>) -> tensor<81xf16>
        %235 = "vector.broadcast"(%87) : (i1) -> vector<2xi1>
        "vector.compressstore"(%65, %36, %23, %235, %88) : (memref<26x9xi32>, index, index, vector<2xi1>, vector<2xi32>) -> ()
        %236 = "memref.realloc"(%77) : (memref<?xi32>) -> memref<9xi32>
        %237 = "vector.broadcast"(%117) : (i1) -> vector<26x27xi1>
        %238 = "vector.contract"(%115, %229, %237) <{indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = [#vector.iterator_type<parallel>, #vector.iterator_type<parallel>, #vector.iterator_type<reduction>], kind = #vector.kind<and>}> : (vector<26x9xi1>, vector<9x27xi1>, vector<26x27xi1>) -> vector<26x27xi1>
        %239 = "index.casts"(%39) : (index) -> i32
        %240 = "tensor.empty"() : () -> tensor<243xf32>
        %241 = "tensor.unpack"(%101, %240, %43) <{inner_dims_pos = array<i64: 0>, outer_dims_perm = array<i64: 0>, static_inner_tiles = array<i64: -9223372036854775808>}> : (tensor<9x27xf32>, tensor<243xf32>, index) -> tensor<243xf32>
        %242 = "vector.matrix_multiply"(%88, %88) <{lhs_columns = 2 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<2xi32>, vector<2xi32>) -> vector<1xi32>
        %243 = "vector.mask"(%80) ({
          %248 = "vector.multi_reduction"(%242, %242) <{kind = #vector.kind<maxsi>, reduction_dims = []}> : (vector<1xi32>, vector<1xi32>) -> vector<1xi32>
          "vector.yield"(%248) : (vector<1xi32>) -> ()
        }) : (vector<1xi1>) -> vector<1xi32>
        %244 = "index.divs"(%46, %33) : (index, index) -> index
        %245 = "index.maxu"(%36, %29) : (index, index) -> index
        %246 = "math.ctlz"(%108) : (tensor<?x9xi32>) -> tensor<?x9xi32>
        %247 = "bufferization.clone"(%68) : (memref<9x27xi32>) -> memref<9x27xi32>
        "scf.yield"(%56) : (tensor<3x27xi32>) -> ()
      }) : (tensor<3x27xi32>) -> tensor<3x27xi32>
      %222 = "tensor.expand_shape"(%58) <{reassociation = [[0], [1, 2]]}> : (tensor<3x27xi1>) -> tensor<3x27x1xi1>
      %223 = "memref.realloc"(%70) : (memref<?xf32>) -> memref<26xf32>
      "scf.if"(%11) ({
        %228 = "vector.create_mask"(%31, %31) : (index, index) -> vector<26x9xi1>
        %229 = "vector.transpose"(%80) <{transp = [0]}> : (vector<1xi1>) -> vector<1xi1>
        %230 = "index.sub"(%36, %22) : (index, index) -> index
        %231 = "index.ceildivu"(%19, %41) : (index, index) -> index
        %232 = "arith.floordivsi"(%11, %0) : (i1, i1) -> i1
        %233 = "arith.andi"(%5, %5) : (i64, i64) -> i64
        %234 = "math.tanh"(%130) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %235 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<3x27xi32>
        "scf.yield"() : () -> ()
      }, {
        %228 = "index.ceildivu"(%25, %38) : (index, index) -> index
        %229 = "math.cos"(%15) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %230 = "math.powf"(%4, %14) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %231 = "vector.extract"(%115) <{static_position = array<i64: 14>}> : (vector<26x9xi1>) -> vector<9xi1>
        %232 = "index.divs"(%46, %19) : (index, index) -> index
        %233 = "math.roundeven"(%3) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %234 = "arith.minui"(%0, %117) : (i1, i1) -> i1
        %235 = "arith.addi"(%2, %12) : (i32, i32) -> i32
        "scf.yield"() : () -> ()
      }) : (i1) -> ()
      %224 = "affine.if"(%29) ({
        %228 = "vector.broadcast"(%34) : (index) -> vector<27xindex>
        %229 = "vector.broadcast"(%11) : (i1) -> vector<27xi1>
        %230 = "vector.broadcast"(%82) : (i16) -> vector<27xi16>
        "vector.scatter"(%arg0, %28, %228, %229, %230) : (memref<27xi16>, index, vector<27xindex>, vector<27xi1>, vector<27xi16>) -> ()
        %231 = "vector.splat"(%9) : (i64) -> vector<3x27xi64>
        %232 = "arith.cmpi"(%5, %7) <{predicate = 2 : i64}> : (i64, i64) -> i1
        %233 = "linalg.copy"(%110, %110) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg2: f16, %arg3: f16):
          "linalg.yield"(%arg2) : (f16) -> ()
        }) : (tensor<?x27x1xf16>, tensor<?x27x1xf16>) -> tensor<?x27x1xf16>
        "affine.store"(%82, %66, %17, %30) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (i16, memref<?x?xi16>, index, index) -> ()
        %234 = "tensor.insert"(%13, %63, %16, %36) : (f32, tensor<?x27xf32>, index, index) -> tensor<?x27xf32>
        %235 = "math.ctlz"(%8) : (i32) -> i32
        %236 = "vector.splat"(%15) : (f16) -> vector<27xf16>
        "affine.yield"(%118) : (f16) -> ()
      }, {
        %228 = "linalg.copy"(%101, %101) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg2: f32, %arg3: f32):
          "linalg.yield"(%arg2) : (f32) -> ()
        }) : (tensor<9x27xf32>, tensor<9x27xf32>) -> tensor<9x27xf32>
        %229 = "index.shl"(%34, %38) : (index, index) -> index
        %230 = "vector.broadcast"(%229) : (index) -> vector<3xindex>
        %231 = "vector.broadcast"(%116) : (i1) -> vector<3xi1>
        %232 = "vector.broadcast"(%13) : (f32) -> vector<3xf32>
        "vector.scatter"(%74, %18, %24, %230, %231, %232) : (memref<9x27xf32>, index, index, vector<3xindex>, vector<3xi1>, vector<3xf32>) -> ()
        %233 = "arith.muli"(%5, %5) : (i64, i64) -> i64
        %234 = "linalg.copy"(%62, %62) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg2: f32, %arg3: f32):
          "linalg.yield"(%arg2) : (f32) -> ()
        }) : (tensor<3x27xf32>, tensor<3x27xf32>) -> tensor<3x27xf32>
        %235 = "math.round"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<3x27xf16>) -> tensor<3x27xf16>
        %236 = "math.ceil"(%129) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %237 = "index.sizeof"() : () -> index
        "affine.yield"(%14) : (f16) -> ()
      }) {condition = affine_set<(d0) : (-(d0 floordiv 64) + 1 >= 0)>} : (index) -> f16
      %225 = "tensor.generate"(%29, %26) ({
      ^bb0(%arg2: index, %arg3: index):
        %228 = "tensor.rank"(%54) : (tensor<?x?xi16>) -> index
        %229 = "vector.matrix_multiply"(%88, %88) <{lhs_columns = 2 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<2xi32>, vector<2xi32>) -> vector<1xi32>
        %230 = "tensor.empty"() : () -> tensor<27xi32>
        %231 = "math.fpowi"(%51, %230) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf16>, tensor<27xi32>) -> tensor<27xf16>
        %232 = "arith.remf"(%122, %99) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        "tensor.yield"(%82) : (i16) -> ()
      }) : (index, index) -> tensor<?x?xi16>
      %226 = "arith.divui"(%117, %116) : (i1, i1) -> i1
      %227 = "vector.insert"(%116, %80) <{static_position = array<i64: 0>}> : (i1, vector<1xi1>) -> vector<1xi1>
      "scf.yield"() : () -> ()
    }, {
    }) : (i1) -> ()
    %131 = "spirv.FUnordNotEqual"(%4, %99) : (f16, f16) -> i1
    %132 = "vector.broadcast"(%11) : (i1) -> vector<26xi1>
    %133 = "vector.mask"(%115) ({
      %221 = "vector.multi_reduction"(%115, %132) <{kind = #vector.kind<mul>, reduction_dims = [1]}> : (vector<26x9xi1>, vector<26xi1>) -> vector<26xi1>
      "vector.yield"(%221) : (vector<26xi1>) -> ()
    }) : (vector<26x9xi1>) -> vector<26xi1>
    %134 = "spirv.CL.round"(%122) : (f16) -> f16
    %135 = "spirv.GL.Cosh"(%94) : (f16) -> f16
    %136 = "tensor.empty"() : () -> tensor<9x27xi32>
    %137 = "linalg.map"(%86, %136) ({
    ^bb0(%arg2: i32):
      %221 = "math.cos"(%122) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %222 = "index.xor"(%27, %21) : (index, index) -> index
      %223 = "tensor.rank"(%51) : (tensor<27xf16>) -> index
      %224 = "math.atan2"(%118, %94) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %225 = "index.shl"(%18, %19) : (index, index) -> index
      %226 = "arith.floordivsi"(%11, %0) : (i1, i1) -> i1
      %227 = "vector.multi_reduction"(%80, %80) <{kind = #vector.kind<maxsi>, reduction_dims = []}> : (vector<1xi1>, vector<1xi1>) -> vector<1xi1>
      %228 = "vector.broadcast"(%116) : (i1) -> vector<27xi1>
      %229 = "vector.broadcast"(%arg2) : (i32) -> vector<27xi32>
      %230 = "vector.gather"(%58, %42, %27, %229, %228, %228) : (tensor<3x27xi1>, index, index, vector<27xi32>, vector<27xi1>, vector<27xi1>) -> vector<27xi1>
      %231 = "index.shl"(%29, %32) : (index, index) -> index
      %232 = "math.cttz"(%60) : (tensor<9x27xi32>) -> tensor<9x27xi32>
      %233 = "math.ipowi"(%117, %117) : (i1, i1) -> i1
      %234 = "index.maxs"(%26, %36) : (index, index) -> index
      %235 = "tensor.empty"() : () -> tensor<27x26xi32>
      %236 = "tensor.empty"() : () -> tensor<9x26xi32>
      %237 = "linalg.matmul"(%60, %235, %236) <{operandSegmentSizes = array<i32: 2, 1>}> ({
      ^bb0(%arg3: i32, %arg4: i32, %arg5: i32):
        %265 = "arith.muli"(%arg3, %arg4) : (i32, i32) -> i32
        %266 = "arith.addi"(%arg5, %265) : (i32, i32) -> i32
        "linalg.yield"(%266) : (i32) -> ()
      }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<9x27xi32>, tensor<27x26xi32>, tensor<9x26xi32>) -> tensor<9x26xi32>
      %238 = "vector.broadcast"(%18) : (index) -> vector<26xindex>
      %239 = "vector.broadcast"(%82) : (i16) -> vector<26xi16>
      "vector.scatter"(%64, %16, %238, %132, %239) : (memref<?xi16>, index, vector<26xindex>, vector<26xi1>, vector<26xi16>) -> ()
      %240 = "math.ipowi"(%60, %86) : (tensor<9x27xi32>, tensor<9x27xi32>) -> tensor<9x27xi32>
      %241 = "arith.cmpf"(%13, %13) <{predicate = 8 : i64}> : (f32, f32) -> i1
      %242 = "bufferization.to_tensor"(%72) : (memref<?x27xi32>) -> tensor<?x27xi32>
      %243 = "linalg.copy"(%63, %63) <{operandSegmentSizes = array<i32: 1, 1>}> ({
      ^bb0(%arg3: f32, %arg4: f32):
        "linalg.yield"(%arg3) : (f32) -> ()
      }) : (tensor<?x27xf32>, tensor<?x27xf32>) -> tensor<?x27xf32>
      %244 = "vector.broadcast"(%31) : (index) -> vector<27xindex>
      "vector.scatter"(%76, %17, %35, %244, %230, %229) : (memref<3x27xi32>, index, index, vector<27xindex>, vector<27xi1>, vector<27xi32>) -> ()
      %245 = "vector.broadcast"(%11) : (i1) -> vector<9xi1>
      %246 = "vector.contract"(%132, %115, %245) <{indexing_maps = [affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d1, d0)>, affine_map<(d0, d1) -> (d0)>], iterator_types = [#vector.iterator_type<parallel>, #vector.iterator_type<reduction>], kind = #vector.kind<and>}> : (vector<26xi1>, vector<26x9xi1>, vector<9xi1>) -> vector<9xi1>
      %247 = "index.maxs"(%29, %42) : (index, index) -> index
      %248 = "vector.broadcast"(%116) : (i1) -> vector<9xi1>
      %249 = "vector.contract"(%132, %115, %248) <{indexing_maps = [affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d1, d0)>, affine_map<(d0, d1) -> (d0)>], iterator_types = [#vector.iterator_type<parallel>, #vector.iterator_type<reduction>], kind = #vector.kind<minsi>}> : (vector<26xi1>, vector<26x9xi1>, vector<9xi1>) -> vector<9xi1>
      %250 = "tensor.empty"(%27, %16) : (index, index) -> tensor<?x?x3xi16>
      %251 = "linalg.broadcast"(%54, %250) <{dimensions = array<i64: 2>}> ({
      ^bb0(%arg3: i16, %arg4: i16):
        "linalg.yield"(%arg3) : (i16) -> ()
      }) : (tensor<?x?xi16>, tensor<?x?x3xi16>) -> tensor<?x?x3xi16>
      %252 = "index.or"(%41, %35) : (index, index) -> index
      %253 = "tensor.empty"(%31) : (index) -> tensor<?xf32>
      %254 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<f32>
      %255 = "linalg.generic"(%253, %253, %254, %253) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>, affine_map<(d0) -> (d0)>], iterator_types = [#linalg.iterator_type<parallel>], operandSegmentSizes = array<i32: 3, 1>}> ({
      ^bb0(%arg3: f32, %arg4: f32, %arg5: f32, %arg6: f32):
        %265 = "vector.matrix_multiply"(%229, %229) <{lhs_columns = 27 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<27xi32>, vector<27xi32>) -> vector<1xi32>
        "linalg.yield"(%arg3) : (f32) -> ()
      }) : (tensor<?xf32>, tensor<?xf32>, memref<f32>, tensor<?xf32>) -> tensor<?xf32>
      %256 = "tensor.empty"(%31) : (index) -> tensor<26x?xf32>
      %257 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27xf16>
      %258 = "tensor.empty"() : () -> tensor<f16>
      %259 = "linalg.dot"(%51, %257, %258) <{operandSegmentSizes = array<i32: 2, 1>}> ({
      ^bb0(%arg3: f16, %arg4: f16, %arg5: f16):
        %265 = "arith.mulf"(%arg3, %arg4) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %266 = "arith.addf"(%arg5, %265) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        "linalg.yield"(%266) : (f16) -> ()
      }) {linalg.memoized_indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>]} : (tensor<27xf16>, memref<27xf16>, tensor<f16>) -> tensor<f16>
      %260 = "arith.cmpf"(%13, %1) <{predicate = 7 : i64}> : (f32, f32) -> i1
      %261 = "index.ceildivs"(%30, %42) : (index, index) -> index
      %262 = "math.round"(%63) <{fastmath = #arith.fastmath<none>}> : (tensor<?x27xf32>) -> tensor<?x27xf32>
      %263 = "vector.broadcast"(%127) : (f32) -> vector<3x27xf32>
      %264 = "math.absi"(%56) : (tensor<3x27xi32>) -> tensor<3x27xi32>
      "linalg.yield"(%6) : (i32) -> ()
    }) : (tensor<9x27xi32>, tensor<9x27xi32>) -> tensor<9x27xi32>
    %138 = "bufferization.to_tensor"(%70) : (memref<?xf32>) -> tensor<?xf32>
    %139 = "arith.xori"(%6, %114) : (i32, i32) -> i32
    %140 = "spirv.CL.rsqrt"(%104) : (f32) -> f32
    %141 = "affine.vector_load"(%74, %39, %32) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (memref<9x27xf32>, index, index) -> vector<3xf32>
    %142 = "index.maxu"(%39, %29) : (index, index) -> index
    %143 = "index.xor"(%42, %28) : (index, index) -> index
    %144 = "math.sqrt"(%98) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %145 = "math.ceil"(%140) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %146 = "spirv.GL.RoundEven"(%93) : (f32) -> f32
    %147 = "spirv.CL.erf"(%130) : (f32) -> f32
    %148 = "spirv.CL.tanh"(%147) : (f32) -> f32
    %149 = "spirv.BitFieldUExtract"(%88, %12, %9) : (vector<2xi32>, i32, i64) -> vector<2xi32>
    %150 = "vector.broadcast"(%38) : (index) -> vector<27xindex>
    %151 = "vector.broadcast"(%0) : (i1) -> vector<27xi1>
    %152 = "vector.broadcast"(%8) : (i32) -> vector<27xi32>
    "vector.scatter"(%77, %16, %150, %151, %152) : (memref<?xi32>, index, vector<27xindex>, vector<27xi1>, vector<27xi32>) -> ()
    %153 = "spirv.GL.Exp"(%135) : (f16) -> f16
    %154 = "arith.remsi"(%87, %116) : (i1, i1) -> i1
    %155 = "vector.broadcast"(%9) : (i64) -> vector<27xi64>
    %156 = "vector.broadcast"(%11) : (i1) -> vector<27xi1>
    "vector.compressstore"(%125, %24, %39, %21, %156, %155) : (memref<9x27x26xi64>, index, index, index, vector<27xi1>, vector<27xi64>) -> ()
    %157 = "math.absf"(%63) <{fastmath = #arith.fastmath<none>}> : (tensor<?x27xf32>) -> tensor<?x27xf32>
    %158 = "tensor.empty"() : () -> tensor<243xi32>
    %159 = "tensor.unpack"(%136, %158, %43) <{inner_dims_pos = array<i64: 0>, outer_dims_perm = array<i64: 0>, static_inner_tiles = array<i64: -9223372036854775808>}> : (tensor<9x27xi32>, tensor<243xi32>, index) -> tensor<243xi32>
    %160 = "spirv.CL.exp"(%147) : (f32) -> f32
    %161 = "arith.negf"(%118) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
    %162 = "spirv.GL.Tan"(%140) : (f32) -> f32
    %163 = "spirv.GL.FAbs"(%127) : (f32) -> f32
    %164 = "linalg.copy"(%54, %arg1) <{operandSegmentSizes = array<i32: 1, 1>}> ({
    ^bb0(%arg2: i16, %arg3: i16):
      "linalg.yield"(%arg2) : (i16) -> ()
    }) : (tensor<?x?xi16>, tensor<?x?xi16>) -> tensor<?x?xi16>
    %165 = "arith.divf"(%160, %162) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
    %166 = "spirv.BitwiseAnd"(%88, %88) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %167 = "vector.broadcast"(%7) : (i64) -> vector<9xi64>
    %168 = "vector.broadcast"(%11) : (i1) -> vector<9xi1>
    "vector.compressstore"(%125, %18, %25, %30, %168, %167) : (memref<9x27x26xi64>, index, index, index, vector<9xi1>, vector<9xi64>) -> ()
    %169 = "spirv.CL.rsqrt"(%160) : (f32) -> f32
    %170 = "vector.extract_strided_slice"(%132) <{offsets = [18], sizes = [7], strides = [1]}> : (vector<26xi1>) -> vector<7xi1>
    %171 = "vector.insert"(%11, %80) <{static_position = array<i64: 0>}> : (i1, vector<1xi1>) -> vector<1xi1>
    %172 = "spirv.ULessThanEqual"(%12, %2) : (i32, i32) -> i1
    %173 = "arith.addi"(%87, %11) : (i1, i1) -> i1
    %174 = "scf.while"(%162) ({
    ^bb0(%arg2: f32):
      %221 = "memref.alloc"(%40) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<27x9x?xi64>
      %222 = "memref.alloc"(%21) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi64>
      %223 = "tensor.empty"(%32) : (index) -> tensor<?xi64>
      %224 = "linalg.generic"(%221, %222, %223) <{indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d1, d2)>, affine_map<(d0, d1, d2) -> (d2)>, affine_map<(d0, d1, d2) -> (d2)>], iterator_types = [#linalg.iterator_type<reduction>, #linalg.iterator_type<reduction>, #linalg.iterator_type<parallel>], operandSegmentSizes = array<i32: 2, 1>}> ({
      ^bb0(%arg3: i64, %arg4: i64, %arg5: i64):
        %236 = "vector.reduction"(%132) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<minui>}> : (vector<26xi1>) -> i1
        "linalg.yield"(%arg3) : (i64) -> ()
      }) : (memref<27x9x?xi64>, memref<?xi64>, tensor<?xi64>) -> tensor<?xi64>
      %225 = "math.powf"(%104, %104) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %226 = "vector.contract"(%170, %170, %0) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<minsi>}> : (vector<7xi1>, vector<7xi1>, i1) -> i1
      %227 = "math.log"(%1) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %228 = "vector.matrix_multiply"(%132, %132) <{lhs_columns = 26 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<26xi1>, vector<26xi1>) -> vector<1xi1>
      %229 = "vector.broadcast"(%140) : (f32) -> vector<26x9xf32>
      %230 = "tensor.empty"(%17, %22) : (index, index) -> tensor<?x?x3xi1>
      %231 = "tensor.empty"(%24) : (index) -> tensor<?x3xi1>
      %232 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<3xi1>
      %233 = "tensor.empty"(%27) : (index) -> tensor<?xi1>
      %234 = "linalg.generic"(%230, %231, %232, %233) <{indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d1, d2)>, affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2)>, affine_map<(d0, d1, d2) -> (d1)>], iterator_types = [#linalg.iterator_type<reduction>, #linalg.iterator_type<parallel>, #linalg.iterator_type<reduction>], operandSegmentSizes = array<i32: 3, 1>}> ({
      ^bb0(%arg3: i1, %arg4: i1, %arg5: i1, %arg6: i1):
        %236 = "arith.negf"(%153) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        "linalg.yield"(%arg4) : (i1) -> ()
      }) : (tensor<?x?x3xi1>, tensor<?x3xi1>, memref<3xi1>, tensor<?xi1>) -> tensor<?xi1>
      %235 = "math.fpowi"(%1, %10) <{fastmath = #arith.fastmath<none>}> : (f32, i32) -> f32
      "scf.condition"(%11, %130) : (i1, f32) -> ()
    }, {
    ^bb0(%arg2: f32):
      %221 = "bufferization.to_tensor"(%78) : (memref<3x27xi64>) -> tensor<3x27xi64>
      %222 = "vector.broadcast"(%131) : (i1) -> vector<1x1xi1>
      %223 = "vector.outerproduct"(%80, %80, %222) <{kind = #vector.kind<add>}> : (vector<1xi1>, vector<1xi1>, vector<1x1xi1>) -> vector<1x1xi1>
      %224 = "vector.broadcast"(%172) : (i1) -> vector<9xi1>
      %225 = "vector.contract"(%132, %115, %224) <{indexing_maps = [affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d1, d0)>, affine_map<(d0, d1) -> (d0)>], iterator_types = [#vector.iterator_type<parallel>, #vector.iterator_type<reduction>], kind = #vector.kind<xor>}> : (vector<26xi1>, vector<26x9xi1>, vector<9xi1>) -> vector<9xi1>
      %226 = "linalg.copy"(%101, %101) <{operandSegmentSizes = array<i32: 1, 1>}> ({
      ^bb0(%arg3: f32, %arg4: f32):
        "linalg.yield"(%arg3) : (f32) -> ()
      }) : (tensor<9x27xf32>, tensor<9x27xf32>) -> tensor<9x27xf32>
      %227 = "math.cos"(%160) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %228 = "math.ctlz"(%172) : (i1) -> i1
      %229 = "tensor.expand_shape"(%110) <{reassociation = [[0], [1], [2, 3]]}> : (tensor<?x27x1xf16>) -> tensor<?x27x1x1xf16>
      %230 = "vector.matrix_multiply"(%141, %141) <{lhs_columns = 3 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<3xf32>, vector<3xf32>) -> vector<1xf32>
      %231 = "linalg.copy"(%158, %158) <{operandSegmentSizes = array<i32: 1, 1>}> ({
      ^bb0(%arg3: i32, %arg4: i32):
        "linalg.yield"(%arg3) : (i32) -> ()
      }) : (tensor<243xi32>, tensor<243xi32>) -> tensor<243xi32>
      %232 = "memref.alloc"(%44, %19) <{operandSegmentSizes = array<i32: 2, 0>}> : (index, index) -> memref<?x26x?xi64>
      %233 = "tensor.empty"() : () -> tensor<i64>
      %234 = "tensor.empty"(%17) : (index) -> tensor<?xi64>
      %235 = "linalg.generic"(%232, %233, %55, %55, %234) <{indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d1, d2)>, affine_map<(d0, d1, d2) -> ()>, affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d0)>], iterator_types = [#linalg.iterator_type<parallel>, #linalg.iterator_type<reduction>, #linalg.iterator_type<reduction>], operandSegmentSizes = array<i32: 4, 1>}> ({
      ^bb0(%arg3: i64, %arg4: i64, %arg5: i64, %arg6: i64, %arg7: i64):
        %243 = "vector.broadcast"(%116) : (i1) -> vector<3xi1>
        %244 = "vector.mask"(%243) ({
          %245 = "vector.multi_reduction"(%141, %141) <{kind = #vector.kind<minf>, reduction_dims = []}> : (vector<3xf32>, vector<3xf32>) -> vector<3xf32>
          "vector.yield"(%245) : (vector<3xf32>) -> ()
        }) : (vector<3xi1>) -> vector<3xf32>
        "linalg.yield"(%arg6) : (i64) -> ()
      }) : (memref<?x26x?xi64>, tensor<i64>, tensor<?x?xi64>, tensor<?x?xi64>, tensor<?xi64>) -> tensor<?xi64>
      %236 = "tensor.empty"(%33) : (index) -> tensor<9x?xi64>
      %237 = "linalg.generic"(%236, %236) <{indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = [#linalg.iterator_type<parallel>, #linalg.iterator_type<parallel>], operandSegmentSizes = array<i32: 1, 1>}> ({
      ^bb0(%arg3: i64, %arg4: i64):
        %243 = "vector.shuffle"(%132, %80) <{mask = [0, 1, 2, 3, 5, 7, 10, 11, 20, 22, 24, 26]}> : (vector<26xi1>, vector<1xi1>) -> vector<12xi1>
        "linalg.yield"(%9) : (i64) -> ()
      }) : (tensor<9x?xi64>, tensor<9x?xi64>) -> tensor<9x?xi64>
      %238 = "index.divs"(%25, %26) : (index, index) -> index
      %239 = "math.absf"(%14) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %240 = "affine.parallel"() <{lowerBoundsGroups = dense<1> : tensor<1xi32>, lowerBoundsMap = affine_map<() -> (0)>, reductions = [12], steps = [1], upperBoundsGroups = dense<1> : tensor<1xi32>, upperBoundsMap = affine_map<() -> (27)>}> ({
      ^bb0(%arg3: index):
