module {
  func.func nested @func1(%arg0: index, %arg1: vector<18xi32>) {
    %c1765106691_i64 = arith.constant 1765106691 : i64
    %cst = arith.constant 5.430400e+04 : f16
    %c1483519822_i32 = arith.constant 1483519822 : i32
    %c8569_i16 = arith.constant 8569 : i16
    %c2074439772_i32 = arith.constant 2074439772 : i32
    %c1918110872_i32 = arith.constant 1918110872 : i32
    %cst_0 = arith.constant 6.195200e+04 : f16
    %cst_1 = arith.constant 1.634400e+04 : f16
    %cst_2 = arith.constant 2.931200e+04 : f16
    %cst_3 = arith.constant 0x4D0DF40A : f32
    %c-30880_i16 = arith.constant -30880 : i16
    %cst_4 = arith.constant 0x4E3756D7 : f32
    %c46838844_i32 = arith.constant 46838844 : i32
    %c-20288_i16 = arith.constant -20288 : i16
    %true = arith.constant true
    %cst_5 = arith.constant 0x4D011AAB : f32
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %c16 = arith.constant 16 : index
    %c17 = arith.constant 17 : index
    %c18 = arith.constant 18 : index
    %c19 = arith.constant 19 : index
    %c20 = arith.constant 20 : index
    %c21 = arith.constant 21 : index
    %c22 = arith.constant 22 : index
    %c23 = arith.constant 23 : index
    %c24 = arith.constant 24 : index
    %c25 = arith.constant 25 : index
    %c26 = arith.constant 26 : index
    %c27 = arith.constant 27 : index
    %c28 = arith.constant 28 : index
    %c29 = arith.constant 29 : index
    %c30 = arith.constant 30 : index
    %c31 = arith.constant 31 : index
    %0 = tensor.empty() : tensor<8xi1>
    %1 = tensor.empty(%c25, %c9, %c2) : tensor<?x?x?xf16>
    %2 = tensor.empty(%c0, %c11) : tensor<?x?x8xi32>
    %3 = tensor.empty() : tensor<8xi32>
    %4 = tensor.empty(%c27) : tensor<?x8x8xf16>
    %5 = tensor.empty(%c23) : tensor<?xi64>
    %6 = tensor.empty() : tensor<8x8xi1>
    %7 = tensor.empty(%c17, %c24) : tensor<?x?xi16>
    %8 = tensor.empty(%c25) : tensor<?xf16>
    %9 = tensor.empty(%c1) : tensor<?xi32>
    %10 = tensor.empty(%c23) : tensor<?xf16>
    %11 = tensor.empty(%c31) : tensor<?xi1>
    %12 = tensor.empty() : tensor<8x8xf16>
    %13 = tensor.empty() : tensor<18xi32>
    %14 = tensor.empty(%c22) : tensor<?x8xi64>
    %15 = tensor.empty() : tensor<18xf16>
    %alloc = memref.alloc(%c25) : memref<?xi16>
    %alloc_6 = memref.alloc() : memref<8xi16>
    %alloc_7 = memref.alloc() : memref<8x8xf32>
    %alloc_8 = memref.alloc(%c10) : memref<?xi16>
    %alloc_9 = memref.alloc() : memref<8x8xi32>
    %alloc_10 = memref.alloc() : memref<8xi1>
    %alloc_11 = memref.alloc() : memref<8x8xi32>
    %alloc_12 = memref.alloc(%c20, %c11) : memref<?x?xi32>
    %alloc_13 = memref.alloc() : memref<8x8xi64>
    %alloc_14 = memref.alloc() : memref<18x8x8xf16>
    %alloc_15 = memref.alloc(%c7) : memref<?xf32>
    %alloc_16 = memref.alloc(%c23) : memref<?xi1>
    %alloc_17 = memref.alloc(%c26) : memref<?xi64>
    %alloc_18 = memref.alloc(%c15) : memref<?x8x8xi1>
    %alloc_19 = memref.alloc() : memref<8x8xi64>
    %alloc_20 = memref.alloc() : memref<18x8x8xi16>
    %16 = affine.if affine_set<(d0, d1) : (8 == 0, 8 >= 0, d0 - d1 == 0, d0 - 32 >= 0)>(%c28, %c20) -> f16 {
      %129 = math.log2 %15 : tensor<18xf16>
      %130 = index.sizeof
      %131 = math.absf %4 : tensor<?x8x8xf16>
      %132 = index.mul %c21, %c10
      %133 = vector.load %alloc[%c0] : memref<?xi16>, vector<18x8x8xi16>
      %134 = vector.shuffle %133, %133 [0, 4, 5, 7, 8, 9, 10, 13, 14, 17, 18, 19, 20, 22, 23, 24, 28, 29, 32, 33, 34, 35] : vector<18x8x8xi16>, vector<18x8x8xi16>
      %135 = affine.if affine_set<(d0, d1) : (d0 >= 0)>(%c1, %c0) -> i16 {
        %137 = index.shru %c20, %c8
        %138 = math.atan2 %15, %15 : tensor<18xf16>
        %139 = math.log10 %cst_5 : f32
        %140 = arith.minsi %c46838844_i32, %c1918110872_i32 : i32
        %true_31 = index.bool.constant true
        %141 = vector.load %alloc_14[%c7, %c0, %c3] : memref<18x8x8xf16>, vector<18x8x8xf16>
        %142 = math.absf %cst_5 : f32
        %143 = index.sizeof
        affine.yield %c8569_i16 : i16
      } else {
        %137 = math.ctlz %6 : tensor<8x8xi1>
        %extracted_31 = tensor.extract %0[%c7] : tensor<8xi1>
        %138 = vector.create_mask %c3, %c2 : vector<8x8xi1>
        %139 = arith.minsi %c1765106691_i64, %c1765106691_i64 : i64
        %140 = index.castu %c9 : index to i32
        %141 = arith.shrsi %true, %true : i1
        %142 = index.or %c5, %c14
        %143 = math.ceil %4 : tensor<?x8x8xf16>
        affine.yield %c-20288_i16 : i16
      }
      %136 = arith.addi %c1918110872_i32, %c46838844_i32 : i32
      affine.yield %cst : f16
    } else {
      %generated = tensor.generate %c19 {
      ^bb0(%arg2: index):
        %134 = math.fma %cst_4, %cst_4, %cst_4 : f32
        %135 = index.shru %c6, %arg2
        %136 = vector.broadcast %cst_3 : f32 to vector<8xf32>
        %137 = vector.insertelement %cst_4, %136[%c26 : index] : vector<8xf32>
        %dim_32 = tensor.dim %8, %c0 : tensor<?xf16>
        tensor.yield %c8569_i16 : i16
      } : tensor<?xi16>
      %129 = vector.broadcast %cst_2 : f16 to vector<8xf16>
      vector.print %129 : vector<8xf16>
      memref.copy %alloc_13, %alloc_13 : memref<8x8xi64> to memref<8x8xi64>
      %130 = math.exp %10 : tensor<?xf16>
      %131 = memref.realloc %alloc_16 : memref<?xi1> to memref<8xi1>
      %132 = scf.index_switch %c19 -> vector<8x8xf32> 
      case 1 {
        %134 = index.xor %c23, %c6
        %135 = affine.min affine_map<(d0)[s0] -> (d0 - 131)>(%c14)[%c16]
        %alloc_32 = memref.alloc() : memref<18x8x8xi1>
        %136 = math.cttz %7 : tensor<?x?xi16>
        %137 = arith.addi %c46838844_i32, %c2074439772_i32 : i32
        %138 = tensor.empty() : tensor<i1>
        %139 = linalg.dot ins(%0, %0 : tensor<8xi1>, tensor<8xi1>) outs(%138 : tensor<i1>) -> tensor<i1>
        %140 = vector.load %alloc_19[%c2, %c6] : memref<8x8xi64>, vector<8x8xi64>
        %141 = math.absi %3 : tensor<8xi32>
        %142 = index.shru %c4, %c22
        %143 = index.and %c22, %c8
        %144 = math.log10 %12 : tensor<8x8xf16>
        %145 = math.ctlz %c1483519822_i32 : i32
        %146 = arith.divf %cst_5, %cst_3 : f32
        %147 = math.powf %cst_5, %cst_5 : f32
        %148 = affine.vector_load %alloc_17[%c19] : memref<?xi64>, vector<8xi64>
        %149 = vector.flat_transpose %148 {columns = 4 : i32, rows = 2 : i32} : vector<8xi64> -> vector<8xi64>
        %150 = vector.broadcast %cst_4 : f32 to vector<8x8xf32>
        scf.yield %150 : vector<8x8xf32>
      }
      case 2 {
        %134 = index.and %c6, %c14
        %135 = arith.shrsi %c8569_i16, %c-30880_i16 : i16
        %136 = vector.extract %129[5] : f16 from vector<8xf16>
        %137 = vector.insertelement %cst_1, %129[%c18 : index] : vector<8xf16>
        %138 = math.tanh %cst_0 : f16
        %139 = arith.divui %c2074439772_i32, %c2074439772_i32 : i32
        %140 = vector.insert %cst_0, %129 [2] : f16 into vector<8xf16>
        %141 = memref.realloc %alloc_17 : memref<?xi64> to memref<18xi64>
        %142 = math.exp %cst_2 : f16
        %cast_32 = tensor.cast %5 : tensor<?xi64> to tensor<8xi64>
        affine.store %true, %alloc_16[%c25] : memref<?xi1>
        %143 = arith.cmpf true, %cst_5, %cst_5 : f32
        %144 = index.ceildivu %c2, %c8
        %145 = arith.minsi %c2074439772_i32, %c2074439772_i32 : i32
        %146 = math.ceil %10 : tensor<?xf16>
        %147 = vector.broadcast %cst_3 : f32 to vector<8x20xf32>
        %148 = vector.broadcast %cst_3 : f32 to vector<20xf32>
        %dest, %accumulated_value = vector.scan <add>, %147, %148 {inclusive = false, reduction_dim = 0 : i64} : vector<8x20xf32>, vector<20xf32>
        %149 = vector.broadcast %cst_5 : f32 to vector<8x8xf32>
        scf.yield %149 : vector<8x8xf32>
      }
      default {
        %134 = arith.minsi %c46838844_i32, %c1918110872_i32 : i32
        %135 = math.rsqrt %10 : tensor<?xf16>
        %136 = math.tanh %cst : f16
        %137 = index.or %c13, %c12
        %alloc_32 = memref.alloc(%c17) : memref<?xi64>
        %138 = arith.remf %cst_0, %cst_0 : f16
        %139 = memref.atomic_rmw ori %c1765106691_i64, %alloc_19[%c3, %c7] : (i64, memref<8x8xi64>) -> i64
        %rank = tensor.rank %4 : tensor<?x8x8xf16>
        %140 = index.castu %true : i1 to index
        %141 = arith.ori %c1765106691_i64, %c1765106691_i64 : i64
        %142 = vector.insertelement %cst_2, %129[%c20 : index] : vector<8xf16>
        %143 = vector.extract_strided_slice %129 {offsets = [3], sizes = [1], strides = [1]} : vector<8xf16> to vector<1xf16>
        %144 = math.ctlz %7 : tensor<?x?xi16>
        %145 = math.powf %12, %12 : tensor<8x8xf16>
        %146 = vector.reduction <mul>, %143 : vector<1xf16> into f16
        %147 = index.castu %true : i1 to index
        %148 = vector.broadcast %cst_3 : f32 to vector<8x8xf32>
        scf.yield %148 : vector<8x8xf32>
      }
      %133 = memref.atomic_rmw mulf %cst_3, %alloc_7[%c5, %c7] : (f32, memref<8x8xf32>) -> f32
      %dim_31 = tensor.dim %3, %c0 : tensor<8xi32>
      affine.yield %cst_1 : f16
    }
    %17 = scf.index_switch %c7 -> index 
    case 1 {
      %129 = math.log10 %4 : tensor<?x8x8xf16>
      %130 = arith.ori %c-30880_i16, %c8569_i16 : i16
      affine.store %c-20288_i16, %alloc_8[%c10] : memref<?xi16>
      %131 = tensor.empty() : tensor<20x8xi16>
      %alloc_31 = memref.alloc() : memref<i16>
      %alloc_32 = memref.alloc() : memref<20xi16>
      %132 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> ()>, affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%131, %alloc_31, %alloc_32, %alloc_32 : tensor<20x8xi16>, memref<i16>, memref<20xi16>, memref<20xi16>) outs(%131 : tensor<20x8xi16>) {
      ^bb0(%in: i16, %in_33: i16, %in_34: i16, %in_35: i16, %out: i16):
        %142 = math.cttz %in_34 : i16
        linalg.yield %out : i16
      } -> tensor<20x8xi16>
      %133 = math.round %8 : tensor<?xf16>
      affine.store %c-30880_i16, %alloc_6[%c19] : memref<8xi16>
      %134 = arith.remsi %c1918110872_i32, %c1483519822_i32 : i32
      memref.copy %alloc_32, %alloc_32 : memref<20xi16> to memref<20xi16>
      %135 = index.mul %c4, %c20
      affine.store %true, %alloc_10[%c9] : memref<8xi1>
      %136 = vector.splat %c1 : vector<8xindex>
      %137 = scf.while (%arg2 = %9) : (tensor<?xi32>) -> tensor<?xi32> {
        %142 = vector.broadcast %c-30880_i16 : i16 to vector<1xi16>
        %143 = vector.broadcast %c-20288_i16 : i16 to vector<1xi16>
        %144 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<or>} %142, %143, %c8569_i16 : vector<1xi16>, vector<1xi16> into i16
        %145 = arith.remsi %c1765106691_i64, %c1765106691_i64 : i64
        %146 = memref.atomic_rmw assign %c1918110872_i32, %alloc_12[%c0, %c0] : (i32, memref<?x?xi32>) -> i32
        %147 = index.ceildivu %c11, %c18
        %148 = math.log10 %15 : tensor<18xf16>
        %149 = math.ceil %cst_3 : f32
        %150 = math.atan2 %cst, %cst_2 : f16
        %151 = index.xor %c20, %c2
        %152 = tensor.empty(%c5) : tensor<?xi32>
        scf.condition(%true) %152 : tensor<?xi32>
      } do {
      ^bb0(%arg2: tensor<?xi32>):
        %142 = vector.broadcast %cst_0 : f16 to vector<18x8x8xf16>
        %143 = vector.shuffle %142, %142 [2, 3, 6, 8, 10, 13, 14, 15, 16, 23, 26, 27, 28, 30, 33, 35] : vector<18x8x8xf16>, vector<18x8x8xf16>
        %144 = math.rsqrt %15 : tensor<18xf16>
        %145 = arith.shrsi %true, %true : i1
        %146 = vector.broadcast %c2074439772_i32 : i32 to vector<8x8xi32>
        %147 = vector.broadcast %cst_4 : f32 to vector<8x8xf32>
        %148 = vector.fma %147, %147, %147 : vector<8x8xf32>
        %149 = arith.addi %c-20288_i16, %c-20288_i16 : i16
        %150 = vector.broadcast %c1483519822_i32 : i32 to vector<18xi32>
        %151 = vector.broadcast %true : i1 to vector<18xi1>
        %152 = vector.maskedload %alloc_11[%c2, %c4], %151, %150 : memref<8x8xi32>, vector<18xi1>, vector<18xi32> into vector<18xi32>
        %153 = vector.broadcast %c2074439772_i32 : i32 to vector<8xi32>
        %154 = vector.multi_reduction <or>, %146, %153 [1] : vector<8x8xi32> to vector<8xi32>
        %155 = memref.atomic_rmw muli %c1765106691_i64, %alloc_19[%c1, %c4] : (i64, memref<8x8xi64>) -> i64
        %156 = math.round %4 : tensor<?x8x8xf16>
        %157 = vector.mask %151 { vector.multi_reduction <minsi>, %151, %151 [] : vector<18xi1> to vector<18xi1> } : vector<18xi1> -> vector<18xi1>
        %158 = index.casts %c1483519822_i32 : i32 to index
        %159 = math.log2 %15 : tensor<18xf16>
        %160 = math.log %15 : tensor<18xf16>
        %161 = arith.shrui %c2074439772_i32, %c1483519822_i32 : i32
        %162 = arith.remf %cst_2, %cst : f16
        %163 = math.expm1 %12 : tensor<8x8xf16>
        %164 = tensor.empty(%c29) : tensor<?xi32>
        scf.yield %164 : tensor<?xi32>
      }
      %138 = index.casts %c1765106691_i64 : i64 to index
      %139 = index.and %c18, %c16
      %140 = affine.if affine_set<(d0, d1, d2, d3) : (-d2 >= 0, -d2 >= 0, d3 floordiv 2 >= 0, -d2 + d3 + 8 == 0)>(%c26, %c22, %c25, %c11) -> memref<8x8xf32> {
        memref.assume_alignment %alloc_31, 2 : memref<i16>
        %142 = index.or %c8, %c19
        %143 = math.absi %3 : tensor<8xi32>
        %144 = arith.remf %cst, %cst_2 : f16
        %145 = arith.ceildivsi %c8569_i16, %c-20288_i16 : i16
        %146 = math.rsqrt %12 : tensor<8x8xf16>
        %147 = index.mul %c2, %c13
        %148 = vector.broadcast %c1765106691_i64 : i64 to vector<1xi64>
        %149 = vector.broadcast %c1765106691_i64 : i64 to vector<1xi64>
        %150 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxui>} %148, %149, %c1765106691_i64 : vector<1xi64>, vector<1xi64> into i64
        affine.yield %alloc_7 : memref<8x8xf32>
      } else {
        %extracted_33 = tensor.extract %8[%c0] : tensor<?xf16>
        %142 = arith.divui %c1483519822_i32, %c46838844_i32 : i32
        %143 = arith.addi %c8569_i16, %c8569_i16 : i16
        memref.store %c8569_i16, %alloc_6[%c0] : memref<8xi16>
        %144 = arith.andi %c8569_i16, %c-20288_i16 : i16
        %145 = math.ceil %1 : tensor<?x?x?xf16>
        %146 = arith.remf %cst, %cst : f16
        %147 = tensor.empty() : tensor<18xf32>
        affine.yield %alloc_7 : memref<8x8xf32>
      }
      %141 = scf.if %true -> (i1) {
        %142 = index.shrs %c15, %c29
        %143 = index.or %c20, %c23
        %144 = index.shl %arg0, %c9
        %rank = tensor.rank %8 : tensor<?xf16>
        %145 = math.ceil %12 : tensor<8x8xf16>
        %146 = vector.broadcast %c-30880_i16 : i16 to vector<18xi16>
        %147 = vector.broadcast %true : i1 to vector<18xi1>
        vector.compressstore %alloc_31[], %147, %146 : memref<i16>, vector<18xi1>, vector<18xi16>
        %148 = affine.max affine_map<(d0) -> (0)>(%c7)
        %149 = index.shru %c10, %135
        scf.yield %true : i1
      } else {
        %142 = vector.broadcast %c1765106691_i64 : i64 to vector<1xi64>
        %143 = vector.extract %142[0] : i64 from vector<1xi64>
        %144 = math.ceil %15 : tensor<18xf16>
        %extracted_33 = tensor.extract %14[%c0, %c4] : tensor<?x8xi64>
        %145 = arith.cmpi uge, %c1765106691_i64, %extracted_33 : i64
        %146 = arith.muli %c1918110872_i32, %c46838844_i32 : i32
        %147 = arith.remui %c-20288_i16, %c-30880_i16 : i16
        %148 = index.mul %c11, %c25
        %149 = vector.flat_transpose %142 {columns = 1 : i32, rows = 1 : i32} : vector<1xi64> -> vector<1xi64>
        scf.yield %true : i1
      }
      scf.yield %c21 : index
    }
    case 2 {
      %129 = vector.broadcast %cst_2 : f16 to vector<f16>
      %130 = vector.transfer_write %129, %15[%c22] : vector<f16>, tensor<18xf16>
      %131 = vector.load %alloc_17[%c0] : memref<?xi64>, vector<18xi64>
      %132 = math.ipowi %c8569_i16, %c-30880_i16 : i16
      %133 = math.log2 %4 : tensor<?x8x8xf16>
      %134 = arith.mulf %cst_3, %cst_3 : f32
      scf.index_switch %c11 
      case 1 {
        %149 = index.maxs %c0, %arg0
        %150 = vector.transpose %129, [] : vector<f16> to vector<f16>
        %151 = index.ceildivu %c11, %c19
        %152 = vector.broadcast %c29 : index to vector<18xindex>
        %153 = vector.broadcast %true : i1 to vector<18xi1>
        %154 = vector.broadcast %c-20288_i16 : i16 to vector<18xi16>
        vector.scatter %alloc_8[%c0] [%152], %153, %154 : memref<?xi16>, vector<18xindex>, vector<18xi1>, vector<18xi16>
        %155 = index.shl %c18, %c24
        %156 = math.cos %cst_4 : f32
        %157 = affine.vector_load %alloc_18[%c27, %arg0, %c30] : memref<?x8x8xi1>, vector<18xi1>
        %158 = index.and %c13, %c7
        %159 = math.ceil %cst_1 : f16
        %160 = arith.divui %c2074439772_i32, %c2074439772_i32 : i32
        %161 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minsi>} %157, %157, %true : vector<18xi1>, vector<18xi1> into i1
        %162 = arith.remsi %true, %true : i1
        affine.store %cst_5, %alloc_15[%c4] : memref<?xf32>
        %163 = math.rsqrt %10 : tensor<?xf16>
        %164 = bufferization.clone %alloc_20 : memref<18x8x8xi16> to memref<18x8x8xi16>
        %165 = vector.load %alloc_11[%c6, %c6] : memref<8x8xi32>, vector<8x8xi32>
        scf.yield
      }
      default {
        %149 = math.fpowi %15, %13 : tensor<18xf16>, tensor<18xi32>
        %150 = arith.muli %c1918110872_i32, %c1918110872_i32 : i32
        %151 = math.log1p %cst_1 : f16
        %152 = vector.broadcast %cst_4 : f32 to vector<8x8xf32>
        %153 = vector.fma %152, %152, %152 : vector<8x8xf32>
        %154 = arith.muli %true, %true : i1
        %rank = tensor.rank %12 : tensor<8x8xf16>
        %155 = math.ceil %cst_5 : f32
        %156 = vector.splat %c46838844_i32 : vector<8x8xi32>
        %157 = math.tanh %15 : tensor<18xf16>
        %158 = index.or %arg0, %c26
        %159 = math.round %15 : tensor<18xf16>
        %160 = index.and %c4, %c7
        %161 = bufferization.to_tensor %alloc_19 : memref<8x8xi64>
        %162 = vector.multi_reduction <mul>, %153, %cst_5 [0, 1] : vector<8x8xf32> to f32
        %163 = math.roundeven %12 : tensor<8x8xf16>
        %164 = index.floordivs %c12, %c29
      }
      %135 = arith.remui %c46838844_i32, %c46838844_i32 : i32
      %alloc_31 = memref.alloc() : memref<18xi32>
      %136 = vector.broadcast %c2074439772_i32 : i32 to vector<8xi32>
      %137 = vector.broadcast %true : i1 to vector<8xi1>
      %138 = vector.gather %alloc_31[%arg0] [%136], %137, %136 : memref<18xi32>, vector<8xi32>, vector<8xi1>, vector<8xi32> into vector<8xi32>
      %139 = math.log1p %cst_0 : f16
      %140 = math.expm1 %4 : tensor<?x8x8xf16>
      %141 = index.ceildivu %c1, %c24
      %142 = math.absf %1 : tensor<?x?x?xf16>
      %143 = affine.apply affine_map<(d0, d1) -> (d0 * -31 - 2)>(%c16, %c0)
      %144 = vector.broadcast %cst_3 : f32 to vector<8xf32>
      %145 = vector.fma %144, %144, %144 : vector<8xf32>
      %146 = vector.broadcast %c8569_i16 : i16 to vector<8xi16>
      %147 = vector.maskedload %alloc_6[%c2], %137, %146 : memref<8xi16>, vector<8xi1>, vector<8xi16> into vector<8xi16>
      %148 = vector.splat %c1765106691_i64 : vector<18x8x8xi64>
      scf.yield %c19 : index
    }
    case 3 {
      %129 = vector.broadcast %c1765106691_i64 : i64 to vector<1xi64>
      %130 = vector.extract %129[0] : i64 from vector<1xi64>
      %131 = memref.atomic_rmw addf %cst_5, %alloc_15[%c0] : (f32, memref<?xf32>) -> f32
      %132 = math.ctlz %c1765106691_i64 : i64
      %133 = arith.remf %cst_4, %cst_4 : f32
      %134 = math.absi %14 : tensor<?x8xi64>
      %135 = arith.xori %c8569_i16, %c8569_i16 : i16
      %136 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxsi>} %129, %129, %c1765106691_i64 : vector<1xi64>, vector<1xi64> into i64
      %137 = vector.transfer_read %1[%c15, %c20, %c28], %cst_2 : tensor<?x?x?xf16>, vector<8x20xf16>
      %138 = memref.load %alloc_7[%c3, %c0] : memref<8x8xf32>
      %139 = index.divs %c31, %c5
      %140 = vector.transfer_read %3[%c7], %c2074439772_i32 : tensor<8xi32>, vector<i32>
      %141 = index.or %c22, %c13
      %142 = math.ctlz %7 : tensor<?x?xi16>
      %143 = arith.divui %c46838844_i32, %c2074439772_i32 : i32
      %generated = tensor.generate %c2 {
      ^bb0(%arg2: index):
        %145 = vector.transpose %129, [0] : vector<1xi64> to vector<1xi64>
        %146 = tensor.empty() : tensor<64xi1>
        %unpack = tensor.unpack %6 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [%c8] into %146 : tensor<8x8xi1> -> tensor<64xi1>
        %147 = arith.shrsi %true, %true : i1
        %148 = math.ceil %cst_5 : f32
        tensor.yield %cst_1 : f16
      } : tensor<?xf16>
      %144 = math.atan %generated : tensor<?xf16>
      scf.yield %c23 : index
    }
    default {
      %129 = arith.remui %true, %true : i1
      %130 = arith.andi %true, %true : i1
      %131 = math.log1p %cst_5 : f32
      %132 = math.copysign %15, %15 : tensor<18xf16>
      %rank = tensor.rank %4 : tensor<?x8x8xf16>
      %133 = vector.broadcast %c1765106691_i64 : i64 to vector<8xi64>
      %134 = vector.transpose %133, [0] : vector<8xi64> to vector<8xi64>
      %135 = math.log10 %cst_3 : f32
      %136 = index.and %c27, %c8
      %137 = vector.multi_reduction <minui>, %133, %c1765106691_i64 [0] : vector<8xi64> to i64
      %138 = math.absi %0 : tensor<8xi1>
      %expanded = tensor.expand_shape %3 [[0, 1]] : tensor<8xi32> into tensor<8x1xi32>
      affine.store %c-20288_i16, %alloc_20[%c4, %c4, %c6] : memref<18x8x8xi16>
      scf.execute_region {
        %141 = math.floor %cst_2 : f16
        %142 = math.cttz %14 : tensor<?x8xi64>
        %alloc_31 = memref.alloc(%arg0) : memref<?x8xi64>
        memref.tensor_store %14, %alloc_31 : memref<?x8xi64>
        %143 = math.atan %1 : tensor<?x?x?xf16>
        %144 = index.and %c11, %c13
        %alloc_32 = memref.alloc() : memref<18xi1>
        %145 = vector.broadcast %true : i1 to vector<18x8x8xi1>
        %146 = vector.broadcast %c1483519822_i32 : i32 to vector<18x8x8xi32>
        %147 = vector.gather %alloc_32[%c25] [%146], %145, %145 : memref<18xi1>, vector<18x8x8xi32>, vector<18x8x8xi1>, vector<18x8x8xi1> into vector<18x8x8xi1>
        %148 = math.sqrt %4 : tensor<?x8x8xf16>
        %149 = index.shl %c7, %c10
        %extracted_33 = tensor.extract %0[%c2] : tensor<8xi1>
        %150 = vector.broadcast %true : i1 to vector<8x8xi1>
        %dest, %accumulated_value = vector.scan <minui>, %145, %150 {inclusive = true, reduction_dim = 0 : i64} : vector<18x8x8xi1>, vector<8x8xi1>
        %151 = tensor.empty() : tensor<8x8xi16>
        %152 = vector.broadcast %c-30880_i16 : i16 to vector<8x8xi16>
        %153 = vector.broadcast %extracted_33 : i1 to vector<8x8xi1>
        %154 = vector.broadcast %c1483519822_i32 : i32 to vector<8x8xi32>
        %155 = vector.gather %151[%c1, %c0] [%154], %153, %152 : tensor<8x8xi16>, vector<8x8xi32>, vector<8x8xi1>, vector<8x8xi16> into vector<8x8xi16>
        %c0_i64 = arith.constant 0 : i64
        %156 = vector.transfer_read %alloc_19[%144, %c11], %c0_i64 : memref<8x8xi64>, vector<i64>
        %dim_34 = tensor.dim %3, %c0 : tensor<8xi32>
        %157 = arith.shrui %c1765106691_i64, %c1765106691_i64 : i64
        memref.copy %alloc_17, %alloc_17 : memref<?xi64> to memref<?xi64>
        %158 = arith.remsi %c1765106691_i64, %c1765106691_i64 : i64
        scf.yield
      }
      %139 = math.log10 %15 : tensor<18xf16>
      %140 = math.rsqrt %cst_0 : f16
      scf.execute_region {
        %141 = vector.broadcast %c1483519822_i32 : i32 to vector<18xi32>
        %142 = vector.broadcast %true : i1 to vector<18xi1>
        %143 = vector.maskedload %alloc_12[%c0, %c0], %142, %141 : memref<?x?xi32>, vector<18xi1>, vector<18xi32> into vector<18xi32>
        %144 = arith.minsi %true, %true : i1
        %145 = vector.extract %142[4] : i1 from vector<18xi1>
        %146 = arith.shrsi %c1483519822_i32, %c1918110872_i32 : i32
        %147 = tensor.empty() : tensor<i32>
        %148 = linalg.dot ins(%13, %13 : tensor<18xi32>, tensor<18xi32>) outs(%147 : tensor<i32>) -> tensor<i32>
        %149 = index.and %c28, %c26
        %150 = math.ctlz %c-20288_i16 : i16
        %151 = vector.splat %c28 : vector<18x8x8xindex>
        %152 = index.ceildivs %c26, %c6
        %153 = bufferization.to_tensor %alloc_8 : memref<?xi16>
        %154 = math.tanh %cst_3 : f32
        %155 = index.shrs %c31, %c14
        %156 = arith.addi %true, %true : i1
        affine.store %true, %alloc_10[%c1] : memref<8xi1>
        %157 = tensor.empty() : tensor<64xf16>
        %unpack = tensor.unpack %12 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [%c8] into %157 : tensor<8x8xf16> -> tensor<64xf16>
        %158 = index.ceildivu %c26, %c2
        scf.yield
      }
      scf.yield %c27 : index
    }
    %18 = spirv.FUnordLessThanEqual %cst_2, %cst : f16
    %19 = spirv.GL.Ldexp %cst_5 : f32, %c1918110872_i32 : i32 -> f32
    %20 = spirv.SGreaterThanEqual %c2074439772_i32, %c46838844_i32 : i32
    %21 = spirv.GL.SMin %c2074439772_i32, %c1918110872_i32 : i32
    %22 = vector.broadcast %cst_2 : f16 to vector<18x8x8xf16>
    %23 = vector.transpose %22, [0, 2, 1] : vector<18x8x8xf16> to vector<18x8x8xf16>
    %24 = spirv.GL.Fma %cst_2, %cst_1, %cst_1 : f16
    %25 = spirv.FUnordGreaterThanEqual %cst_1, %cst_1 : f16
    %26 = vector.broadcast %c1483519822_i32 : i32 to vector<2xi32>
    %27 = spirv.BitFieldInsert %26, %26, %c2074439772_i32, %21 : vector<2xi32>, i32, i32
    %28 = spirv.CL.rsqrt %24 : f16
    affine.store %20, %alloc_16[%c8] : memref<?xi1>
    %29 = index.ceildivu %c1, %c3
    %30 = math.roundeven %19 : f32
    %31 = spirv.GL.Ldexp %19 : f32, %c1918110872_i32 : i32 -> f32
    %32 = spirv.CL.sin %31 : f32
    %33 = spirv.GL.Sin %19 : f32
    %dim = tensor.dim %11, %c0 : tensor<?xi1>
    %34 = memref.atomic_rmw minu %c-20288_i16, %alloc_20[%c16, %c5, %c2] : (i16, memref<18x8x8xi16>) -> i16
    %35 = spirv.FOrdNotEqual %32, %cst_4 : f32
    %36 = spirv.GL.Sqrt %19 : f32
    %37 = arith.muli %true, %20 : i1
    %38 = math.ceil %31 : f32
    %39 = index.xor %c4, %c20
    memref.tensor_store %11, %alloc_16 : memref<?xi1>
    %40 = math.log2 %cst_0 : f16
    %41 = spirv.GL.Atan %36 : f32
    %42 = spirv.FOrdNotEqual %cst_1, %cst_0 : f16
    %43 = spirv.BitwiseXor %26, %26 : vector<2xi32>
    %44 = bufferization.to_tensor %alloc : memref<?xi16>
    %45 = spirv.CL.sin %41 : f32
    %46 = spirv.FOrdNotEqual %32, %36 : f32
    %47 = spirv.GL.Ldexp %24 : f16, %c46838844_i32 : i32 -> f16
    %48 = math.log1p %4 : tensor<?x8x8xf16>
    %49 = spirv.LogicalAnd %18, %46 : i1
    %50 = spirv.LogicalAnd %true, %25 : i1
    %51 = spirv.CL.sin %31 : f32
    %52 = math.tanh %1 : tensor<?x?x?xf16>
    %53 = arith.ceildivsi %c2074439772_i32, %c2074439772_i32 : i32
    %54 = index.maxs %arg0, %c0
    %55 = affine.if affine_set<(d0) : ((d0 floordiv 128) * 2 - 32 == 0)>(%c14) -> i16 {
      %129 = arith.remf %cst_4, %41 : f32
      %alloc_31 = memref.alloc() : memref<8xi32>
      memref.tensor_store %3, %alloc_31 : memref<8xi32>
      %130 = math.cos %41 : f32
      %131 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxui>} %26, %26, %c1918110872_i32 : vector<2xi32>, vector<2xi32> into i32
      %132 = bufferization.to_memref %5 : memref<?xi64>
      %133 = index.ceildivu %c19, %c29
      %134 = math.tanh %1 : tensor<?x?x?xf16>
      %135 = arith.minsi %25, %35 : i1
      affine.yield %c-30880_i16 : i16
    } else {
      %129 = math.round %24 : f16
      %130 = bufferization.to_memref %0 : memref<8xi1>
      %131 = math.floor %24 : f16
      %132 = index.shru %c0, %c24
      %extracted_31 = tensor.extract %11[%c0] : tensor<?xi1>
      %133 = arith.divf %19, %cst_5 : f32
      %134 = arith.remui %true, %50 : i1
      %135 = math.exp %45 : f32
      affine.yield %c8569_i16 : i16
    }
    %collapsed = tensor.collapse_shape %7 [[0, 1]] : tensor<?x?xi16> into tensor<?xi16>
    %56 = spirv.FUnordGreaterThan %33, %36 : f32
    %alloc_21 = memref.alloc() : memref<18xf32>
    %true_22 = index.bool.constant true
    %57 = vector.broadcast %cst_1 : f16 to vector<8x8x8x8xf16>
    %58 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2, d3, d4) -> (d4, d0, d1)>, affine_map<(d0, d1, d2, d3, d4) -> (d4, d2, d3)>, affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2, d3)>], iterator_types = ["parallel", "parallel", "parallel", "parallel", "reduction"], kind = #vector.kind<minf>} %22, %22, %57 : vector<18x8x8xf16>, vector<18x8x8xf16> into vector<8x8x8x8xf16>
    %59 = spirv.BitFieldInsert %26, %26, %c1765106691_i64, %c-30880_i16 : vector<2xi32>, i64, i16
    %60 = spirv.FUnordLessThan %47, %cst_1 : f16
    %61 = vector.flat_transpose %26 {columns = 1 : i32, rows = 2 : i32} : vector<2xi32> -> vector<2xi32>
    %62 = index.or %c14, %c12
    %63 = spirv.BitFieldInsert %26, %61, %21, %c1918110872_i32 : vector<2xi32>, i32, i32
    %extracted = tensor.extract %13[%c13] : tensor<18xi32>
    memref.copy %alloc_6, %alloc_6 : memref<8xi16> to memref<8xi16>
    %64 = spirv.CL.sin %31 : f32
    %65 = arith.addi %25, %18 : i1
    %66 = math.ceil %41 : f32
    %67 = index.casts %c12 : index to i32
    %68 = spirv.GL.Fma %cst_1, %cst_2, %cst_1 : f16
    %69 = index.casts %c8 : index to i32
    %70 = math.powf %28, %cst_0 : f16
    %71 = math.ceil %8 : tensor<?xf16>
    %72 = spirv.GL.Log %cst_5 : f32
    %73 = vector.insertelement %extracted, %26[%c2 : index] : vector<2xi32>
    %74 = spirv.GL.Acos %33 : f32
    %75 = spirv.BitwiseAnd %26, %26 : vector<2xi32>
    %76 = spirv.FUnordEqual %cst_3, %36 : f32
    %alloc_23 = memref.alloc() : memref<18x8x8xi1>
    %77 = spirv.GL.FMin %24, %24 : f16
    %78 = spirv.CL.erf %cst_3 : f32
    %alloca = memref.alloca(%c19) : memref<?x8x8xi16>
    %79 = vector.extract %26[1] : i32 from vector<2xi32>
    %80 = math.tanh %cst_4 : f32
    %81 = math.copysign %19, %cst_3 : f32
    %82 = arith.divui %35, %56 : i1
    %83 = spirv.GL.Tanh %31 : f32
    %84 = spirv.CL.fabs %77 : f16
    %85 = spirv.GL.SClamp %61, %61, %26 : vector<2xi32>
    %86 = spirv.CL.ceil %47 : f16
    %87 = spirv.LogicalOr %25, %56 : i1
    %alloc_24 = memref.alloc(%c25) : memref<?xi1>
    %88 = arith.muli %49, %18 : i1
    %89 = spirv.GL.SMax %c-30880_i16, %c-30880_i16 : i16
    %90 = math.rsqrt %15 : tensor<18xf16>
    %91 = spirv.GL.Log %36 : f32
    %92 = spirv.CL.floor %31 : f32
    %alloc_25 = memref.alloc() : memref<8x8xf16>
    memref.tensor_store %12, %alloc_25 : memref<8x8xf16>
    %93 = spirv.LogicalEqual %60, %20 : i1
    %94 = math.rsqrt %33 : f32
    %95 = vector.broadcast %c1765106691_i64 : i64 to vector<20xi64>
    %96 = vector.broadcast %42 : i1 to vector<20xi1>
    %97 = vector.maskedload %alloc_13[%c7, %c6], %96, %95 : memref<8x8xi64>, vector<20xi1>, vector<20xi64> into vector<20xi64>
    %98 = spirv.GL.UMax %c46838844_i32, %21 : i32
    %99 = spirv.BitFieldSExtract %26, %21, %c-30880_i16 : vector<2xi32>, i32, i16
    %100 = spirv.GL.Sinh %cst_0 : f16
    affine.parallel (%arg2, %arg3) = (0, 0) to (20, 8) {
      %129 = math.cos %cst_2 : f16
    }
    %101 = math.tanh %19 : f32
    %102 = arith.remf %24, %86 : f16
    %103 = index.castu %20 : i1 to index
    affine.store %98, %alloc_12[%c30, %c6] : memref<?x?xi32>
    %104 = spirv.GL.Exp %36 : f32
    %105 = spirv.CL.log %74 : f32
    %106 = affine.if affine_set<(d0, d1, d2) : (d2 + d1 >= 0, d2 >= 0, d0 * 2 == 0, -d0 == 0)>(%c19, %c29, %c10) -> i1 {
      %129 = arith.shrsi %extracted, %c1918110872_i32 : i32
      %130 = math.copysign %cst, %68 : f16
      %alloc_31 = memref.alloc() : memref<8xf32>
      %131 = vector.insert %c1765106691_i64, %95 [0] : i64 into vector<20xi64>
      %132 = affine.for %arg2 = 0 to 6 iter_args(%arg3 = %89) -> (i16) {
        affine.yield %c8569_i16 : i16
      }
      %133 = arith.cmpf oeq, %33, %72 : f32
      %134 = tensor.empty() : tensor<i32>
      %135 = linalg.dot ins(%13, %13 : tensor<18xi32>, tensor<18xi32>) outs(%134 : tensor<i32>) -> tensor<i32>
      %136 = arith.divf %41, %91 : f32
      affine.yield %60 : i1
    } else {
      %129 = vector.broadcast %c1765106691_i64 : i64 to vector<20x20xi64>
      %130 = vector.outerproduct %97, %97, %129 {kind = #vector.kind<minsi>} : vector<20xi64>, vector<20xi64>
      %131 = vector.broadcast %83 : f32 to vector<18x8x8xf32>
      %132 = vector.fma %131, %131, %131 : vector<18x8x8xf32>
      %133 = arith.shrsi %56, %76 : i1
      %134 = index.and %c26, %c17
      %135 = index.ceildivu %c25, %134
      %136 = vector.extract_strided_slice %95 {offsets = [14], sizes = [5], strides = [1]} : vector<20xi64> to vector<5xi64>
      %137 = linalg.copy ins(%1 : tensor<?x?x?xf16>) outs(%1 : tensor<?x?x?xf16>) -> tensor<?x?x?xf16>
      %138 = vector.matrix_multiply %96, %96 {lhs_columns = 20 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<20xi1>, vector<20xi1>) -> vector<1xi1>
      affine.yield %true : i1
    }
    %107 = math.cos %45 : f32
    %108 = index.shru %c10, %c11
    %109 = vector.splat %arg0 : vector<8x8xindex>
    %alloc_26 = memref.alloc(%c6, %c22) : memref<?x?x8xi16>
    linalg.broadcast ins(%7 : tensor<?x?xi16>) outs(%alloc_26 : memref<?x?x8xi16>) dimensions = [2] 
    %110 = index.casts %c8569_i16 : i16 to index
    %111 = spirv.ULessThanEqual %c1765106691_i64, %c1765106691_i64 : i64
    %112 = affine.apply affine_map<(d0, d1, d2, d3)[s0] -> (d0 floordiv 32)>(%c9, %c31, %c14, %c15)[%c9]
    %113 = arith.remsi %c1765106691_i64, %c1765106691_i64 : i64
    %114 = index.mul %103, %c13
    %115 = spirv.CL.round %68 : f16
    %116 = spirv.GL.FSign %105 : f32
    %117 = arith.muli %c46838844_i32, %98 : i32
    %cast = tensor.cast %15 : tensor<18xf16> to tensor<?xf16>
    %dim_27 = tensor.dim %1, %c2 : tensor<?x?x?xf16>
    %118 = spirv.GL.UClamp %c-30880_i16, %c8569_i16, %c-30880_i16 : i16
    %extracted_28 = tensor.extract %5[%c0] : tensor<?xi64>
    %119 = index.or %108, %c24
    %120 = spirv.GL.FMin %cst_0, %77 : f16
    %121 = memref.atomic_rmw addi %c8569_i16, %alloc_20[%c11, %c6, %c6] : (i16, memref<18x8x8xi16>) -> i16
    %cast_29 = tensor.cast %11 : tensor<?xi1> to tensor<8xi1>
    %122 = spirv.GL.Sqrt %32 : f32
    %123 = vector.shuffle %95, %97 [4, 5, 7, 8, 10, 12, 14, 15, 16, 20, 21, 23, 25, 27, 33, 34, 35, 37, 38] : vector<20xi64>, vector<20xi64>
    %124 = arith.shrsi %c-20288_i16, %c8569_i16 : i16
    %125 = tensor.empty(%c7) : tensor<18x?x8xf32>
    %true_30 = index.bool.constant true
    %126 = spirv.SGreaterThan %118, %c8569_i16 : i16
    %127 = arith.xori %c1483519822_i32, %98 : i32
    %128 = spirv.SGreaterThan %c1918110872_i32, %c1918110872_i32 : i32
    vector.print %22 : vector<18x8x8xf16>
    vector.print %26 : vector<2xi32>
    vector.print %61 : vector<2xi32>
    vector.print %95 : vector<20xi64>
    vector.print %96 : vector<20xi1>
    vector.print %97 : vector<20xi64>
    vector.print %c1765106691_i64 : i64
    vector.print %cst : f16
    vector.print %c1483519822_i32 : i32
    vector.print %c8569_i16 : i16
    vector.print %c2074439772_i32 : i32
    vector.print %c1918110872_i32 : i32
    vector.print %cst_0 : f16
    vector.print %cst_1 : f16
    vector.print %cst_2 : f16
    vector.print %cst_3 : f32
    vector.print %c-30880_i16 : i16
    vector.print %cst_4 : f32
    vector.print %c46838844_i32 : i32
    vector.print %c-20288_i16 : i16
    vector.print %true : i1
    vector.print %cst_5 : f32
    vector.print %18 : i1
    vector.print %19 : f32
    vector.print %20 : i1
    vector.print %21 : i32
    vector.print %24 : f16
    vector.print %25 : i1
    vector.print %28 : f16
    vector.print %31 : f32
    vector.print %32 : f32
    vector.print %33 : f32
    vector.print %35 : i1
    vector.print %36 : f32
    vector.print %41 : f32
    vector.print %42 : i1
    vector.print %45 : f32
    vector.print %46 : i1
    vector.print %47 : f16
    vector.print %49 : i1
    vector.print %50 : i1
    vector.print %51 : f32
    vector.print %56 : i1
    vector.print %true_22 : i1
    vector.print %60 : i1
    vector.print %extracted : i32
    vector.print %64 : f32
    vector.print %68 : f16
    vector.print %72 : f32
    vector.print %74 : f32
    vector.print %76 : i1
    vector.print %77 : f16
    vector.print %78 : f32
    vector.print %83 : f32
    vector.print %84 : f16
    vector.print %86 : f16
    vector.print %87 : i1
    vector.print %89 : i16
    vector.print %91 : f32
    vector.print %92 : f32
    vector.print %93 : i1
    vector.print %98 : i32
    vector.print %100 : f16
    vector.print %104 : f32
    vector.print %105 : f32
    vector.print %111 : i1
    vector.print %115 : f16
    vector.print %116 : f32
    vector.print %118 : i16
    vector.print %extracted_28 : i64
    vector.print %120 : f16
    vector.print %122 : f32
    vector.print %true_30 : i1
    vector.print %126 : i1
    vector.print %128 : i1
    return
  }
  func.func @func2(%arg0: tensor<8xi32>) {
    %c1765106691_i64 = arith.constant 1765106691 : i64
    %cst = arith.constant 5.430400e+04 : f16
    %c1483519822_i32 = arith.constant 1483519822 : i32
    %c8569_i16 = arith.constant 8569 : i16
    %c2074439772_i32 = arith.constant 2074439772 : i32
    %c1918110872_i32 = arith.constant 1918110872 : i32
    %cst_0 = arith.constant 6.195200e+04 : f16
    %cst_1 = arith.constant 1.634400e+04 : f16
    %cst_2 = arith.constant 2.931200e+04 : f16
    %cst_3 = arith.constant 0x4D0DF40A : f32
    %c-30880_i16 = arith.constant -30880 : i16
    %cst_4 = arith.constant 0x4E3756D7 : f32
    %c46838844_i32 = arith.constant 46838844 : i32
    %c-20288_i16 = arith.constant -20288 : i16
    %true = arith.constant true
    %cst_5 = arith.constant 0x4D011AAB : f32
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %c16 = arith.constant 16 : index
    %c17 = arith.constant 17 : index
    %c18 = arith.constant 18 : index
    %c19 = arith.constant 19 : index
    %c20 = arith.constant 20 : index
    %c21 = arith.constant 21 : index
    %c22 = arith.constant 22 : index
    %c23 = arith.constant 23 : index
    %c24 = arith.constant 24 : index
    %c25 = arith.constant 25 : index
    %c26 = arith.constant 26 : index
    %c27 = arith.constant 27 : index
    %c28 = arith.constant 28 : index
    %c29 = arith.constant 29 : index
    %c30 = arith.constant 30 : index
    %c31 = arith.constant 31 : index
    %0 = tensor.empty() : tensor<8xi1>
    %1 = tensor.empty(%c4, %c5, %c13) : tensor<?x?x?xf16>
    %2 = tensor.empty(%c4, %c1) : tensor<?x?x8xi32>
    %3 = tensor.empty() : tensor<8xi32>
    %4 = tensor.empty(%c20) : tensor<?x8x8xf16>
    %5 = tensor.empty(%c6) : tensor<?xi64>
    %6 = tensor.empty() : tensor<8x8xi1>
    %7 = tensor.empty(%c13, %c5) : tensor<?x?xi16>
    %8 = tensor.empty(%c1) : tensor<?xf16>
    %9 = tensor.empty(%c11) : tensor<?xi32>
    %10 = tensor.empty(%c30) : tensor<?xf16>
    %11 = tensor.empty(%c25) : tensor<?xi1>
    %12 = tensor.empty() : tensor<8x8xf16>
    %13 = tensor.empty() : tensor<18xi32>
    %14 = tensor.empty(%c24) : tensor<?x8xi64>
    %15 = tensor.empty() : tensor<18xf16>
    %alloc = memref.alloc(%c0) : memref<?xi16>
    %alloc_6 = memref.alloc() : memref<8xi16>
    %alloc_7 = memref.alloc() : memref<8x8xf32>
    %alloc_8 = memref.alloc(%c24) : memref<?xi16>
    %alloc_9 = memref.alloc() : memref<8x8xi32>
    %alloc_10 = memref.alloc() : memref<8xi1>
    %alloc_11 = memref.alloc() : memref<8x8xi32>
    %alloc_12 = memref.alloc(%c27, %c18) : memref<?x?xi32>
    %alloc_13 = memref.alloc() : memref<8x8xi64>
    %alloc_14 = memref.alloc() : memref<18x8x8xf16>
    %alloc_15 = memref.alloc(%c25) : memref<?xf32>
    %alloc_16 = memref.alloc(%c27) : memref<?xi1>
    %alloc_17 = memref.alloc(%c8) : memref<?xi64>
    %alloc_18 = memref.alloc(%c13) : memref<?x8x8xi1>
    %alloc_19 = memref.alloc() : memref<8x8xi64>
    %alloc_20 = memref.alloc() : memref<18x8x8xi16>
    %16 = spirv.CL.tanh %cst_2 : f16
    %17 = spirv.GL.InverseSqrt %cst_3 : f32
    %18 = tensor.empty() : tensor<i1>
    %19 = linalg.dot ins(%0, %alloc_10 : tensor<8xi1>, memref<8xi1>) outs(%18 : tensor<i1>) -> tensor<i1>
    %20 = spirv.GL.Pow %cst, %cst_1 : f16
    %21 = spirv.GL.UMax %c46838844_i32, %c1483519822_i32 : i32
    %22 = math.tanh %1 : tensor<?x?x?xf16>
    %23 = affine.vector_load %alloc[%c10] : memref<?xi16>, vector<20xi16>
    %24 = spirv.FUnordLessThanEqual %16, %cst : f16
    %25 = arith.minsi %c-30880_i16, %c-30880_i16 : i16
    %26 = arith.addf %cst_5, %cst_3 : f32
    %27 = spirv.SGreaterThan %c-20288_i16, %c8569_i16 : i16
    %28 = math.round %20 : f16
    %29 = vector.multi_reduction <xor>, %23, %c-20288_i16 [0] : vector<20xi16> to i16
    %30 = spirv.GL.Round %16 : f16
    %31 = vector.transpose %23, [0] : vector<20xi16> to vector<20xi16>
    %32 = spirv.GL.UMax %c1765106691_i64, %c1765106691_i64 : i64
    %33 = vector.broadcast %c1918110872_i32 : i32 to vector<2xi32>
    %34 = spirv.BitFieldUExtract %33, %c1765106691_i64, %29 : vector<2xi32>, i64, i16
    %35 = spirv.GL.SSign %c-30880_i16 : i16
    %36 = spirv.GL.SMax %c-20288_i16, %35 : i16
    %37 = scf.index_switch %c29 -> index 
    case 1 {
      %141 = vector.broadcast %cst_3 : f32 to vector<18xf32>
      %142 = vector.fma %141, %141, %141 : vector<18xf32>
      %143 = vector.insert %cst_4, %141 [4] : f32 into vector<18xf32>
      %144 = arith.divf %cst_0, %cst : f16
      %rank_22 = tensor.rank %8 : tensor<?xf16>
      %145 = arith.remui %c2074439772_i32, %c46838844_i32 : i32
      linalg.transpose ins(%alloc_17 : memref<?xi64>) outs(%alloc_17 : memref<?xi64>) permutation = [0] 
      %146 = math.atan %cst_3 : f32
      %147 = index.ceildivs %c31, %c29
      %148 = arith.remsi %35, %36 : i16
      %149 = arith.shli %true, %true : i1
      %150 = index.or %c2, %c15
      %151 = affine.if affine_set<(d0, d1, d2, d3) : (d2 - d1 == 0, (d3 mod 64) * 128 >= 0)>(%c6, %c10, %c8, %c26) -> f32 {
        %156 = bufferization.clone %alloc_9 : memref<8x8xi32> to memref<8x8xi32>
        %157 = index.sizeof
        %158 = math.atan %8 : tensor<?xf16>
        %159 = index.maxu %c7, %c31
        %dim_23 = tensor.dim %2, %c1 : tensor<?x?x8xi32>
        %160 = arith.shrui %27, %24 : i1
        %161 = vector.broadcast %c46838844_i32 : i32 to vector<2x2xi32>
        %162 = vector.outerproduct %33, %33, %161 {kind = #vector.kind<minsi>} : vector<2xi32>, vector<2xi32>
        %163 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minf>} %142, %141, %cst_5 : vector<18xf32>, vector<18xf32> into f32
        affine.yield %cst_4 : f32
      } else {
        %156 = affine.vector_load %alloc_20[%c21, %c15, %c29] : memref<18x8x8xi16>, vector<20xi16>
        %157 = math.log2 %12 : tensor<8x8xf16>
        %158 = vector.flat_transpose %156 {columns = 4 : i32, rows = 5 : i32} : vector<20xi16> -> vector<20xi16>
        %alloca = memref.alloca(%c9) : memref<?xi64>
        %159 = math.tanh %cst_1 : f16
        %160 = arith.addi %24, %24 : i1
        %161 = math.round %cst_4 : f32
        %162 = index.mul %c22, %c0
        affine.yield %17 : f32
      }
      %152 = vector.splat %c13 : vector<8x8xindex>
      %153 = arith.muli %32, %c1765106691_i64 : i64
      %154 = index.shru %c6, %c14
      %155 = arith.remsi %32, %c1765106691_i64 : i64
      scf.yield %c19 : index
    }
    case 2 {
      %141 = index.floordivs %c13, %c17
      %142 = arith.shrsi %c1483519822_i32, %c2074439772_i32 : i32
      %143 = linalg.dot ins(%alloc_10, %alloc_10 : memref<8xi1>, memref<8xi1>) outs(%19 : tensor<i1>) -> tensor<i1>
      %144 = arith.remf %cst_0, %16 : f16
      %145 = bufferization.to_memref %143 : memref<i1>
      %146 = scf.execute_region -> vector<8xi64> {
        %154 = vector.extract %23[9] : i16 from vector<20xi16>
        %155 = vector.insert %c-30880_i16, %23 [2] : i16 into vector<20xi16>
        %156 = arith.remsi %true, %27 : i1
        %157 = vector.broadcast %17 : f32 to vector<f32>
        vector.transfer_write %157, %alloc_7[%c15, %c29] : vector<f32>, memref<8x8xf32>
        %dim_22 = tensor.dim %9, %c0 : tensor<?xi32>
        %158 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minsi>} %23, %23, %35 : vector<20xi16>, vector<20xi16> into i16
        memref.copy %alloc_15, %alloc_15 : memref<?xf32> to memref<?xf32>
        %159 = arith.muli %29, %c-20288_i16 : i16
        %160 = tensor.empty() : tensor<18x8x8xi16>
        %161 = vector.broadcast %36 : i16 to vector<18xi16>
        %162 = vector.broadcast %27 : i1 to vector<18xi1>
        %163 = vector.broadcast %21 : i32 to vector<18xi32>
        %164 = vector.gather %160[%c7, %c3, %c9] [%163], %162, %161 : tensor<18x8x8xi16>, vector<18xi32>, vector<18xi1>, vector<18xi16> into vector<18xi16>
        %165 = math.log10 %20 : f16
        %166 = index.sub %c11, %c2
        %extracted_23 = tensor.extract %2[%c0, %c0, %c6] : tensor<?x?x8xi32>
        %167 = vector.insert %c1483519822_i32, %163 [6] : i32 into vector<18xi32>
        %168 = vector.insert %29, %161 [3] : i16 into vector<18xi16>
        %unpack_24 = tensor.unpack %18 inner_dims_pos = [] inner_tiles = [] into %143 : tensor<i1> -> tensor<i1>
        %169 = arith.remf %cst_0, %20 : f16
        %170 = vector.broadcast %c1765106691_i64 : i64 to vector<8xi64>
        scf.yield %170 : vector<8xi64>
      }
      %147 = arith.muli %35, %36 : i16
      %148 = vector.shuffle %33, %33 [0, 3] : vector<2xi32>, vector<2xi32>
      affine.store %c1765106691_i64, %alloc_19[%c15, %c11] : memref<8x8xi64>
      memref.assume_alignment %alloc_20, 1 : memref<18x8x8xi16>
      %149 = arith.ori %36, %c-20288_i16 : i16
      %150 = math.sqrt %30 : f16
      %151 = bufferization.clone %145 : memref<i1> to memref<i1>
      %152 = math.rsqrt %15 : tensor<18xf16>
      %153 = bufferization.to_memref %5 : memref<?xi64>
      %unpack = tensor.unpack %18 inner_dims_pos = [] inner_tiles = [] into %18 : tensor<i1> -> tensor<i1>
      scf.yield %c11 : index
    }
    case 3 {
      %141 = vector.multi_reduction <minui>, %23, %23 [] : vector<20xi16> to vector<20xi16>
      %142 = arith.addf %cst_2, %16 : f16
      vector.warp_execute_on_lane_0(%c0)[32] {
        %152 = affine.vector_load %alloc_18[%c21, %c23, %c0] : memref<?x8x8xi1>, vector<18xi1>
        %153 = arith.ceildivsi %c1765106691_i64, %c1765106691_i64 : i64
        %154 = linalg.copy ins(%14 : tensor<?x8xi64>) outs(%14 : tensor<?x8xi64>) -> tensor<?x8xi64>
        %155 = math.ctlz %6 : tensor<8x8xi1>
        %collapsed_26 = tensor.collapse_shape %2 [[0, 1], [2]] : tensor<?x?x8xi32> into tensor<?x8xi32>
        %156 = vector.broadcast %cst_5 : f32 to vector<18x8x8xf32>
        %157 = vector.fma %156, %156, %156 : vector<18x8x8xf32>
        %158 = index.and %c9, %c2
        %159 = vector.shuffle %33, %33 [0, 1] : vector<2xi32>, vector<2xi32>
      }
      %143 = tensor.empty() : tensor<64xi1>
      %unpack = tensor.unpack %6 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [%c8] into %143 : tensor<8x8xi1> -> tensor<64xi1>
      %alloc_22 = memref.alloc() : memref<64xi1>
      %144 = linalg.dot ins(%143, %alloc_22 : tensor<64xi1>, memref<64xi1>) outs(%18 : tensor<i1>) -> tensor<i1>
      %145 = arith.addi %c2074439772_i32, %c1918110872_i32 : i32
      %146 = arith.remui %27, %true : i1
      %147 = vector.transpose %33, [0] : vector<2xi32> to vector<2xi32>
      %148 = vector.flat_transpose %33 {columns = 1 : i32, rows = 2 : i32} : vector<2xi32> -> vector<2xi32>
      %alloca = memref.alloca(%c30) : memref<?x8xi16>
      %unpack_23 = tensor.unpack %6 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [%c8] into %143 : tensor<8x8xi1> -> tensor<64xi1>
      %149 = arith.shrsi %c1918110872_i32, %c1918110872_i32 : i32
      %150 = arith.divui %35, %c8569_i16 : i16
      %151 = arith.cmpi sgt, %c46838844_i32, %c2074439772_i32 : i32
      %false_24 = index.bool.constant false
      %rank_25 = tensor.rank %10 : tensor<?xf16>
      scf.yield %c29 : index
    }
    default {
      memref.copy %alloc_13, %alloc_19 : memref<8x8xi64> to memref<8x8xi64>
      %141 = bufferization.clone %alloc_11 : memref<8x8xi32> to memref<8x8xi32>
      %142 = bufferization.clone %141 : memref<8x8xi32> to memref<8x8xi32>
      %143 = tensor.empty() : tensor<8xi64>
      %144 = arith.cmpi ugt, %c46838844_i32, %c2074439772_i32 : i32
