module {
  func.func @func1(%arg0: i64) {
    %c329904959_i64 = arith.constant 329904959 : i64
    %true = arith.constant true
    %c527088365_i32 = arith.constant 527088365 : i32
    %c238821326_i64 = arith.constant 238821326 : i64
    %cst = arith.constant 0x4C8EC744 : f32
    %cst_0 = arith.constant 2.01879514E+9 : f32
    %c453217699_i64 = arith.constant 453217699 : i64
    %c383367506_i32 = arith.constant 383367506 : i32
    %c-21738_i16 = arith.constant -21738 : i16
    %false = arith.constant false
    %c1321462035_i32 = arith.constant 1321462035 : i32
    %c1511750638_i32 = arith.constant 1511750638 : i32
    %cst_1 = arith.constant 6.380800e+04 : f16
    %c-5165_i16 = arith.constant -5165 : i16
    %c10976_i16 = arith.constant 10976 : i16
    %c990472205_i64 = arith.constant 990472205 : i64
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %c16 = arith.constant 16 : index
    %c17 = arith.constant 17 : index
    %c18 = arith.constant 18 : index
    %c19 = arith.constant 19 : index
    %c20 = arith.constant 20 : index
    %c21 = arith.constant 21 : index
    %c22 = arith.constant 22 : index
    %c23 = arith.constant 23 : index
    %c24 = arith.constant 24 : index
    %c25 = arith.constant 25 : index
    %c26 = arith.constant 26 : index
    %c27 = arith.constant 27 : index
    %c28 = arith.constant 28 : index
    %c29 = arith.constant 29 : index
    %c30 = arith.constant 30 : index
    %c31 = arith.constant 31 : index
    %0 = tensor.empty() : tensor<16x17xi32>
    %1 = tensor.empty() : tensor<16x17xf32>
    %2 = tensor.empty() : tensor<10x16xi32>
    %3 = tensor.empty(%c0) : tensor<?x16xf16>
    %4 = tensor.empty(%c8) : tensor<?xf16>
    %5 = tensor.empty(%c9) : tensor<?x16x17xi16>
    %6 = tensor.empty(%c27) : tensor<?x17xi64>
    %7 = tensor.empty(%c5) : tensor<?x17xf16>
    %8 = tensor.empty() : tensor<17xi32>
    %9 = tensor.empty(%c31) : tensor<?x16xi32>
    %10 = tensor.empty() : tensor<16x17xi64>
    %11 = tensor.empty() : tensor<17xf16>
    %12 = tensor.empty() : tensor<17x16x17xi16>
    %13 = tensor.empty(%c9) : tensor<?xf16>
    %14 = tensor.empty() : tensor<16x17xf16>
    %15 = tensor.empty() : tensor<10x16xi16>
    %alloc = memref.alloc(%c20) : memref<?x16xf32>
    %alloc_2 = memref.alloc(%c4) : memref<?xf32>
    %alloc_3 = memref.alloc() : memref<17xi16>
    %alloc_4 = memref.alloc() : memref<17x16x17xi32>
    %alloc_5 = memref.alloc() : memref<16x17xi1>
    %alloc_6 = memref.alloc(%c2, %c23) : memref<?x?x17xf16>
    %alloc_7 = memref.alloc() : memref<10x16xi1>
    %alloc_8 = memref.alloc(%c13, %c31) : memref<?x?x17xi32>
    %alloc_9 = memref.alloc() : memref<17x16x17xi32>
    %alloc_10 = memref.alloc() : memref<16x17xf16>
    %alloc_11 = memref.alloc() : memref<17x16x17xf16>
    %alloc_12 = memref.alloc(%c1) : memref<?x16xf32>
    %alloc_13 = memref.alloc(%c8) : memref<?x17xf16>
    %alloc_14 = memref.alloc() : memref<17x16x17xi1>
    %alloc_15 = memref.alloc() : memref<17x16x17xi32>
    %alloc_16 = memref.alloc(%c26, %c2) : memref<?x?xf16>
    scf.index_switch %c29 
    case 1 {
      %129 = arith.ori %false, %true : i1
      %130 = affine.apply affine_map<(d0, d1, d2, d3)[s0] -> ((d3 - 1) mod 16 + 2)>(%c15, %c14, %c22, %c0)[%c1]
      %131 = bufferization.clone %alloc_3 : memref<17xi16> to memref<17xi16>
      %132 = affine.apply affine_map<(d0) -> ((-d0) mod 16)>(%c28)
      %133 = vector.broadcast %true : i1 to vector<17xi1>
      %134 = vector.transpose %133, [0] : vector<17xi1> to vector<17xi1>
      %inserted_20 = tensor.insert %cst_0 into %1[%c10, %c0] : tensor<16x17xf32>
      %c0_i16 = arith.constant 0 : i16
      %135 = vector.transfer_read %12[%c20, %c23, %c30], %c0_i16 : tensor<17x16x17xi16>, vector<i16>
      %136 = math.log2 %1 : tensor<16x17xf32>
      %137 = affine.vector_load %alloc_4[%c0, %c3, %c27] : memref<17x16x17xi32>, vector<11xi32>
      %alloc_21 = memref.alloc(%c14, %c29) : memref<?x?xf16>
      %138 = math.ctpop %15 : tensor<10x16xi16>
      vector.compressstore %alloc_14[%c12, %c11, %c5], %133, %133 : memref<17x16x17xi1>, vector<17xi1>, vector<17xi1>
      %139 = scf.index_switch %c9 -> memref<?xf16> 
      case 1 {
        %143 = index.mul %c16, %c3
        %144 = arith.negf %cst_1 : f16
        %145 = arith.addi %c383367506_i32, %c527088365_i32 : i32
        %146 = index.and %c14, %c0
        %147 = arith.ori %arg0, %c990472205_i64 : i64
        %148 = index.mul %c1, %c5
        %149 = tensor.empty() : tensor<10x16xf16>
        %150 = vector.transpose %137, [0] : vector<11xi32> to vector<11xi32>
        %151 = arith.remf %cst_0, %cst_0 : f32
        %152 = index.maxs %c8, %c12
        %153 = index.sub %c4, %c8
        %154 = math.tanh %1 : tensor<16x17xf32>
        %155 = index.and %c27, %146
        %c1949579880_i64 = arith.constant 1949579880 : i64
        %156 = arith.ceildivsi %c1321462035_i32, %c1511750638_i32 : i32
        %157 = index.divu %c8, %155
        %alloc_22 = memref.alloc(%c4) : memref<?xf16>
        scf.yield %alloc_22 : memref<?xf16>
      }
      case 2 {
        %143 = bufferization.clone %alloc_10 : memref<16x17xf16> to memref<16x17xf16>
        %splat = tensor.splat %c1511750638_i32 : tensor<10x16xi32>
        %144 = arith.minui %arg0, %c453217699_i64 : i64
        %145 = index.sizeof
        %146 = vector.broadcast %c-5165_i16 : i16 to vector<16x17xi16>
        %147 = arith.shli %c527088365_i32, %c527088365_i32 : i32
        %148 = index.sizeof
        %149 = math.cttz %0 : tensor<16x17xi32>
        %150 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxsi>} %137, %137, %c1321462035_i32 : vector<11xi32>, vector<11xi32> into i32
        %151 = arith.shli %c527088365_i32, %c1511750638_i32 : i32
        %152 = tensor.empty(%c17) : tensor<?x16x10xi32>
        %broadcasted = linalg.broadcast ins(%9 : tensor<?x16xi32>) outs(%152 : tensor<?x16x10xi32>) dimensions = [2] 
        %153 = arith.minsi %c329904959_i64, %c990472205_i64 : i64
        %154 = arith.minsi %c-21738_i16, %c10976_i16 : i16
        %155 = math.ceil %14 : tensor<16x17xf16>
        %156 = math.log1p %1 : tensor<16x17xf32>
        %157 = arith.xori %c383367506_i32, %c1511750638_i32 : i32
        %alloc_22 = memref.alloc(%148) : memref<?xf16>
        scf.yield %alloc_22 : memref<?xf16>
      }
      default {
        %143 = vector.insert %false, %133 [11] : i1 into vector<17xi1>
        %splat = tensor.splat %c1321462035_i32 : tensor<17x16x17xi32>
        %144 = index.mul %c11, %c1
        %145 = vector.reduction <mul>, %137 : vector<11xi32> into i32
        %146 = vector.broadcast %cst : f32 to vector<17x16x17xf32>
        %147 = vector.fma %146, %146, %146 : vector<17x16x17xf32>
        %cst_22 = arith.constant 1.468800e+04 : f16
        %148 = arith.muli %true, %true : i1
        vector.print %133 : vector<17xi1>
        %cst_23 = arith.constant 3.824000e+04 : f16
        %extracted_24 = tensor.extract %8[%c12] : tensor<17xi32>
        %cast = tensor.cast %4 : tensor<?xf16> to tensor<16xf16>
        %149 = index.casts %c527088365_i32 : i32 to index
        %150 = vector.matrix_multiply %133, %133 {lhs_columns = 17 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<17xi1>, vector<17xi1>) -> vector<1xi1>
        affine.vector_store %133, %alloc_7[%132, %c13] : memref<10x16xi1>, vector<17xi1>
        %splat_25 = tensor.splat %c990472205_i64 : tensor<17xi64>
        %151 = arith.remf %cst_0, %cst : f32
        %alloc_26 = memref.alloc(%c24) : memref<?xf16>
        scf.yield %alloc_26 : memref<?xf16>
      }
      %140 = math.cos %cst : f32
      %141 = vector.multi_reduction <mul>, %137, %137 [] : vector<11xi32> to vector<11xi32>
      %142 = math.exp %3 : tensor<?x16xf16>
      scf.yield
    }
    case 2 {
      %alloc_20 = memref.alloc() : memref<17x16x17xi64>
      %129 = vector.broadcast %c527088365_i32 : i32 to vector<16x17xi32>
      %130 = vector.transpose %129, [0, 1] : vector<16x17xi32> to vector<16x17xi32>
      %131 = vector.broadcast %cst_1 : f16 to vector<16xf16>
      affine.vector_store %131, %alloc_16[%c22, %c2] : memref<?x?xf16>, vector<16xf16>
      scf.execute_region {
        %136 = math.atan %cst : f32
        %137 = vector.transfer_read %9[%c30, %c13], %c383367506_i32 : tensor<?x16xi32>, vector<i32>
        %rank = tensor.rank %15 : tensor<10x16xi16>
        %138 = arith.minsi %arg0, %c238821326_i64 : i64
        %139 = arith.addf %cst_1, %cst_1 : f16
        %alloc_25 = memref.alloc() : memref<17x16x17xi32>
        %140 = arith.addf %cst_0, %cst : f32
        %141 = math.exp %cst : f32
        %142 = math.ceil %cst_1 : f16
        %143 = arith.minui %c1321462035_i32, %c383367506_i32 : i32
        %144 = index.shrs %c16, %c15
        %collapsed = tensor.collapse_shape %2 [[0, 1]] : tensor<10x16xi32> into tensor<160xi32>
        memref.store %cst_1, %alloc_16[%c0, %c0] : memref<?x?xf16>
        %145 = arith.minui %c329904959_i64, %c453217699_i64 : i64
        %146 = index.sub %rank, %c17
        %147 = tensor.empty() : tensor<i32>
        %148 = linalg.dot ins(%collapsed, %collapsed : tensor<160xi32>, tensor<160xi32>) outs(%147 : tensor<i32>) -> tensor<i32>
        scf.yield
      }
      %132 = math.rsqrt %14 : tensor<16x17xf16>
      %alloca = memref.alloca(%c14, %c14) : memref<?x?xi32>
      %133 = vector.matrix_multiply %131, %131 {lhs_columns = 16 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<16xf16>, vector<16xf16>) -> vector<1xf16>
      %alloca_21 = memref.alloca() : memref<16x17xi64>
      %inserted_22 = tensor.insert %c527088365_i32 into %8[%c10] : tensor<17xi32>
      %generated = tensor.generate %c3 {
      ^bb0(%arg1: index):
        %136 = math.cos %11 : tensor<17xf16>
        %137 = arith.remf %cst_0, %cst_0 : f32
        %138 = arith.ori %c527088365_i32, %c1511750638_i32 : i32
        %139 = arith.xori %c238821326_i64, %arg0 : i64
        tensor.yield %c329904959_i64 : i64
      } : tensor<?xi64>
      %134 = arith.remf %cst_1, %cst_1 : f16
      %generated_23 = tensor.generate %c15 {
      ^bb0(%arg1: index, %arg2: index):
        %136 = vector.transfer_read %generated[%c14], %c238821326_i64 : tensor<?xi64>, vector<i64>
        %137 = math.ipowi %15, %15 : tensor<10x16xi16>
        %138 = arith.minui %c-21738_i16, %c-21738_i16 : i16
        %139 = vector.insertelement %cst_1, %131[%c31 : index] : vector<16xf16>
        tensor.yield %cst : f32
      } : tensor<?x16xf32>
      affine.store %cst_1, %alloc_13[%c2, %c19] : memref<?x17xf16>
      memref.alloca_scope  {
        affine.store %cst_0, %alloc_2[%c21] : memref<?xf32>
        %136 = math.roundeven %14 : tensor<16x17xf16>
        %137 = math.log10 %7 : tensor<?x17xf16>
        memref.copy %alloc_9, %alloc_4 : memref<17x16x17xi32> to memref<17x16x17xi32>
        %inserted_25 = tensor.insert %c10976_i16 into %15[%c9, %c7] : tensor<10x16xi16>
        %false_26 = index.bool.constant false
        %138 = index.divs %c8, %c3
        %splat = tensor.splat %c329904959_i64 : tensor<10x16xi64>
        affine.vector_store %131, %alloc_6[%c22, %c14, %c28] : memref<?x?x17xf16>, vector<16xf16>
        vector.print %131 : vector<16xf16>
        %alloca_27 = memref.alloca() : memref<16x17xi1>
        %expanded = tensor.expand_shape %10 [[0], [1, 2]] : tensor<16x17xi64> into tensor<16x17x1xi64>
        %139 = vector.insert %cst_1, %131 [1] : f16 into vector<16xf16>
        %140 = index.shrs %c6, %c7
        %141 = vector.broadcast %c-5165_i16 : i16 to vector<i16>
        %142 = vector.transfer_write %141, %12[%c17, %c29, %c1] : vector<i16>, tensor<17x16x17xi16>
        %143 = index.maxu %c30, %c6
        %alloc_28 = memref.alloc(%c18) : memref<?xf16>
        memref.tensor_store %13, %alloc_28 : memref<?xf16>
        %144 = tensor.empty() : tensor<16x17x16xi1>
        %broadcasted = linalg.broadcast ins(%alloc_5 : memref<16x17xi1>) outs(%144 : tensor<16x17x16xi1>) dimensions = [2] 
        %alloc_29 = memref.alloc() : memref<10x16xi32>
        memref.tensor_store %2, %alloc_29 : memref<10x16xi32>
        %145 = affine.vector_load %alloc_7[%c5, %c4] : memref<10x16xi1>, vector<11xi1>
        %146 = math.exp %14 : tensor<16x17xf16>
        %147 = math.log2 %14 : tensor<16x17xf16>
        %148 = index.xor %c22, %c6
        %149 = math.ctpop %2 : tensor<10x16xi32>
        %150 = arith.xori %false_26, %false_26 : i1
        %cst_30 = arith.constant 0.000000e+00 : f16
        %151 = vector.transfer_read %alloc_10[%c27, %c0], %cst_30 : memref<16x17xf16>, vector<f16>
        %152 = arith.ori %c527088365_i32, %c1321462035_i32 : i32
        %153 = index.casts %c15 : index to i32
        %154 = math.fpowi %cst, %c527088365_i32 : f32, i32
        %alloca_31 = memref.alloca(%c29, %143) : memref<?x?xi32>
        %155 = vector.insertelement %cst_1, %133[%c11 : index] : vector<1xf16>
        %c1387038074_i64 = arith.constant 1387038074 : i64
      }
      %135 = arith.divui %c238821326_i64, %c238821326_i64 : i64
      %alloca_24 = memref.alloca(%c12, %c11, %c15) : memref<?x?x?xi64>
      scf.yield
    }
    case 3 {
      %cst_20 = arith.constant 0.000000e+00 : f32
      %129 = vector.transfer_read %alloc[%c7, %c15], %cst_20 : memref<?x16xf32>, vector<f32>
      %130 = math.ctpop %arg0 : i64
      %131 = index.castu %c22 : index to i32
      %132 = arith.divui %arg0, %c238821326_i64 : i64
      %133 = arith.cmpf une, %cst, %cst : f32
      %134 = vector.broadcast %cst_1 : f16 to vector<1xf16>
      %135 = vector.broadcast %cst_1 : f16 to vector<1xf16>
      %136 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minf>} %134, %135, %cst_1 : vector<1xf16>, vector<1xf16> into f16
      %137 = index.shl %c20, %c26
      %138 = bufferization.clone %alloc_5 : memref<16x17xi1> to memref<16x17xi1>
      %139 = math.sqrt %1 : tensor<16x17xf32>
      %alloc_21 = memref.alloc(%c13, %c12) : memref<17x?x?xi32>
      linalg.transpose ins(%alloc_8 : memref<?x?x17xi32>) outs(%alloc_21 : memref<17x?x?xi32>) permutation = [2, 0, 1] 
      %140 = index.shru %c9, %c0
      %141 = vector.splat %false : vector<17xi1>
      %142 = arith.addi %c527088365_i32, %c527088365_i32 : i32
      %143 = vector.insertelement %cst_1, %134[%c10 : index] : vector<1xf16>
      %false_22 = index.bool.constant false
      %144 = tensor.empty() : tensor<i32>
      %145 = linalg.dot ins(%8, %8 : tensor<17xi32>, tensor<17xi32>) outs(%144 : tensor<i32>) -> tensor<i32>
      scf.yield
    }
    default {
      memref.copy %alloc_13, %alloc_13 : memref<?x17xf16> to memref<?x17xf16>
      affine.parallel (%arg1) = (0) to (16) {
        %148 = math.cos %3 : tensor<?x16xf16>
      }
      %129 = math.tanh %3 : tensor<?x16xf16>
      %130 = vector.broadcast %cst : f32 to vector<f32>
      %131 = vector.insertelement %cst, %130[] : vector<f32>
      %132 = arith.negf %cst : f32
      %133 = math.log2 %11 : tensor<17xf16>
      %134 = arith.shrsi %c-5165_i16, %c-5165_i16 : i16
      %135 = vector.broadcast %c10976_i16 : i16 to vector<1xi16>
      %136 = vector.broadcast %c-5165_i16 : i16 to vector<1xi16>
      %137 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<add>} %135, %136, %c10976_i16 : vector<1xi16>, vector<1xi16> into i16
      %138 = arith.muli %arg0, %c329904959_i64 : i64
      %139 = index.mul %c29, %c10
      %140 = arith.addf %cst_1, %cst_1 : f16
      scf.execute_region {
        %148 = arith.shrsi %c990472205_i64, %arg0 : i64
        %149 = math.log10 %7 : tensor<?x17xf16>
        %150 = vector.insertelement %c-21738_i16, %135[%c8 : index] : vector<1xi16>
        affine.vector_store %135, %alloc_3[%c22] : memref<17xi16>, vector<1xi16>
        %c-11714_i16 = arith.constant -11714 : i16
        %151 = vector.transfer_read %6[%c0, %c9], %arg0 : tensor<?x17xi64>, vector<11xi64>
        %inserted_20 = tensor.insert %cst_1 into %3[%c0, %c8] : tensor<?x16xf16>
        %152 = math.log2 %11 : tensor<17xf16>
        %153 = vector.splat %c238821326_i64 : vector<16x17xi64>
        %154 = vector.broadcast %c-5165_i16 : i16 to vector<17x16x17xi16>
        %155 = vector.broadcast %c-21738_i16 : i16 to vector<16x17xi16>
        %156 = vector.multi_reduction <maxui>, %154, %155 [0] : vector<17x16x17xi16> to vector<16x17xi16>
        %157 = affine.min affine_map<(d0, d1) -> (d0)>(%c12, %c24)
        %158 = index.castu %c527088365_i32 : i32 to index
        %splat = tensor.splat %c527088365_i32 : tensor<16x17xi32>
        %159 = math.exp2 %4 : tensor<?xf16>
        affine.store %cst, %alloc_12[%c3, %c23] : memref<?x16xf32>
        scf.yield
      }
      %141 = tensor.empty(%c15) : tensor<?x17xi64>
      %mapped = linalg.map ins(%6, %6 : tensor<?x17xi64>, tensor<?x17xi64>) outs(%141 : tensor<?x17xi64>)
        (%in: i64, %in_20: i64) {
          %148 = math.log10 %7 : tensor<?x17xf16>
          %149 = math.ctpop %15 : tensor<10x16xi16>
          %150 = affine.max affine_map<(d0, d1)[s0] -> ((d0 ceildiv 4) floordiv 64)>(%c16, %c12)[%c12]
          %151 = math.log1p %11 : tensor<17xf16>
          %152 = index.ceildivs %c29, %c18
          %153 = arith.shrui %c990472205_i64, %c238821326_i64 : i64
          %154 = vector.bitcast %135 : vector<1xi16> to vector<1xi16>
          %true_21 = index.bool.constant true
          %155 = arith.minsi %c990472205_i64, %c238821326_i64 : i64
          %156 = arith.divui %c329904959_i64, %c329904959_i64 : i64
          %157 = affine.max affine_map<(d0) -> ((-d0) mod 16)>(%c28)
          %158 = affine.vector_load %alloc_15[%c16, %c27, %c4] : memref<17x16x17xi32>, vector<17xi32>
          %159 = arith.remf %cst_1, %cst_1 : f16
          %160 = arith.cmpf ole, %cst_0, %cst : f32
          %161 = vector.broadcast %c-5165_i16 : i16 to vector<10x16xi16>
          %162 = affine.vector_load %alloc_9[%c8, %c7, %c7] : memref<17x16x17xi32>, vector<11xi32>
          %163 = arith.shli %c1321462035_i32, %c527088365_i32 : i32
          %164 = vector.broadcast %cst : f32 to vector<17xf32>
          %165 = vector.fma %164, %164, %164 : vector<17xf32>
          %166 = index.mul %139, %c13
          %167 = vector.transfer_read %alloc_15[%c6, %c15, %c24], %c527088365_i32 : memref<17x16x17xi32>, vector<16xi32>
          %168 = affine.min affine_map<(d0) -> ((((d0 - 4) ceildiv 16 + (d0 - 4) floordiv 64) mod 2) ceildiv 16)>(%c23)
          %169 = math.fpowi %cst_1, %c1511750638_i32 : f16, i32
          %170 = tensor.empty() : tensor<10x16xi16>
          %171 = math.log10 %13 : tensor<?xf16>
          %172 = index.or %c23, %c6
          %173 = vector.load %alloc_4[%c2, %c5, %c12] : memref<17x16x17xi32>, vector<17xi32>
          %174 = vector.load %alloc_15[%c13, %c12, %c11] : memref<17x16x17xi32>, vector<10x16xi32>
          %175 = index.divu %c18, %c27
          %176 = index.xor %c19, %c22
          %177 = index.shru %c31, %172
          memref.copy %alloc_16, %alloc_16 : memref<?x?xf16> to memref<?x?xf16>
          %178 = vector.broadcast %c383367506_i32 : i32 to vector<i32>
          %179 = vector.transfer_write %178, %8[%c29] : vector<i32>, tensor<17xi32>
          linalg.yield %arg0 : i64
        }
      %142 = arith.ori %c990472205_i64, %c329904959_i64 : i64
      %143 = tensor.empty() : tensor<10x11xf16>
      %144 = tensor.empty() : tensor<f16>
      %145 = tensor.empty() : tensor<10xf16>
      %146 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> ()>, affine_map<(d0, d1) -> ()>, affine_map<(d0, d1) -> ()>, affine_map<(d0, d1) -> (d0)>], iterator_types = ["parallel", "reduction"]} ins(%143, %144, %144, %144 : tensor<10x11xf16>, tensor<f16>, tensor<f16>, tensor<f16>) outs(%145 : tensor<10xf16>) {
      ^bb0(%in: f16, %in_20: f16, %in_21: f16, %in_22: f16, %out: f16):
        %148 = vector.insert %c10976_i16, %135 [0] : i16 into vector<1xi16>
        linalg.yield %in_22 : f16
      } -> tensor<10xf16>
      %147 = vector.bitcast %135 : vector<1xi16> to vector<1xi16>
    }
    %16 = spirv.CL.s_abs %c990472205_i64 : i64
    %17 = vector.broadcast %c383367506_i32 : i32 to vector<11xi32>
    affine.vector_store %17, %alloc_8[%c2, %c0, %c2] : memref<?x?x17xi32>, vector<11xi32>
    %18 = arith.remui %c1321462035_i32, %c527088365_i32 : i32
    %19 = spirv.GL.Round %cst : f32
    %20 = vector.broadcast %c1321462035_i32 : i32 to vector<2xi32>
    %21 = spirv.BitwiseOr %20, %20 : vector<2xi32>
    %22 = arith.addf %cst_1, %cst_1 : f16
    %23 = index.xor %c25, %c4
    %24 = bufferization.clone %alloc_3 : memref<17xi16> to memref<17xi16>
    %25 = arith.addf %cst_0, %cst : f32
    %26 = arith.divf %cst_1, %cst_1 : f16
    %27 = arith.ori %16, %arg0 : i64
    %28 = index.sizeof
    %from_elements = tensor.from_elements %16, %c990472205_i64, %c238821326_i64, %c453217699_i64, %c329904959_i64, %c329904959_i64, %arg0, %c990472205_i64, %c453217699_i64, %c990472205_i64, %c329904959_i64, %c238821326_i64, %arg0, %arg0, %c329904959_i64, %c990472205_i64, %16 : tensor<17xi64>
    affine.store %c-5165_i16, %24[%c26] : memref<17xi16>
    %29 = spirv.GL.Cos %cst_1 : f16
    %from_elements_17 = tensor.from_elements %true, %true, %false, %true, %true, %false, %true, %false, %true, %true, %true, %false, %false, %true, %false, %true, %false, %true, %true, %false, %false, %true, %true, %false, %true, %true, %true, %false, %true, %true, %false, %false, %false, %false, %true, %false, %false, %false, %false, %true, %false, %true, %true, %true, %false, %false, %true, %true, %true, %false, %true, %false, %true, %true, %false, %true, %false, %true, %false, %false, %true, %false, %true, %false, %false, %true, %false, %false, %false, %true, %true, %false, %false, %false, %false, %false, %true, %false, %true, %false, %false, %true, %true, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %true, %true, %true, %true, %false, %true, %false, %false, %false, %false, %true, %false, %true, %true, %false, %false, %true, %true, %false, %true, %true, %false, %false, %false, %true, %false, %false, %false, %true, %false, %true, %false, %false, %true, %false, %false, %true, %true, %true, %false, %false, %true, %true, %true, %false, %true, %false, %true, %false, %true, %false, %true, %false, %true, %true, %false, %true, %true, %true, %false, %true, %false, %false, %false, %false, %true, %true, %true, %false, %true, %false, %false, %true, %true, %false, %true, %false, %false, %true, %true, %false, %true, %false, %true, %true, %true, %false, %true, %true, %false, %false, %false, %true, %false, %true, %true, %true, %true, %false, %true, %true, %true, %false, %true, %true, %false, %false, %false, %false, %true, %true, %true, %true, %true, %true, %false, %false, %false, %false, %true, %false, %true, %true, %false, %true, %false, %false, %true, %true, %true, %true, %false, %false, %true, %true, %false, %true, %false, %false, %true, %true, %false, %true, %false, %true, %false, %false, %true, %true, %false, %false, %false, %true, %true, %false, %true, %false, %true, %true, %true, %false, %false, %false, %false, %true, %true, %true, %false, %true, %false, %true, %true, %true, %true, %false, %true, %true, %false, %false : tensor<16x17xi1>
    %30 = spirv.CL.fma %cst, %19, %cst_0 : f32
    %31 = vector.shuffle %17, %17 [2, 3, 4, 5, 6, 9, 12, 16, 18, 19, 20, 21] : vector<11xi32>, vector<11xi32>
    %32 = index.shrs %c28, %c22
    scf.parallel (%arg1, %arg2) = (%c10, %c22) to (%c5, %c24) step (%c21, %c5) {
      %129 = affine.min affine_map<(d0) -> (d0 + d0 + 2)>(%c0)
      %130 = index.floordivs %c28, %c5
      %131 = vector.reduction <maxsi>, %20 : vector<2xi32> into i32
      %132 = vector.broadcast %cst_1 : f16 to vector<10xf16>
      %133 = vector.transfer_write %132, %7[%23, %c10] {permutation_map = affine_map<(d0, d1) -> (d0)>} : vector<10xf16>, tensor<?x17xf16>
      affine.store %c1321462035_i32, %alloc_15[%c22, %c12, %c28] : memref<17x16x17xi32>
      %134 = index.xor %23, %c6
      %135 = math.ctpop %9 : tensor<?x16xi32>
      %136 = vector.insertelement %c527088365_i32, %17[%c7 : index] : vector<11xi32>
      %137 = arith.remf %cst_0, %19 : f32
      %138 = arith.andi %c383367506_i32, %c1321462035_i32 : i32
      %139 = scf.parallel (%arg3) = (%23) to (%c5) step (%c12) init (%7) -> tensor<?x17xf16> {
        %144 = index.add %c12, %c10
        %145 = bufferization.clone %alloc_7 : memref<10x16xi1> to memref<10x16xi1>
        %146 = vector.broadcast %c7 : index to vector<17xindex>
        %147 = vector.broadcast %true : i1 to vector<17xi1>
        %148 = vector.broadcast %19 : f32 to vector<17xf32>
        vector.scatter %alloc_2[%c0] [%146], %147, %148 : memref<?xf32>, vector<17xindex>, vector<17xi1>, vector<17xf32>
        %splat = tensor.splat %c1321462035_i32 : tensor<16x17xi32>
        %149 = index.sub %arg3, %c2
        %150 = arith.ori %c-21738_i16, %c-21738_i16 : i16
        %151 = math.log1p %29 : f16
        %152 = arith.shrui %c238821326_i64, %16 : i64
        %153 = index.add %c21, %c28
        %154 = index.or %c30, %c6
        %155 = bufferization.clone %alloc_3 : memref<17xi16> to memref<17xi16>
        %156 = memref.load %alloc_16[%c0, %c0] : memref<?x?xf16>
        %157 = arith.cmpf one, %cst_0, %cst_0 : f32
        %158 = arith.shrui %c1321462035_i32, %c1321462035_i32 : i32
        %159 = math.exp %7 : tensor<?x17xf16>
        %160 = arith.remf %cst_1, %29 : f16
        scf.reduce(%7)  : tensor<?x17xf16> {
        ^bb0(%arg4: tensor<?x17xf16>, %arg5: tensor<?x17xf16>):
          %161 = math.fpowi %14, %splat : tensor<16x17xf16>, tensor<16x17xi32>
          %expanded = tensor.expand_shape %arg4 [[0], [1, 2]] : tensor<?x17xf16> into tensor<?x17x1xf16>
          %162 = vector.broadcast %c24 : index to vector<11xindex>
          %163 = vector.broadcast %true : i1 to vector<11xi1>
          %164 = vector.broadcast %c-5165_i16 : i16 to vector<11xi16>
          vector.scatter %155[%c15] [%162], %163, %164 : memref<17xi16>, vector<11xindex>, vector<11xi1>, vector<11xi16>
          %165 = arith.remf %30, %30 : f32
          %166 = arith.xori %arg0, %c990472205_i64 : i64
          %alloc_21 = memref.alloc() : memref<10x16xf16>
          %167 = vector.broadcast %29 : f16 to vector<17xf16>
          %168 = vector.broadcast %false : i1 to vector<17xi1>
          %169 = vector.broadcast %c1321462035_i32 : i32 to vector<17xi32>
          %170 = vector.gather %alloc_21[%c2, %c26] [%169], %168, %167 : memref<10x16xf16>, vector<17xi32>, vector<17xi1>, vector<17xf16> into vector<17xf16>
          %171 = affine.max affine_map<(d0, d1)[s0] -> (d1 + d0 - 16)>(%arg2, %c28)[%153]
          %172 = bufferization.clone %alloc_15 : memref<17x16x17xi32> to memref<17x16x17xi32>
          scf.reduce.return %7 : tensor<?x17xf16>
        }
        scf.yield
      }
      %140 = affine.vector_load %alloc[%c30, %c0] : memref<?x16xf32>, vector<11xf32>
      %141 = tensor.empty() : tensor<272xi64>
      %unpack_20 = tensor.unpack %10 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [%c17] into %141 : tensor<16x17xi64> -> tensor<272xi64>
      memref.copy %alloc_7, %alloc_7 : memref<10x16xi1> to memref<10x16xi1>
      %142 = math.tan %4 : tensor<?xf16>
      %143 = arith.remf %19, %30 : f32
      scf.yield
    }
    %33 = math.rsqrt %14 : tensor<16x17xf16>
    %34 = scf.while (%arg1 = %cst_0) : (f32) -> f32 {
      %129 = index.and %c3, %c7
      %130 = arith.addi %c-21738_i16, %c10976_i16 : i16
      %alloc_20 = memref.alloc() : memref<10x16xi16>
      %extracted_21 = tensor.extract %2[%c5, %c11] : tensor<10x16xi32>
      %131 = affine.min affine_map<(d0) -> (d0 + d0 + 2)>(%c8)
      %132 = tensor.empty(%c14) : tensor<?x10xf16>
      %broadcasted = linalg.broadcast ins(%13 : tensor<?xf16>) outs(%132 : tensor<?x10xf16>) dimensions = [1] 
      %133 = scf.if %false -> (memref<16x17xf16>) {
        %135 = arith.andi %c-5165_i16, %c-5165_i16 : i16
        affine.vector_store %17, %alloc_9[%c31, %c30, %c26] : memref<17x16x17xi32>, vector<11xi32>
        %136 = math.absf %4 : tensor<?xf16>
        %137 = math.ctlz %9 : tensor<?x16xi32>
        %extracted_22 = tensor.extract %13[%c0] : tensor<?xf16>
        %138 = vector.insert %c1511750638_i32, %20 [1] : i32 into vector<2xi32>
        %139 = vector.broadcast %cst_1 : f16 to vector<16x17xf16>
        %140 = math.powf %cst_1, %29 : f16
        scf.yield %alloc_10 : memref<16x17xf16>
      } else {
        %135 = math.roundeven %14 : tensor<16x17xf16>
        %136 = index.maxu %c18, %c5
        %137 = affine.min affine_map<(d0, d1, d2, d3)[s0] -> ((d3 - 1) mod 16 + 2)>(%c20, %c1, %32, %c22)[%c20]
        %138 = math.ctpop %c329904959_i64 : i64
        %139 = bufferization.clone %alloc_5 : memref<16x17xi1> to memref<16x17xi1>
        %140 = vector.insert %c527088365_i32, %20 [0] : i32 into vector<2xi32>
        %141 = index.or %c23, %137
        %142 = math.roundeven %cst : f32
        scf.yield %alloc_10 : memref<16x17xf16>
      }
      %134 = vector.splat %c14 : vector<17xindex>
      scf.condition(%false) %cst : f32
    } do {
    ^bb0(%arg1: f32):
      affine.store %cst_1, %alloc_13[%c21, %c24] : memref<?x17xf16>
      %129 = math.cos %cst_0 : f32
      %130 = index.or %c21, %c17
      %131 = index.divs %c2, %c29
      %dim = tensor.dim %0, %c0 : tensor<16x17xi32>
      %132 = index.maxs %c3, %c3
      %133 = arith.xori %arg0, %c238821326_i64 : i64
      %134 = index.mul %32, %c15
      %135 = affine.apply affine_map<(d0) -> (d0 + d0 + 2)>(%c13)
      %136 = math.tanh %7 : tensor<?x17xf16>
      %137 = tensor.empty(%c27) : tensor<17x16x?xi16>
      %138 = scf.while (%arg2 = %2) : (tensor<10x16xi32>) -> tensor<10x16xi32> {
        %142 = math.ctlz %16 : i64
        %143 = math.sqrt %14 : tensor<16x17xf16>
        %144 = arith.addf %cst_0, %30 : f32
        %145 = vector.insertelement %c383367506_i32, %17[%c17 : index] : vector<11xi32>
        %146 = memref.load %alloc_8[%c0, %c0, %c12] : memref<?x?x17xi32>
        %147 = math.exp2 %13 : tensor<?xf16>
        %148 = arith.shrsi %c1511750638_i32, %c1321462035_i32 : i32
        %149 = math.roundeven %14 : tensor<16x17xf16>
        scf.condition(%false) %arg2 : tensor<10x16xi32>
      } do {
      ^bb0(%arg2: tensor<10x16xi32>):
        %142 = arith.addf %arg1, %30 : f32
        %143 = index.sizeof
        %144 = index.or %c27, %c26
        %145 = vector.insertelement %c383367506_i32, %20[%c15 : index] : vector<2xi32>
        %146 = bufferization.clone %alloc_3 : memref<17xi16> to memref<17xi16>
        %147 = math.roundeven %1 : tensor<16x17xf32>
        %148 = affine.apply affine_map<(d0, d1)[s0] -> ((d0 ceildiv 4) floordiv 64)>(%c28, %c18)[%c19]
        %149 = math.rsqrt %cst_1 : f16
        %150 = affine.vector_load %alloc[%c31, %c8] : memref<?x16xf32>, vector<16xf32>
        %extracted_20 = tensor.extract %from_elements[%c4] : tensor<17xi64>
        %151 = arith.ceildivsi %extracted_20, %16 : i64
        %152 = vector.multi_reduction <minui>, %20, %c1321462035_i32 [0] : vector<2xi32> to i32
        %153 = math.exp %1 : tensor<16x17xf32>
        %expanded = tensor.expand_shape %6 [[0], [1, 2]] : tensor<?x17xi64> into tensor<?x17x1xi64>
        %154 = index.xor %130, %131
        %155 = index.shrs %c10, %c18
        scf.yield %2 : tensor<10x16xi32>
      }
      %139 = vector.splat %c29 : vector<16x17xindex>
      %140 = arith.minsi %c383367506_i32, %c1511750638_i32 : i32
      %splat = tensor.splat %c10976_i16 : tensor<10x16xi16>
      %141 = arith.shrsi %c527088365_i32, %c383367506_i32 : i32
      scf.yield %arg1 : f32
    }
    %35 = spirv.BitFieldUExtract %20, %16, %c527088365_i32 : vector<2xi32>, i64, i32
    %36 = spirv.GL.FAbs %29 : f16
    %37 = index.xor %c28, %c31
    %38 = vector.splat %cst_0 : vector<16x17xf32>
    %extracted = tensor.extract %5[%c0, %c9, %c1] : tensor<?x16x17xi16>
    %39 = spirv.CL.fabs %29 : f16
    %40 = affine.min affine_map<(d0) -> (d0 + d0 + 2)>(%c1)
    %41 = index.sub %c10, %c13
    %42 = math.powf %30, %cst_0 : f32
    %43 = spirv.GL.InverseSqrt %30 : f32
    %44 = spirv.CL.rint %29 : f16
    %45 = math.exp2 %3 : tensor<?x16xf16>
    %46 = math.log2 %11 : tensor<17xf16>
    %47 = math.ceil %11 : tensor<17xf16>
    %48 = scf.execute_region -> i32 {
      %129 = math.fpowi %1, %0 : tensor<16x17xf32>, tensor<16x17xi32>
      %130 = affine.min affine_map<(d0) -> ((-d0) mod 16)>(%c3)
      %131 = index.casts %c4 : index to i32
      %132 = math.cos %cst_0 : f32
      %133 = memref.alloca_scope  -> (tensor<?xf16>) {
        %143 = vector.bitcast %20 : vector<2xi32> to vector<2xi32>
        %144 = math.ctpop %6 : tensor<?x17xi64>
        %145 = vector.broadcast %44 : f16 to vector<11xf16>
        %146 = vector.transfer_write %145, %3[%c4, %c4] {permutation_map = affine_map<(d0, d1) -> (d0)>} : vector<11xf16>, tensor<?x16xf16>
        memref.assume_alignment %alloc_2, 8 : memref<?xf32>
        %147 = math.tan %14 : tensor<16x17xf16>
        %148 = arith.shli %arg0, %c990472205_i64 : i64
        %149 = math.atan2 %cst_1, %39 : f16
        %150 = vector.insertelement %39, %145[%41 : index] : vector<11xf16>
        %151 = index.shrs %c2, %c27
        %152 = memref.atomic_rmw addi %c-21738_i16, %24[%c10] : (i16, memref<17xi16>) -> i16
        %false_21 = index.bool.constant false
        %153 = arith.shrsi %c527088365_i32, %c1511750638_i32 : i32
        %154 = linalg.copy ins(%15 : tensor<10x16xi16>) outs(%15 : tensor<10x16xi16>) -> tensor<10x16xi16>
        %155 = index.divs %32, %41
        %156 = arith.negf %39 : f16
        %157 = math.tanh %7 : tensor<?x17xf16>
        %dim = tensor.dim %0, %c0 : tensor<16x17xi32>
        %158 = memref.load %alloc_11[%c2, %c15, %c11] : memref<17x16x17xf16>
        %false_22 = arith.constant false
        %159 = index.maxu %c10, %151
        %alloc_23 = memref.alloc() : memref<10x16xi1>
        %160 = affine.vector_load %24[%c0] : memref<17xi16>, vector<17xi16>
        %161 = arith.minsi %c10976_i16, %c-5165_i16 : i16
        %162 = index.mul %c25, %c4
        %163 = vector.insertelement %44, %145[%c8 : index] : vector<11xf16>
        %164 = index.casts %37 : index to i32
        %165 = affine.vector_load %alloc_4[%c30, %23, %c15] : memref<17x16x17xi32>, vector<16xi32>
        %166 = math.fpowi %1, %0 : tensor<16x17xf32>, tensor<16x17xi32>
        %167 = arith.addi %c-21738_i16, %extracted : i16
        vector.print %145 : vector<11xf16>
        %168 = math.cos %29 : f16
        %169 = arith.shrsi %c990472205_i64, %c453217699_i64 : i64
        memref.alloca_scope.return %13 : tensor<?xf16>
      }
      %134 = index.xor %c13, %c19
      %135 = arith.divui %c383367506_i32, %c1321462035_i32 : i32
      %136 = index.and %c31, %c29
      %137 = affine.min affine_map<(d0, d1, d2, d3) -> (d2)>(%c22, %c16, %c25, %c6)
      %138 = arith.remf %44, %29 : f16
      %139 = math.tan %43 : f32
      %expanded = tensor.expand_shape %14 [[0], [1, 2]] : tensor<16x17xf16> into tensor<16x17x1xf16>
      %140 = math.fpowi %14, %0 : tensor<16x17xf16>, tensor<16x17xi32>
      %collapsed = tensor.collapse_shape %3 [[0, 1]] : tensor<?x16xf16> into tensor<?xf16>
      %cst_20 = arith.constant 0.000000e+00 : f16
      %141 = vector.transfer_read %alloc_16[%c7, %c30], %cst_20 {permutation_map = affine_map<(d0, d1) -> (d0)>} : memref<?x?xf16>, vector<16xf16>
      %142 = scf.execute_region -> memref<10x16xi64> {
        %143 = index.castu %130 : index to i32
        %144 = vector.insert %c527088365_i32, %17 [4] : i32 into vector<11xi32>
        %145 = index.and %c3, %130
        %collapsed_21 = tensor.collapse_shape %2 [[0, 1]] : tensor<10x16xi32> into tensor<160xi32>
        %146 = math.exp2 %19 : f32
        %rank = tensor.rank %1 : tensor<16x17xf32>
        %147 = vector.broadcast %30 : f32 to vector<17x16x17xf32>
        %148 = vector.fma %147, %147, %147 : vector<17x16x17xf32>
        %c6823_i16 = arith.constant 6823 : i16
        %alloc_22 = memref.alloc() : memref<16x17xi32>
        memref.tensor_store %0, %alloc_22 : memref<16x17xi32>
        %149 = math.fma %29, %36, %39 : f16
        %alloc_23 = memref.alloc(%c3) : memref<16x?xf16>
        linalg.transpose ins(%3 : tensor<?x16xf16>) outs(%alloc_23 : memref<16x?xf16>) permutation = [1, 0] 
        %150 = math.cos %133 : tensor<?xf16>
        %151 = math.tan %collapsed : tensor<?xf16>
        %152 = index.castu %c19 : index to i32
        %153 = arith.remf %43, %cst : f32
        %154 = arith.shrui %16, %c238821326_i64 : i64
        %alloc_24 = memref.alloc() : memref<10x16xi64>
        scf.yield %alloc_24 : memref<10x16xi64>
      }
      scf.yield %c527088365_i32 : i32
    }
    memref.copy %alloc_15, %alloc_9 : memref<17x16x17xi32> to memref<17x16x17xi32>
    %49 = arith.remui %c1321462035_i32, %c527088365_i32 : i32
    %50 = spirv.CL.sqrt %44 : f16
    %51 = spirv.CL.fmin %19, %43 : f32
    %52 = spirv.CL.sqrt %30 : f32
    %53 = spirv.CL.s_max %c1321462035_i32, %48 : i32
    %54 = index.floordivs %c6, %c4
    %55 = spirv.BitwiseOr %20, %20 : vector<2xi32>
    %56 = math.exp2 %14 : tensor<16x17xf16>
    %alloc_18 = memref.alloc(%c1, %c2) : memref<?x?x17xi64>
    %57 = spirv.LogicalAnd %true, %false : i1
    %58 = index.shl %c25, %c31
    %59 = math.tanh %52 : f32
    %60 = index.sub %c14, %c20
    %61 = math.cttz %arg0 : i64
    %62 = spirv.FOrdEqual %30, %cst_0 : f32
    %63 = tensor.empty() : tensor<272xf32>
    %unpack = tensor.unpack %1 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [%c17] into %63 : tensor<16x17xf32> -> tensor<272xf32>
    %64 = spirv.CL.s_min %c-21738_i16, %extracted : i16
    affine.vector_store %17, %alloc_8[%c25, %c2, %c25] : memref<?x?x17xi32>, vector<11xi32>
    %65 = spirv.CL.sin %39 : f16
    %66 = arith.negf %44 : f16
    %67 = vector.bitcast %17 : vector<11xi32> to vector<11xi32>
    memref.alloca_scope  {
      %129 = vector.insertelement %53, %67[%c26 : index] : vector<11xi32>
      %130 = vector.multi_reduction <minui>, %20, %c1511750638_i32 [0] : vector<2xi32> to i32
      %131 = index.casts %130 : i32 to index
      %132 = math.roundeven %30 : f32
      %133 = vector.insert %c527088365_i32, %17 [6] : i32 into vector<11xi32>
      %134 = math.atan %39 : f16
      %135 = index.floordivs %54, %c27
      %136 = math.atan2 %14, %14 : tensor<16x17xf16>
      %137 = linalg.copy ins(%15 : tensor<10x16xi16>) outs(%15 : tensor<10x16xi16>) -> tensor<10x16xi16>
      %138 = tensor.empty() : tensor<272xi1>
      %unpack_20 = tensor.unpack %from_elements_17 outer_dims_perm = [0] inner_dims_pos = [0] inner_tiles = [%c17] into %138 : tensor<16x17xi1> -> tensor<272xi1>
      %139 = math.absi %c329904959_i64 : i64
      %140 = index.casts %c9 : index to i32
      %141 = memref.load %alloc_12[%c0, %c0] : memref<?x16xf32>
      %alloc_21 = memref.alloc(%c31, %c31) : memref<?x?xf16>
      %142 = math.fpowi %39, %48 : f16, i32
      %143 = arith.negf %52 : f32
      %144 = tensor.empty() : tensor<272x16xi1>
      %broadcasted = linalg.broadcast ins(%138 : tensor<272xi1>) outs(%144 : tensor<272x16xi1>) dimensions = [1] 
      %145 = arith.minui %c1321462035_i32, %c1511750638_i32 : i32
      %146 = math.roundeven %19 : f32
      %147 = affine.apply affine_map<(d0, d1)[s0] -> ((d0 ceildiv 4) floordiv 64)>(%c5, %54)[%60]
      memref.assume_alignment %alloc_4, 8 : memref<17x16x17xi32>
      %148 = vector.splat %c27 : vector<17xindex>
      %alloc_22 = memref.alloc(%c4) : memref<?xf16>
      %149 = vector.matrix_multiply %17, %67 {lhs_columns = 11 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<11xi32>, vector<11xi32>) -> vector<1xi32>
      %150 = arith.negf %44 : f16
      %inserted_23 = tensor.insert %44 into %14[%c15, %c14] : tensor<16x17xf16>
      %151 = vector.bitcast %67 : vector<11xi32> to vector<11xi32>
      %152 = index.casts %c0 : index to i32
      %alloca = memref.alloca(%c23) : memref<?xf16>
      %153 = math.absi %138 : tensor<272xi1>
      %154 = arith.shli %c329904959_i64, %c990472205_i64 : i64
      %generated = tensor.generate %c19 {
      ^bb0(%arg1: index):
        %155 = arith.minsi %c329904959_i64, %c329904959_i64 : i64
        %156 = arith.remf %19, %30 : f32
        %cast = tensor.cast %14 : tensor<16x17xf16> to tensor<?x?xf16>
        affine.store %39, %alloc_11[%c14, %c12, %c12] : memref<17x16x17xf16>
        tensor.yield %130 : i32
      } : tensor<?xi32>
    }
    %68 = spirv.BitReverse %53 : i32
    %alloc_19 = memref.alloc() : memref<17xi32>
    memref.tensor_store %8, %alloc_19 : memref<17xi32>
    %69 = math.log2 %4 : tensor<?xf16>
    %70 = arith.andi %c990472205_i64, %16 : i64
    %71 = spirv.GL.Ldexp %52 : f32, %extracted : i16 -> f32
    %72 = spirv.FOrdLessThanEqual %52, %19 : f32
    vector.print %17 : vector<11xi32>
    %73 = spirv.CL.rsqrt %19 : f32
    %74 = arith.xori %57, %62 : i1
    %75 = spirv.CL.tanh %51 : f32
    %76 = arith.divui %c383367506_i32, %c1511750638_i32 : i32
    %77 = spirv.GL.FMix %cst_1 : f16, %36 : f16, %65 : f16 -> f16
    %78 = index.mul %c11, %c1
    %79 = index.or %c27, %c0
    scf.execute_region {
      %129 = arith.remui %false, %57 : i1
      %130 = index.xor %c27, %c0
      %131 = bufferization.to_tensor %alloc_6 : memref<?x?x17xf16>
      %132 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minsi>} %20, %20, %c527088365_i32 : vector<2xi32>, vector<2xi32> into i32
      %133 = math.fma %cst_1, %29, %39 : f16
      %134 = arith.remf %43, %30 : f32
      %135 = vector.broadcast %c383367506_i32 : i32 to vector<10xi32>
      %136 = vector.broadcast %true : i1 to vector<10xi1>
      %137 = vector.maskedload %alloc_15[%c15, %c3, %c12], %136, %135 : memref<17x16x17xi32>, vector<10xi1>, vector<10xi32> into vector<10xi32>
      %138 = math.roundeven %14 : tensor<16x17xf16>
      affine.store %30, %alloc[%c25, %c19] : memref<?x16xf32>
      %139 = scf.parallel (%arg1) = (%c19) to (%c24) step (%c18) init (%8) -> tensor<17xi32> {
        %144 = affine.max affine_map<(d0, d1)[s0] -> ((d0 ceildiv 4) floordiv 64)>(%c6, %c25)[%c8]
        %145 = arith.shli %c-21738_i16, %c-5165_i16 : i16
        %146 = index.sub %130, %c23
        %147 = vector.matrix_multiply %67, %137 {lhs_columns = 1 : i32, lhs_rows = 11 : i32, rhs_columns = 10 : i32} : (vector<11xi32>, vector<10xi32>) -> vector<110xi32>
        %148 = vector.transpose %147, [0] : vector<110xi32> to vector<110xi32>
        %149 = math.round %51 : f32
        %150 = memref.load %alloc_15[%c0, %c9, %c4] : memref<17x16x17xi32>
        %151 = math.ctpop %12 : tensor<17x16x17xi16>
        %alloc_21 = memref.alloc() : memref<10x16xi32>
        %152 = vector.broadcast %c527088365_i32 : i32 to vector<10x16xi32>
        %153 = vector.broadcast %57 : i1 to vector<10x16xi1>
        %154 = vector.gather %alloc_21[%c3, %40] [%152], %153, %152 : memref<10x16xi32>, vector<10x16xi32>, vector<10x16xi1>, vector<10x16xi32> into vector<10x16xi32>
        %extracted_22 = tensor.extract %12[%c4, %c10, %c0] : tensor<17x16x17xi16>
        %155 = vector.broadcast %39 : f16 to vector<17xf16>
        %156 = vector.broadcast %72 : i1 to vector<17xi1>
        %157 = vector.maskedload %alloc_13[%c0, %c2], %156, %155 : memref<?x17xf16>, vector<17xi1>, vector<17xf16> into vector<17xf16>
        %158 = vector.broadcast %44 : f16 to vector<16xf16>
        %159 = vector.broadcast %72 : i1 to vector<16xi1>
        %160 = vector.maskedload %alloc_13[%c0, %c6], %159, %158 : memref<?x17xf16>, vector<16xi1>, vector<16xf16> into vector<16xf16>
        %extracted_23 = tensor.extract %11[%c6] : tensor<17xf16>
        %161 = math.atan2 %14, %14 : tensor<16x17xf16>
        %162 = affine.max affine_map<(d0, d1)[s0] -> ((d0 ceildiv 4) floordiv 64)>(%c5, %c6)[%41]
        %163 = arith.negf %73 : f32
        scf.reduce(%8)  : tensor<17xi32> {
        ^bb0(%arg2: tensor<17xi32>, %arg3: tensor<17xi32>):
          %164 = index.shrs %c12, %arg1
          %165 = index.sizeof
          %rank = tensor.rank %15 : tensor<10x16xi16>
          %166 = math.ipowi %c-21738_i16, %extracted_22 : i16
          %167 = math.cos %19 : f32
          %168 = arith.shli %c1321462035_i32, %68 : i32
          %169 = memref.realloc %24 : memref<17xi16> to memref<16xi16>
          %170 = arith.xori %48, %c1321462035_i32 : i32
          scf.reduce.return %arg2 : tensor<17xi32>
        }
        scf.yield
      }
      %140 = index.sub %c2, %c27
      %141 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<add>} %136, %136, %62 : vector<10xi1>, vector<10xi1> into i1
      %142 = math.absf %19 : f32
      affine.store %64, %alloc_3[%c25] : memref<17xi16>
      %extracted_20 = tensor.extract %10[%c2, %c10] : tensor<16x17xi64>
      %143 = arith.negf %cst_0 : f32
      scf.yield
    }
    %80 = spirv.GL.InverseSqrt %43 : f32
    %81 = affine.vector_load %alloc[%c16, %23] : memref<?x16xf32>, vector<10xf32>
    %82 = arith.shli %c-21738_i16, %c10976_i16 : i16
    %83 = spirv.IsNan %19 : f32
    %84 = index.castu %c-21738_i16 : i16 to index
    %85 = spirv.CL.fmin %29, %39 : f16
    %86 = spirv.CL.sin %44 : f16
    %87 = index.casts %extracted : i16 to index
    %88 = spirv.IsNan %71 : f32
    %89 = spirv.SGreaterThan %53, %68 : i32
    %90 = spirv.GL.Cos %43 : f32
    %91 = index.shrs %c17, %c11
    %92 = spirv.CL.sin %39 : f16
    %93 = index.or %c3, %c15
    %94 = index.sizeof
    %95 = affine.apply affine_map<(d0) -> (d0 + d0 + 2)>(%78)
    %96 = bufferization.to_tensor %alloc_10 : memref<16x17xf16>
    %97 = spirv.IsInf %43 : f32
    %98 = arith.minsi %c329904959_i64, %c238821326_i64 : i64
    %99 = spirv.GL.FMix %39 : f16, %85 : f16, %92 : f16 -> f16
    %100 = spirv.LogicalOr %97, %89 : i1
    %101 = math.exp2 %11 : tensor<17xf16>
    %102 = spirv.CL.s_abs %20 : vector<2xi32>
    %103 = math.rsqrt %43 : f32
    %104 = spirv.CL.sin %51 : f32
    %105 = arith.addi %97, %62 : i1
    %106 = math.log1p %104 : f32
    %107 = spirv.BitwiseOr %20, %20 : vector<2xi32>
    %108 = spirv.LogicalNot %88 : i1
    memref.copy %alloc_8, %alloc_8 : memref<?x?x17xi32> to memref<?x?x17xi32>
    %109 = index.or %c7, %60
    %110 = vector.insert %68, %20 [0] : i32 into vector<2xi32>
    %111 = spirv.GL.Acos %30 : f32
    %inserted = tensor.insert %64 into %15[%c7, %c3] : tensor<10x16xi16>
    %112 = index.sub %c15, %c9
    %113 = spirv.CL.s_abs %c329904959_i64 : i64
    %114 = spirv.CL.tanh %92 : f16
    %115 = math.roundeven %cst_1 : f16
    %116 = spirv.CL.rsqrt %80 : f32
    %117 = memref.load %24[%c9] : memref<17xi16>
    %118 = vector.broadcast %arg0 : i64 to vector<17x16x17xi64>
    %119 = vector.broadcast %57 : i1 to vector<10xi1>
    vector.compressstore %alloc[%c0, %c0], %119, %81 : memref<?x16xf32>, vector<10xi1>, vector<10xf32>
    %120 = spirv.ULessThan %48, %c383367506_i32 : i32
    %121 = math.expm1 %92 : f16
    %122 = math.tanh %104 : f32
    %123 = math.cos %19 : f32
    %124 = spirv.CL.ceil %75 : f32
    affine.vector_store %17, %alloc_15[%c29, %79, %c19] : memref<17x16x17xi32>, vector<11xi32>
    %125 = spirv.GL.SMin %c453217699_i64, %c238821326_i64 : i64
    %126 = math.log2 %39 : f16
    %127 = spirv.GL.Acos %39 : f16
    %128 = math.exp2 %96 : tensor<16x17xf16>
    vector.print %17 : vector<11xi32>
    vector.print %20 : vector<2xi32>
    vector.print %67 : vector<11xi32>
    vector.print %81 : vector<10xf32>
    vector.print %118 : vector<17x16x17xi64>
    vector.print %arg0 : i64
    vector.print %c329904959_i64 : i64
    vector.print %true : i1
    vector.print %c527088365_i32 : i32
    vector.print %c238821326_i64 : i64
    vector.print %cst : f32
    vector.print %cst_0 : f32
    vector.print %c453217699_i64 : i64
    vector.print %c383367506_i32 : i32
    vector.print %c-21738_i16 : i16
    vector.print %false : i1
    vector.print %c1321462035_i32 : i32
    vector.print %c1511750638_i32 : i32
    vector.print %cst_1 : f16
    vector.print %c-5165_i16 : i16
    vector.print %c10976_i16 : i16
    vector.print %c990472205_i64 : i64
    vector.print %16 : i64
    vector.print %19 : f32
    vector.print %29 : f16
    vector.print %30 : f32
    vector.print %36 : f16
    vector.print %extracted : i16
    vector.print %39 : f16
    vector.print %43 : f32
    vector.print %44 : f16
    vector.print %48 : i32
    vector.print %50 : f16
    vector.print %51 : f32
    vector.print %52 : f32
    vector.print %53 : i32
    vector.print %57 : i1
    vector.print %62 : i1
    vector.print %64 : i16
    vector.print %65 : f16
    vector.print %68 : i32
    vector.print %71 : f32
    vector.print %72 : i1
    vector.print %73 : f32
    vector.print %75 : f32
    vector.print %77 : f16
    vector.print %80 : f32
    vector.print %83 : i1
    vector.print %85 : f16
    vector.print %86 : f16
    vector.print %88 : i1
    vector.print %89 : i1
    vector.print %90 : f32
    vector.print %92 : f16
    vector.print %97 : i1
    vector.print %99 : f16
    vector.print %100 : i1
    vector.print %104 : f32
    vector.print %108 : i1
    vector.print %111 : f32
    vector.print %113 : i64
    vector.print %114 : f16
    vector.print %116 : f32
    vector.print %120 : i1
    vector.print %124 : f32
    vector.print %125 : i64
    vector.print %127 : f16
    return
  }
