"builtin.module"() ({
  "func.func"() <{function_type = (index) -> (), sym_name = "func1", sym_visibility = "nested"}> ({
  ^bb0(%arg0: index):
    %0 = "arith.constant"() <{value = 1613826656 : i64}> : () -> i64
    %1 = "arith.constant"() <{value = 1.19497523E+9 : f32}> : () -> f32
    %2 = "arith.constant"() <{value = 0x4BC6523E : f32}> : () -> f32
    %3 = "arith.constant"() <{value = false}> : () -> i1
    %4 = "arith.constant"() <{value = -26880 : i16}> : () -> i16
    %5 = "arith.constant"() <{value = 1.64768026E+9 : f32}> : () -> f32
    %6 = "arith.constant"() <{value = 478059000 : i64}> : () -> i64
    %7 = "arith.constant"() <{value = 31542 : i16}> : () -> i16
    %8 = "arith.constant"() <{value = 1504532617 : i64}> : () -> i64
    %9 = "arith.constant"() <{value = true}> : () -> i1
    %10 = "arith.constant"() <{value = true}> : () -> i1
    %11 = "arith.constant"() <{value = -23725 : i16}> : () -> i16
    %12 = "arith.constant"() <{value = -1489 : i16}> : () -> i16
    %13 = "arith.constant"() <{value = 0x4B953A31 : f32}> : () -> f32
    %14 = "arith.constant"() <{value = 0x4E59F2C2 : f32}> : () -> f32
    %15 = "arith.constant"() <{value = true}> : () -> i1
    %16 = "arith.constant"() <{value = 0 : index}> : () -> index
    %17 = "arith.constant"() <{value = 1 : index}> : () -> index
    %18 = "arith.constant"() <{value = 2 : index}> : () -> index
    %19 = "arith.constant"() <{value = 3 : index}> : () -> index
    %20 = "arith.constant"() <{value = 4 : index}> : () -> index
    %21 = "arith.constant"() <{value = 5 : index}> : () -> index
    %22 = "arith.constant"() <{value = 6 : index}> : () -> index
    %23 = "arith.constant"() <{value = 7 : index}> : () -> index
    %24 = "arith.constant"() <{value = 8 : index}> : () -> index
    %25 = "arith.constant"() <{value = 9 : index}> : () -> index
    %26 = "arith.constant"() <{value = 10 : index}> : () -> index
    %27 = "arith.constant"() <{value = 11 : index}> : () -> index
    %28 = "arith.constant"() <{value = 12 : index}> : () -> index
    %29 = "arith.constant"() <{value = 13 : index}> : () -> index
    %30 = "arith.constant"() <{value = 14 : index}> : () -> index
    %31 = "arith.constant"() <{value = 15 : index}> : () -> index
    %32 = "arith.constant"() <{value = 16 : index}> : () -> index
    %33 = "arith.constant"() <{value = 17 : index}> : () -> index
    %34 = "arith.constant"() <{value = 18 : index}> : () -> index
    %35 = "arith.constant"() <{value = 19 : index}> : () -> index
    %36 = "arith.constant"() <{value = 20 : index}> : () -> index
    %37 = "arith.constant"() <{value = 21 : index}> : () -> index
    %38 = "arith.constant"() <{value = 22 : index}> : () -> index
    %39 = "arith.constant"() <{value = 23 : index}> : () -> index
    %40 = "arith.constant"() <{value = 24 : index}> : () -> index
    %41 = "arith.constant"() <{value = 25 : index}> : () -> index
    %42 = "arith.constant"() <{value = 26 : index}> : () -> index
    %43 = "arith.constant"() <{value = 27 : index}> : () -> index
    %44 = "arith.constant"() <{value = 28 : index}> : () -> index
    %45 = "arith.constant"() <{value = 29 : index}> : () -> index
    %46 = "arith.constant"() <{value = 30 : index}> : () -> index
    %47 = "arith.constant"() <{value = 31 : index}> : () -> index
    %48 = "tensor.empty"(%45, %21, %42) : (index, index, index) -> tensor<?x?x?xf32>
    %49 = "tensor.empty"(%20) : (index) -> tensor<?xi1>
    %50 = "tensor.empty"(%45, %44) : (index, index) -> tensor<?x?x3xi64>
    %51 = "tensor.empty"() : () -> tensor<22xi64>
    %52 = "tensor.empty"(%20) : (index) -> tensor<?xi16>
    %53 = "tensor.empty"(%21) : (index) -> tensor<?xf16>
    %54 = "tensor.empty"() : () -> tensor<3x5x3xi16>
    %55 = "tensor.empty"() : () -> tensor<22xf32>
    %56 = "tensor.empty"() : () -> tensor<23xf32>
    %57 = "tensor.empty"(%30) : (index) -> tensor<?xi64>
    %58 = "tensor.empty"(%46) : (index) -> tensor<?xi16>
    %59 = "tensor.empty"(%43) : (index) -> tensor<?xf16>
    %60 = "tensor.empty"() : () -> tensor<5xf16>
    %61 = "tensor.empty"(%30) : (index) -> tensor<?xf32>
    %62 = "tensor.empty"() : () -> tensor<3x5x3xf32>
    %63 = "tensor.empty"(%30) : (index) -> tensor<?xi64>
    %64 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<3x5x3xf16>
    %65 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<5xi32>
    %66 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<5xi32>
    %67 = "memref.alloc"(%17, %26, %37) <{operandSegmentSizes = array<i32: 3, 0>}> : (index, index, index) -> memref<?x?x?xf32>
    %68 = "memref.alloc"(%33) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
    %69 = "memref.alloc"(%43) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi32>
    %70 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<23xi16>
    %71 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<22xi32>
    %72 = "memref.alloc"(%24) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi32>
    %73 = "memref.alloc"(%47) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi64>
    %74 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<23xi1>
    %75 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<3x5x3xi1>
    %76 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<23xi16>
    %77 = "memref.alloc"(%23) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x5x3xi16>
    %78 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<23xf32>
    %79 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<5xf16>
    %80 = "spirv.GL.Exp"(%14) : (f32) -> f32
    %81 = "affine.load"(%67, %17, %27, %26) <{map = affine_map<(d0, d1, d2) -> (d0, d1, d2)>}> : (memref<?x?x?xf32>, index, index, index) -> f32
    %82 = "arith.constant"() <{value = 1.000000e+00 : f16}> : () -> f16
    %83 = "vector.broadcast"(%82) : (f16) -> vector<1xf16>
    %84 = "vector.broadcast"(%9) : (i1) -> vector<1xi1>
    %85 = "vector.mask"(%84) ({
      %215 = "vector.multi_reduction"(%83, %83) <{kind = #vector.kind<mul>, reduction_dims = []}> : (vector<1xf16>, vector<1xf16>) -> vector<1xf16>
      "vector.yield"(%215) : (vector<1xf16>) -> ()
    }) : (vector<1xi1>) -> vector<1xf16>
    "affine.store"(%4, %77, %33, %21, %22) <{map = affine_map<(d0, d1, d2) -> (d0, d1, d2)>}> : (i16, memref<?x5x3xi16>, index, index, index) -> ()
    %86 = "math.ipowi"(%54, %54) : (tensor<3x5x3xi16>, tensor<3x5x3xi16>) -> tensor<3x5x3xi16>
    %87 = "bufferization.clone"(%79) : (memref<5xf16>) -> memref<5xf16>
    %88 = "spirv.CL.fmin"(%80, %81) : (f32, f32) -> f32
    %89 = "math.exp2"(%60) <{fastmath = #arith.fastmath<none>}> : (tensor<5xf16>) -> tensor<5xf16>
    %90 = "tensor.rank"(%63) : (tensor<?xi64>) -> index
    %91 = "spirv.CL.fma"(%1, %1, %80) : (f32, f32, f32) -> f32
    %92 = "vector.splat"(%1) : (f32) -> vector<5xf32>
    %93 = "spirv.GL.FSign"(%82) : (f16) -> f16
    %94 = "spirv.CL.s_min"(%8, %8) : (i64, i64) -> i64
    %95 = "math.tanh"(%62) <{fastmath = #arith.fastmath<none>}> : (tensor<3x5x3xf32>) -> tensor<3x5x3xf32>
    %96 = "scf.execute_region"() ({
      %215 = "math.round"(%48) <{fastmath = #arith.fastmath<none>}> : (tensor<?x?x?xf32>) -> tensor<?x?x?xf32>
      %216 = "affine.for"(%51) <{lowerBoundMap = affine_map<() -> (0)>, operandSegmentSizes = array<i32: 0, 0, 1>, step = 1 : index, upperBoundMap = affine_map<() -> (73)>}> ({
      ^bb0(%arg1: index, %arg2: tensor<22xi64>):
        "affine.yield"(%51) : (tensor<22xi64>) -> ()
      }) : (tensor<22xi64>) -> tensor<22xi64>
      %217 = "scf.if"(%9) ({
        %229 = "vector.load"(%71, %36) : (memref<22xi32>, index) -> vector<22xi32>
        %230 = "arith.shrsi"(%6, %0) : (i64, i64) -> i64
        %231 = "arith.ori"(%6, %6) : (i64, i64) -> i64
        %232 = "math.ctpop"(%52) : (tensor<?xi16>) -> tensor<?xi16>
        %233 = "vector.bitcast"(%83) : (vector<1xf16>) -> vector<1xf16>
        %234 = "arith.remsi"(%7, %11) : (i16, i16) -> i16
        %235 = "vector.insertelement"(%93, %233, %26) : (f16, vector<1xf16>, index) -> vector<1xf16>
        %236 = "index.divu"(%45, %25) : (index, index) -> index
        %237 = "arith.constant"() <{value = 0 : i32}> : () -> i32
        "scf.yield"(%237) : (i32) -> ()
      }, {
        %229 = "arith.remf"(%80, %80) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %230 = "affine.max"(%38, %22, %18, %38) <{map = affine_map<(d0, d1, d2)[s0] -> (d2 * 8)>}> : (index, index, index, index) -> index
        %231 = "tensor.splat"(%93) : (f16) -> tensor<5xf16>
        %232 = "math.atan"(%80) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %233 = "vector.extract"(%84) <{static_position = array<i64: 0>}> : (vector<1xi1>) -> i1
        %234 = "tensor.empty"() : () -> tensor<3x5x3xi32>
        %235 = "arith.constant"() <{value = 0 : i32}> : () -> i32
        %236 = "vector.broadcast"(%235) : (i32) -> vector<23xi32>
        %237 = "vector.broadcast"(%15) : (i1) -> vector<23xi1>
        %238 = "vector.gather"(%234, %43, %47, %44, %236, %237, %236) : (tensor<3x5x3xi32>, index, index, index, vector<23xi32>, vector<23xi1>, vector<23xi32>) -> vector<23xi32>
        %239 = "affine.vector_load"(%73, %26) <{map = affine_map<(d0) -> (d0)>}> : (memref<?xi64>, index) -> vector<5xi64>
        %240 = "vector.extract"(%237) <{static_position = array<i64: 11>}> : (vector<23xi1>) -> i1
        "scf.yield"(%235) : (i32) -> ()
      }) : (i1) -> i32
      %218 = "memref.cast"(%67) : (memref<?x?x?xf32>) -> memref<23x3x22xf32>
      %219 = "vector.contract"(%84, %84, %9) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<xor>}> : (vector<1xi1>, vector<1xi1>, i1) -> i1
      %220 = "arith.ceildivsi"(%7, %12) : (i16, i16) -> i16
      %221 = "affine.load"(%69, %20) <{map = affine_map<(d0) -> (d0)>}> : (memref<?xi32>, index) -> i32
      %222 = "math.atan"(%81) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %223 = "memref.alloc"(%44) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x23xi1>
      %224 = "linalg.generic"(%223, %223, %49, %49, %49) <{indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0)>], iterator_types = [#linalg.iterator_type<parallel>, #linalg.iterator_type<reduction>], operandSegmentSizes = array<i32: 4, 1>}> ({
      ^bb0(%arg1: i1, %arg2: i1, %arg3: i1, %arg4: i1, %arg5: i1):
        %229 = "math.cttz"(%54) : (tensor<3x5x3xi16>) -> tensor<3x5x3xi16>
        "linalg.yield"(%arg4) : (i1) -> ()
      }) : (memref<?x23xi1>, memref<?x23xi1>, tensor<?xi1>, tensor<?xi1>, tensor<?xi1>) -> tensor<?xi1>
      %225 = "bufferization.clone"(%65) : (memref<5xi32>) -> memref<5xi32>
      %226 = "memref.alloc"(%38, %29) <{operandSegmentSizes = array<i32: 2, 0>}> : (index, index) -> memref<?x?x3xi1>
      %227 = "math.powf"(%1, %14) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      "bufferization.dealloc_tensor"(%61) : (tensor<?xf32>) -> ()
      "scf.if"(%10) ({
        %229 = "arith.minui"(%221, %221) : (i32, i32) -> i32
        %230 = "affine.max"(%29, %22) <{map = affine_map<(d0)[s0] -> (d0 floordiv 128)>}> : (index, index) -> index
        %231 = "arith.ori"(%3, %9) : (i1, i1) -> i1
        %232 = "index.divu"(%46, %46) : (index, index) -> index
        %233 = "arith.cmpi"(%3, %10) <{predicate = 4 : i64}> : (i1, i1) -> i1
        %234 = "arith.ceildivsi"(%12, %12) : (i16, i16) -> i16
        %235 = "index.shl"(%33, %232) : (index, index) -> index
        %236 = "arith.divsi"(%15, %9) : (i1, i1) -> i1
        "scf.yield"() : () -> ()
      }, {
      }) : (i1) -> ()
      "affine.store"(%82, %87, %26) <{map = affine_map<(d0) -> (d0)>}> : (f16, memref<5xf16>, index) -> ()
      "affine.store"(%217, %65, %24) <{map = affine_map<(d0) -> (d0)>}> : (i32, memref<5xi32>, index) -> ()
      %228 = "tensor.empty"() : () -> tensor<3x5x3xf16>
      "scf.yield"(%228) : (tensor<3x5x3xf16>) -> ()
    }) : () -> tensor<3x5x3xf16>
    %97 = "spirv.GL.Sin"(%80) : (f32) -> f32
    %98 = "spirv.CL.ceil"(%97) : (f32) -> f32
    %99 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<3x23xi32>
    %100 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<23x5xi32>
    %101 = "tensor.empty"() : () -> tensor<3x5xi32>
    %102 = "linalg.matmul"(%99, %100, %101) <{operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg1: i32, %arg2: i32, %arg3: i32):
      %215 = "arith.muli"(%arg1, %arg2) : (i32, i32) -> i32
      %216 = "arith.addi"(%arg3, %215) : (i32, i32) -> i32
      "linalg.yield"(%216) : (i32) -> ()
    }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (memref<3x23xi32>, memref<23x5xi32>, tensor<3x5xi32>) -> tensor<3x5xi32>
    %103 = "spirv.GL.UMax"(%0, %94) : (i64, i64) -> i64
    %104 = "arith.constant"() <{value = 1 : i32}> : () -> i32
    %105 = "vector.broadcast"(%104) : (i32) -> vector<2xi32>
    %106 = "spirv.BitFieldSExtract"(%105, %4, %0) : (vector<2xi32>, i16, i64) -> vector<2xi32>
    %107 = "spirv.CL.round"(%2) : (f32) -> f32
    %108 = "vector.broadcast"(%7) : (i16) -> vector<23xi16>
    %109 = "vector.broadcast"(%3) : (i1) -> vector<23xi1>
    "vector.compressstore"(%68, %16, %109, %108) : (memref<?xi16>, index, vector<23xi1>, vector<23xi16>) -> ()
    %110 = "spirv.CL.ceil"(%81) : (f32) -> f32
    "vector.warp_execute_on_lane_0"(%16) <{warp_size = 32 : i64}> ({
      "scf.execute_region"() ({
        %222 = "vector.matrix_multiply"(%105, %105) <{lhs_columns = 2 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<2xi32>, vector<2xi32>) -> vector<1xi32>
        %223 = "arith.andi"(%104, %104) : (i32, i32) -> i32
        %224 = "vector.broadcast"(%4) : (i16) -> vector<3xi16>
        %225 = "vector.broadcast"(%10) : (i1) -> vector<3xi1>
        "vector.compressstore"(%68, %16, %225, %224) : (memref<?xi16>, index, vector<3xi1>, vector<3xi16>) -> ()
        %226 = "vector.matrix_multiply"(%222, %105) <{lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 2 : i32}> : (vector<1xi32>, vector<2xi32>) -> vector<2xi32>
        %227 = "index.mul"(%38, %17) : (index, index) -> index
        %228 = "memref.alloc"(%38, %41, %18) <{operandSegmentSizes = array<i32: 3, 0>}> : (index, index, index) -> memref<?x?x?xf32>
        %229 = "memref.cast"(%65) : (memref<5xi32>) -> memref<?xi32>
        %230 = "math.atan2"(%93, %82) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %231 = "arith.cmpi"(%3, %9) <{predicate = 5 : i64}> : (i1, i1) -> i1
        %232 = "vector.bitcast"(%105) : (vector<2xi32>) -> vector<2xi32>
        %233 = "arith.ori"(%94, %103) : (i64, i64) -> i64
        %234 = "math.expm1"(%14) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        "memref.store"(%93, %79, %17) <{nontemporal = false}> : (f16, memref<5xf16>, index) -> ()
        %235 = "arith.andi"(%6, %0) : (i64, i64) -> i64
        %236 = "math.cttz"(%63) : (tensor<?xi64>) -> tensor<?xi64>
        %237 = "arith.divui"(%7, %11) : (i16, i16) -> i16
        "scf.yield"() : () -> ()
      }) : () -> ()
      %215 = "memref.realloc"(%65) : (memref<5xi32>) -> memref<3xi32>
      %216 = "index.xor"(%42, %47) : (index, index) -> index
      %217 = "vector.contract"(%105, %105, %104) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<or>}> : (vector<2xi32>, vector<2xi32>, i32) -> i32
      %218 = "math.copysign"(%97, %13) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %219 = "scf.if"(%10) ({
        %222 = "index.shrs"(%43, %27) : (index, index) -> index
        %223 = "arith.addf"(%13, %110) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %224 = "arith.subi"(%15, %3) : (i1, i1) -> i1
        %225 = "arith.shrsi"(%104, %104) : (i32, i32) -> i32
        %226 = "vector.broadcast"(%15) : (i1) -> vector<2xi1>
        %227 = "vector.mask"(%226) ({
          %231 = "vector.multi_reduction"(%105, %105) <{kind = #vector.kind<minui>, reduction_dims = []}> : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
          "vector.yield"(%231) : (vector<2xi32>) -> ()
        }) : (vector<2xi1>) -> vector<2xi32>
        %228 = "math.fma"(%55, %55, %55) <{fastmath = #arith.fastmath<none>}> : (tensor<22xf32>, tensor<22xf32>, tensor<22xf32>) -> tensor<22xf32>
        %229 = "arith.divsi"(%10, %15) : (i1, i1) -> i1
        %230 = "arith.ceildivsi"(%15, %9) : (i1, i1) -> i1
        "scf.yield"(%78) : (memref<23xf32>) -> ()
      }, {
        %222 = "arith.mulf"(%98, %107) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %223 = "arith.andi"(%10, %9) : (i1, i1) -> i1
        %224 = "bufferization.clone"(%76) : (memref<23xi16>) -> memref<23xi16>
        %225 = "math.cos"(%88) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %226 = "affine.max"(%38, %27) <{map = affine_map<(d0)[s0] -> (-d0 + 48)>}> : (index, index) -> index
        %227 = "arith.cmpi"(%8, %8) <{predicate = 0 : i64}> : (i64, i64) -> i1
        %228 = "index.floordivs"(%22, %25) : (index, index) -> index
        %229 = "math.exp2"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        "scf.yield"(%78) : (memref<23xf32>) -> ()
      }) : (i1) -> memref<23xf32>
      %220 = "memref.cast"(%70) : (memref<23xi16>) -> memref<23xi16>
      %221 = "arith.divui"(%12, %12) : (i16, i16) -> i16
      "vector.yield"() : () -> ()
    }) : (index) -> ()
    %111 = "index.ceildivs"(%19, %34) : (index, index) -> index
    %112 = "spirv.FOrdEqual"(%98, %107) : (f32, f32) -> i1
    %113 = "vector.insert"(%9, %84) <{static_position = array<i64: 0>}> : (i1, vector<1xi1>) -> vector<1xi1>
    %114 = "index.ceildivs"(%24, %38) : (index, index) -> index
    %115 = "spirv.GL.Round"(%97) : (f32) -> f32
    %116 = "spirv.CL.erf"(%91) : (f32) -> f32
    %117 = "spirv.CL.log"(%2) : (f32) -> f32
    %118 = "spirv.BitFieldUExtract"(%105, %12, %0) : (vector<2xi32>, i16, i64) -> vector<2xi32>
    %119 = "math.ctpop"(%54) : (tensor<3x5x3xi16>) -> tensor<3x5x3xi16>
    %120 = "spirv.SGreaterThan"(%103, %103) : (i64, i64) -> i1
    %121 = "affine.min"(%114, %arg0, %37) <{map = affine_map<(d0, d1)[s0] -> (d1)>}> : (index, index, index) -> index
    %122 = "arith.divui"(%10, %3) : (i1, i1) -> i1
    %123 = "spirv.CL.exp"(%110) : (f32) -> f32
    %124 = "vector.extract_strided_slice"(%83) <{offsets = [0], sizes = [1], strides = [1]}> : (vector<1xf16>) -> vector<1xf16>
    %125 = "index.mul"(%90, %111) : (index, index) -> index
    %126 = "bufferization.clone"(%87) : (memref<5xf16>) -> memref<5xf16>
    %127 = "index.shl"(%23, %45) : (index, index) -> index
    %128 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<3x5x3xi32>
    %129 = "spirv.FOrdNotEqual"(%117, %14) : (f32, f32) -> i1
    %130 = "arith.divui"(%7, %7) : (i16, i16) -> i16
    "affine.store"(%120, %74, %34) <{map = affine_map<(d0) -> (d0)>}> : (i1, memref<23xi1>, index) -> ()
    %131 = "math.ctpop"(%50) : (tensor<?x?x3xi64>) -> tensor<?x?x3xi64>
    %132 = "spirv.CL.sqrt"(%123) : (f32) -> f32
    %133 = "spirv.CL.s_min"(%103, %8) : (i64, i64) -> i64
    %134 = "spirv.GL.SAbs"(%103) : (i64) -> i64
    %135 = "spirv.CL.rint"(%5) : (f32) -> f32
    %136 = "spirv.CL.exp"(%110) : (f32) -> f32
    %137 = "arith.xori"(%6, %0) : (i64, i64) -> i64
    %138 = "memref.alloc"(%38) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
    %139 = "index.ceildivu"(%23, %114) : (index, index) -> index
    %140 = "spirv.CL.floor"(%132) : (f32) -> f32
    %141 = "tensor.empty"() : () -> tensor<f16>
    %142 = "linalg.dot"(%79, %60, %141) <{operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg1: f16, %arg2: f16, %arg3: f16):
      %215 = "arith.mulf"(%arg1, %arg2) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %216 = "arith.addf"(%arg3, %215) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      "linalg.yield"(%216) : (f16) -> ()
    }) {linalg.memoized_indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>]} : (memref<5xf16>, tensor<5xf16>, tensor<f16>) -> tensor<f16>
    %143 = "vector.bitcast"(%84) : (vector<1xi1>) -> vector<1xi1>
    %144 = "spirv.BitFieldUExtract"(%105, %0, %12) : (vector<2xi32>, i64, i16) -> vector<2xi32>
    %145 = "spirv.FOrdEqual"(%1, %110) : (f32, f32) -> i1
    %146 = "math.log"(%88) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %147 = "spirv.GL.InverseSqrt"(%136) : (f32) -> f32
    %148 = "math.round"(%48) <{fastmath = #arith.fastmath<none>}> : (tensor<?x?x?xf32>) -> tensor<?x?x?xf32>
    %149 = "spirv.GL.FSign"(%5) : (f32) -> f32
    %150 = "spirv.FUnordEqual"(%97, %81) : (f32, f32) -> i1
    "memref.store"(%93, %87, %20) <{nontemporal = false}> : (f16, memref<5xf16>, index) -> ()
    %151 = "arith.ceildivsi"(%120, %3) : (i1, i1) -> i1
    %152 = "spirv.CL.s_min"(%11, %7) : (i16, i16) -> i16
    %153 = "vector.matrix_multiply"(%143, %143) <{lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<1xi1>, vector<1xi1>) -> vector<1xi1>
    %154 = "spirv.CL.u_min"(%8, %0) : (i64, i64) -> i64
    %155 = "spirv.CL.erf"(%5) : (f32) -> f32
    %156 = "vector.multi_reduction"(%153, %153) <{kind = #vector.kind<xor>, reduction_dims = []}> : (vector<1xi1>, vector<1xi1>) -> vector<1xi1>
    %157 = "math.log"(%13) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %158 = "vector.multi_reduction"(%83, %93) <{kind = #vector.kind<maxf>, reduction_dims = [0]}> : (vector<1xf16>, f16) -> f16
    %159 = "tensor.empty"() : () -> tensor<5x22xf16>
    %160 = "linalg.broadcast"(%60, %159) <{dimensions = array<i64: 1>}> ({
    ^bb0(%arg1: f16, %arg2: f16):
      "linalg.yield"(%arg1) : (f16) -> ()
    }) : (tensor<5xf16>, tensor<5x22xf16>) -> tensor<5x22xf16>
    %161 = "math.tanh"(%142) <{fastmath = #arith.fastmath<none>}> : (tensor<f16>) -> tensor<f16>
    %162 = "spirv.CL.exp"(%81) : (f32) -> f32
    %163 = "index.shl"(%33, %114) : (index, index) -> index
    %164 = "spirv.FUnordEqual"(%155, %123) : (f32, f32) -> i1
    %165 = "vector.insertelement"(%164, %84, %34) : (i1, vector<1xi1>, index) -> vector<1xi1>
    %166 = "linalg.transpose"(%58, %52) <{permutation = array<i64: 0>}> ({
    ^bb0(%arg1: i16, %arg2: i16):
      "linalg.yield"(%arg1) : (i16) -> ()
    }) : (tensor<?xi16>, tensor<?xi16>) -> tensor<?xi16>
    %167 = "spirv.CL.sqrt"(%14) : (f32) -> f32
    %168 = "arith.addf"(%155, %98) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
    %169 = "tensor.insert"(%94, %57, %16) : (i64, tensor<?xi64>, index) -> tensor<?xi64>
    %170 = "arith.shrsi"(%9, %15) : (i1, i1) -> i1
    %171 = "spirv.GL.FClamp"(%149, %2, %107) : (f32, f32, f32) -> f32
    %172 = "spirv.GL.FAbs"(%14) : (f32) -> f32
    %173 = "spirv.FOrdGreaterThanEqual"(%123, %81) : (f32, f32) -> i1
    %174 = "index.castu"(%16) : (index) -> i32
    %175 = "spirv.GL.Exp"(%115) : (f32) -> f32
    %176 = "spirv.CL.rsqrt"(%2) : (f32) -> f32
    %177 = "math.ipowi"(%134, %94) : (i64, i64) -> i64
    %178 = "index.castu"(%152) : (i16) -> index
    %179 = "vector.shuffle"(%153, %143) <{mask = [0]}> : (vector<1xi1>, vector<1xi1>) -> vector<1xi1>
    %180 = "spirv.CL.ceil"(%167) : (f32) -> f32
    %181 = "tensor.generate"(%38) ({
    ^bb0(%arg1: index):
      %215 = "memref.cast"(%72) : (memref<?xi32>) -> memref<?xi32>
      %216 = "scf.execute_region"() ({
        %217 = "arith.ori"(%0, %133) : (i64, i64) -> i64
        %218 = "bufferization.clone"(%66) : (memref<5xi32>) -> memref<5xi32>
        %219 = "arith.andi"(%104, %104) : (i32, i32) -> i32
        %220 = "vector.broadcast"(%81) : (f32) -> vector<22xf32>
        %221 = "vector.broadcast"(%129) : (i1) -> vector<22xi1>
        %222 = "vector.broadcast"(%104) : (i32) -> vector<22xi32>
        %223 = "vector.gather"(%55, %139, %222, %221, %220) : (tensor<22xf32>, index, vector<22xi32>, vector<22xi1>, vector<22xf32>) -> vector<22xf32>
        %224 = "index.ceildivu"(%46, %19) : (index, index) -> index
        "memref.assume_alignment"(%77) <{alignment = 2 : i32}> : (memref<?x5x3xi16>) -> ()
        %225 = "arith.subi"(%0, %94) : (i64, i64) -> i64
        %226 = "arith.ori"(%3, %164) : (i1, i1) -> i1
        %227 = "affine.load"(%73, %19) <{map = affine_map<(d0) -> (d0)>}> : (memref<?xi64>, index) -> i64
        "affine.vector_store"(%221, %74, %20) <{map = affine_map<(d0) -> (d0)>}> : (vector<22xi1>, memref<23xi1>, index) -> ()
        %228 = "arith.ceildivsi"(%8, %0) : (i64, i64) -> i64
        %229 = "index.casts"(%25) : (index) -> i32
        "bufferization.dealloc_tensor"(%57) : (tensor<?xi64>) -> ()
        %230 = "tensor.insert"(%154, %63, %16) : (i64, tensor<?xi64>, index) -> tensor<?xi64>
        %231 = "math.fma"(%62, %62, %62) <{fastmath = #arith.fastmath<none>}> : (tensor<3x5x3xf32>, tensor<3x5x3xf32>, tensor<3x5x3xf32>) -> tensor<3x5x3xf32>
        %232 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<3x5x3xi64>
        %233 = "tensor.empty"(%111) : (index) -> tensor<?xf16>
        "scf.yield"(%233) : (tensor<?xf16>) -> ()
      }) : () -> tensor<?xf16>
      "scf.index_switch"(%34) <{cases = array<i64: 1, 2, 3>}> ({
        %217 = "math.fpowi"(%171, %104) <{fastmath = #arith.fastmath<none>}> : (f32, i32) -> f32
        %218 = "vector.load"(%71, %25) : (memref<22xi32>, index) -> vector<5xi32>
        %219 = "arith.cmpf"(%2, %115) <{predicate = 13 : i64}> : (f32, f32) -> i1
        %220 = "math.floor"(%62) <{fastmath = #arith.fastmath<none>}> : (tensor<3x5x3xf32>) -> tensor<3x5x3xf32>
        %221 = "arith.addf"(%123, %110) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        "memref.store"(%152, %76, %38) <{nontemporal = false}> : (i16, memref<23xi16>, index) -> ()
        %222 = "bufferization.clone"(%126) : (memref<5xf16>) -> memref<5xf16>
        %223 = "bufferization.clone"(%78) : (memref<23xf32>) -> memref<23xf32>
        %224 = "affine.load"(%74, %41) <{map = affine_map<(d0) -> (d0)>}> : (memref<23xi1>, index) -> i1
        %225 = "index.ceildivs"(%18, %111) : (index, index) -> index
        %226 = "memref.cast"(%78) : (memref<23xf32>) -> memref<23xf32>
        %227 = "bufferization.clone"(%126) : (memref<5xf16>) -> memref<5xf16>
        %228 = "arith.ori"(%112, %3) : (i1, i1) -> i1
        %229 = "affine.apply"(%121, %20) <{map = affine_map<(d0)[s0] -> (((d0 floordiv 128) * 2 + 32) ceildiv 32)>}> : (index, index) -> index
        %230 = "math.log2"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %231 = "math.fma"(%13, %155, %180) <{fastmath = #arith.fastmath<none>}> : (f32, f32, f32) -> f32
        "scf.yield"() : () -> ()
      }, {
        %217 = "arith.addi"(%173, %112) : (i1, i1) -> i1
        %218 = "memref.realloc"(%72) : (memref<?xi32>) -> memref<5xi32>
        %219 = "math.log1p"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
        %220 = "math.roundeven"(%142) <{fastmath = #arith.fastmath<none>}> : (tensor<f16>) -> tensor<f16>
        %221 = "bufferization.clone"(%75) : (memref<3x5x3xi1>) -> memref<3x5x3xi1>
        %222 = "linalg.transpose"(%55, %55) <{permutation = array<i64: 0>}> ({
        ^bb0(%arg2: f32, %arg3: f32):
          "linalg.yield"(%arg2) : (f32) -> ()
        }) : (tensor<22xf32>, tensor<22xf32>) -> tensor<22xf32>
        %223 = "index.sub"(%34, %23) : (index, index) -> index
        %224 = "vector.bitcast"(%105) : (vector<2xi32>) -> vector<2xi32>
        "affine.store"(%116, %67, %18, %16, %34) <{map = affine_map<(d0, d1, d2) -> (d0, d1, d2)>}> : (f32, memref<?x?x?xf32>, index, index, index) -> ()
        %225 = "arith.andi"(%4, %7) : (i16, i16) -> i16
        %226 = "vector.splat"(%3) : (i1) -> vector<5xi1>
        %227 = "vector.bitcast"(%105) : (vector<2xi32>) -> vector<2xi32>
        %228 = "memref.atomic_rmw"(%82, %64, %18, %19, %18) <{kind = 2 : i64}> : (f16, memref<3x5x3xf16>, index, index, index) -> f16
        %229 = "vector.bitcast"(%224) : (vector<2xi32>) -> vector<2xi32>
        %230 = "arith.divf"(%158, %93) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %231 = "arith.ori"(%6, %94) : (i64, i64) -> i64
        "scf.yield"() : () -> ()
      }, {
        %217 = "vector.create_mask"(%163) : (index) -> vector<5xi1>
        %218 = "math.ceil"(%13) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        "affine.store"(%4, %70, %32) <{map = affine_map<(d0) -> (d0)>}> : (i16, memref<23xi16>, index) -> ()
        %219 = "math.round"(%123) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %220 = "math.round"(%149) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %221 = "arith.divui"(%164, %129) : (i1, i1) -> i1
        %222 = "arith.minsi"(%134, %0) : (i64, i64) -> i64
        %223 = "math.round"(%136) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %224 = "tensor.rank"(%59) : (tensor<?xf16>) -> index
        %225 = "vector.contract"(%217, %217, %112) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<xor>}> : (vector<5xi1>, vector<5xi1>, i1) -> i1
        %226 = "vector.mask"(%143) ({
          %232 = "vector.multi_reduction"(%153, %84) <{kind = #vector.kind<maxsi>, reduction_dims = []}> : (vector<1xi1>, vector<1xi1>) -> vector<1xi1>
          "vector.yield"(%232) : (vector<1xi1>) -> ()
        }) : (vector<1xi1>) -> vector<1xi1>
        %227 = "tensor.from_elements"(%149, %97, %97, %176, %14, %1, %162, %140, %149, %81, %123, %91, %167, %5, %176, %135, %175, %123, %2, %162, %176, %14, %115) : (f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32) -> tensor<23xf32>
        %228 = "math.exp2"(%60) <{fastmath = #arith.fastmath<none>}> : (tensor<5xf16>) -> tensor<5xf16>
        %229 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<22xi32>
        %230 = "arith.xori"(%8, %134) : (i64, i64) -> i64
        %231 = "index.divu"(%125, %125) : (index, index) -> index
        "scf.yield"() : () -> ()
      }, {
        %217 = "vector.broadcast"(%1) : (f32) -> vector<3x5x3xf32>
        %218 = "vector.fma"(%217, %217, %217) : (vector<3x5x3xf32>, vector<3x5x3xf32>, vector<3x5x3xf32>) -> vector<3x5x3xf32>
        %219 = "arith.divui"(%120, %129) : (i1, i1) -> i1
        %220 = "arith.divf"(%98, %149) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %221 = "index.ceildivu"(%arg0, %28) : (index, index) -> index
        %222 = "math.cttz"(%150) : (i1) -> i1
        %223 = "arith.mulf"(%162, %123) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %224 = "affine.vector_load"(%64, %27, %35, %125) <{map = affine_map<(d0, d1, d2) -> (d0, d1, d2)>}> : (memref<3x5x3xf16>, index, index, index) -> vector<5xf16>
        %225 = "bufferization.clone"(%74) : (memref<23xi1>) -> memref<23xi1>
        %226 = "arith.addf"(%88, %167) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %227 = "math.ceil"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %228 = "index.ceildivu"(%arg1, %221) : (index, index) -> index
        %229 = "index.sub"(%121, %25) : (index, index) -> index
        %230 = "bufferization.to_tensor"(%69) : (memref<?xi32>) -> tensor<?xi32>
        "memref.store"(%0, %73, %16) <{nontemporal = false}> : (i64, memref<?xi64>, index) -> ()
        %231 = "bufferization.clone"(%87) : (memref<5xf16>) -> memref<5xf16>
        %232 = "memref.cast"(%64) : (memref<3x5x3xf16>) -> memref<3x5x3xf16>
        "scf.yield"() : () -> ()
      }) : (index) -> ()
      "scf.execute_region"() ({
        %217 = "index.mul"(%20, %arg1) : (index, index) -> index
        %218 = "index.shl"(%23, %39) : (index, index) -> index
        %219 = "math.round"(%13) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %220 = "vector.insert"(%10, %143) <{static_position = array<i64: 0>}> : (i1, vector<1xi1>) -> vector<1xi1>
        %221 = "index.shl"(%35, %22) : (index, index) -> index
        %222 = "vector.contract"(%143, %143, %164) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<xor>}> : (vector<1xi1>, vector<1xi1>, i1) -> i1
        %223 = "linalg.copy"(%59, %59) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg2: f16, %arg3: f16):
          "linalg.yield"(%arg2) : (f16) -> ()
        }) : (tensor<?xf16>, tensor<?xf16>) -> tensor<?xf16>
        %224 = "tensor.insert"(%123, %61, %16) : (f32, tensor<?xf32>, index) -> tensor<?xf32>
        %225 = "index.ceildivu"(%44, %111) : (index, index) -> index
        %226 = "math.ctpop"(%58) : (tensor<?xi16>) -> tensor<?xi16>
        %227 = "vector.broadcast"(%5) : (f32) -> vector<3x5x3xf32>
        %228 = "index.divu"(%38, %arg1) : (index, index) -> index
        %229 = "arith.cmpf"(%123, %14) <{predicate = 15 : i64}> : (f32, f32) -> i1
        %230 = "vector.contract"(%84, %153, %150) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<xor>}> : (vector<1xi1>, vector<1xi1>, i1) -> i1
        %231 = "arith.cmpi"(%12, %4) <{predicate = 8 : i64}> : (i16, i16) -> i1
        %232 = "vector.broadcast"(%93) : (f16) -> vector<5xf16>
        %233 = "vector.broadcast"(%9) : (i1) -> vector<5xi1>
        %234 = "vector.maskedload"(%126, %18, %233, %232) : (memref<5xf16>, index, vector<5xi1>, vector<5xf16>) -> vector<5xf16>
        "scf.yield"() : () -> ()
      }) : () -> ()
      "tensor.yield"(%104) : (i32) -> ()
    }) : (index) -> tensor<?xi32>
    %182 = "index.ceildivs"(%24, %43) : (index, index) -> index
    %183 = "spirv.GL.SMax"(%0, %8) : (i64, i64) -> i64
    %184 = "spirv.CL.u_max"(%11, %7) : (i16, i16) -> i16
    %185 = "vector.broadcast"(%133) : (i64) -> vector<3xi64>
    %186 = "vector.broadcast"(%9) : (i1) -> vector<3xi1>
    "vector.compressstore"(%73, %16, %186, %185) : (memref<?xi64>, index, vector<3xi1>, vector<3xi64>) -> ()
    %187 = "vector.broadcast"(%154) : (i64) -> vector<3x5x3xi64>
    %188 = "vector.load"(%77, %16, %19, %17) : (memref<?x5x3xi16>, index, index, index) -> vector<23xi16>
    %189 = "math.ceil"(%110) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %190 = "memref.cast"(%67) : (memref<?x?x?xf32>) -> memref<?x?x?xf32>
    %191 = "scf.while"(%162) ({
    ^bb0(%arg1: f32):
      %215 = "arith.ori"(%94, %0) : (i64, i64) -> i64
      %216 = "math.cos"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
      %217 = "math.absi"(%94) : (i64) -> i64
      %218 = "index.ceildivs"(%39, %24) : (index, index) -> index
      %219 = "bufferization.clone"(%71) : (memref<22xi32>) -> memref<22xi32>
      %220 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<3x5x3xi32>
      %221 = "vector.broadcast"(%104) : (i32) -> vector<5xi32>
      %222 = "vector.broadcast"(%145) : (i1) -> vector<5xi1>
      %223 = "vector.gather"(%220, %111, %25, %45, %221, %222, %221) : (memref<3x5x3xi32>, index, index, index, vector<5xi32>, vector<5xi1>, vector<5xi32>) -> vector<5xi32>
      %224 = "affine.apply"(%45, %29) <{map = affine_map<(d0)[s0] -> (d0)>}> : (index, index) -> index
      "vector.compressstore"(%72, %16, %222, %221) : (memref<?xi32>, index, vector<5xi1>, vector<5xi32>) -> ()
      "scf.condition"(%10, %116) : (i1, f32) -> ()
    }, {
    ^bb0(%arg1: f32):
      %215 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<5x3xi32>
      "linalg.transpose"(%101, %215) <{permutation = array<i64: 1, 0>}> ({
      ^bb0(%arg2: i32, %arg3: i32):
        "linalg.yield"(%arg2) : (i32) -> ()
      }) : (tensor<3x5xi32>, memref<5x3xi32>) -> ()
      %216 = "vector.broadcast"(%162) : (f32) -> vector<5xf32>
      %217 = "vector.broadcast"(%9) : (i1) -> vector<5xi1>
      %218 = "vector.maskedload"(%78, %21, %217, %216) : (memref<23xf32>, index, vector<5xi1>, vector<5xf32>) -> vector<5xf32>
      %219 = "arith.remsi"(%164, %129) : (i1, i1) -> i1
      "memref.alloca_scope"() ({
        %232 = "arith.cmpi"(%183, %103) <{predicate = 0 : i64}> : (i64, i64) -> i1
        %233 = "arith.cmpi"(%94, %94) <{predicate = 5 : i64}> : (i64, i64) -> i1
        %234 = "math.log1p"(%56) <{fastmath = #arith.fastmath<none>}> : (tensor<23xf32>) -> tensor<23xf32>
        %235 = "math.copysign"(%110, %107) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %236 = "arith.remf"(%107, %98) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %237 = "arith.ceildivsi"(%9, %112) : (i1, i1) -> i1
        %238 = "bufferization.clone"(%70) : (memref<23xi16>) -> memref<23xi16>
        %239 = "index.divu"(%41, %35) : (index, index) -> index
        %240 = "index.shru"(%44, %23) : (index, index) -> index
        %241 = "vector.create_mask"(%18, %20, %18) : (index, index, index) -> vector<3x5x3xi1>
        %242 = "index.mul"(%38, %30) : (index, index) -> index
        %243 = "vector.extract_strided_slice"(%84) <{offsets = [0], sizes = [1], strides = [1]}> : (vector<1xi1>) -> vector<1xi1>
        %244 = "tensor.extract"(%48, %16, %16, %16) : (tensor<?x?x?xf32>, index, index, index) -> f32
        %245 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<5x5xf16>
        "linalg.broadcast"(%126, %245) <{dimensions = array<i64: 1>}> ({
        ^bb0(%arg2: f16, %arg3: f16):
          "linalg.yield"(%arg2) : (f16) -> ()
        }) : (memref<5xf16>, memref<5x5xf16>) -> ()
        %246 = "tensor.empty"() : () -> tensor<5x23xf16>
        %247 = "linalg.broadcast"(%79, %246) <{dimensions = array<i64: 1>}> ({
        ^bb0(%arg2: f16, %arg3: f16):
          "linalg.yield"(%arg2) : (f16) -> ()
        }) : (memref<5xf16>, tensor<5x23xf16>) -> tensor<5x23xf16>
        %248 = "arith.mulf"(%132, %116) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %249 = "math.roundeven"(%160) <{fastmath = #arith.fastmath<none>}> : (tensor<5x22xf16>) -> tensor<5x22xf16>
        %250 = "index.add"(%29, %182) : (index, index) -> index
        %251 = "vector.matrix_multiply"(%83, %83) <{lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<1xf16>, vector<1xf16>) -> vector<1xf16>
        %252 = "bufferization.clone"(%70) : (memref<23xi16>) -> memref<23xi16>
        %253 = "tensor.from_elements"(%164, %10, %120, %10, %15, %129, %3, %150, %120, %164, %120, %3, %10, %15, %129, %112, %129, %173, %3, %150, %145, %3) : (i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1, i1) -> tensor<22xi1>
        %254 = "affine.load"(%70, %40) <{map = affine_map<(d0) -> (d0)>}> : (memref<23xi16>, index) -> i16
        %255 = "arith.subi"(%184, %11) : (i16, i16) -> i16
        %256 = "index.maxu"(%18, %41) : (index, index) -> index
        %257 = "index.divu"(%38, %46) : (index, index) -> index
        %258 = "index.ceildivu"(%90, %139) : (index, index) -> index
        %259 = "math.expm1"(%116) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %260 = "bufferization.clone"(%238) : (memref<23xi16>) -> memref<23xi16>
        "memref.store"(%184, %70, %37) <{nontemporal = false}> : (i16, memref<23xi16>, index) -> ()
        %261 = "arith.cmpi"(%103, %183) <{predicate = 8 : i64}> : (i64, i64) -> i1
        %262 = "vector.matrix_multiply"(%218, %216) <{lhs_columns = 5 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<5xf32>, vector<5xf32>) -> vector<1xf32>
        "affine.store"(%104, %65, %18) <{map = affine_map<(d0) -> (d0)>}> : (i32, memref<5xi32>, index) -> ()
        "memref.alloca_scope.return"() : () -> ()
      }) : () -> ()
      %220 = "math.absi"(%112) : (i1) -> i1
      %221 = "index.shru"(%45, %41) : (index, index) -> index
      %222 = "arith.divsi"(%7, %152) : (i16, i16) -> i16
      "memref.tensor_store"(%58, %68) : (tensor<?xi16>, memref<?xi16>) -> ()
      %223 = "memref.alloca"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<22xi16>
      %224 = "arith.mulf"(%155, %149) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      "affine.store"(%104, %69, %28) <{map = affine_map<(d0) -> (d0)>}> : (i32, memref<?xi32>, index) -> ()
      %225 = "arith.xori"(%173, %150) : (i1, i1) -> i1
      %226 = "tensor.empty"() : () -> tensor<22x3xf16>
      %227 = "tensor.empty"() : () -> tensor<5x3xf16>
      %228 = "linalg.matmul"(%159, %226, %227) <{operandSegmentSizes = array<i32: 2, 1>}> ({
      ^bb0(%arg2: f16, %arg3: f16, %arg4: f16):
        %232 = "arith.mulf"(%arg2, %arg3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %233 = "arith.addf"(%arg4, %232) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        "linalg.yield"(%233) : (f16) -> ()
      }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<5x22xf16>, tensor<22x3xf16>, tensor<5x3xf16>) -> tensor<5x3xf16>
      %229 = "arith.shli"(%10, %15) : (i1, i1) -> i1
      %230 = "index.ceildivs"(%182, %114) : (index, index) -> index
      %231 = "affine.max"(%45, %38) <{map = affine_map<(d0)[s0] -> (((d0 floordiv 128) * 2 + 32) ceildiv 32)>}> : (index, index) -> index
      "scf.yield"(%175) : (f32) -> ()
    }) : (f32) -> f32
    %192 = "math.expm1"(%1) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %193 = "bufferization.to_memref"(%58) : (tensor<?xi16>) -> memref<?xi16>
    %194 = "affine.apply"(%20, %28) <{map = affine_map<(d0, d1) -> (-(((d0 - 1) ceildiv 8) ceildiv 16))>}> : (index, index) -> index
    %195 = "spirv.LogicalNotEqual"(%129, %10) : (i1, i1) -> i1
    %196 = "vector.load"(%67, %16, %16, %16) : (memref<?x?x?xf32>, index, index, index) -> vector<22xf32>
    %197 = "math.absi"(%9) : (i1) -> i1
    %198 = "spirv.FOrdGreaterThanEqual"(%116, %147) : (f32, f32) -> i1
    %199 = "tensor.unpack"(%141, %142) <{inner_dims_pos = array<i64>, static_inner_tiles = array<i64>}> : (tensor<f16>, tensor<f16>) -> tensor<f16>
    "memref.alloca_scope"() ({
      %215 = "vector.extract"(%105) <{static_position = array<i64: 0>}> : (vector<2xi32>) -> i32
      %216 = "math.exp2"(%97) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %217 = "math.atan"(%48) <{fastmath = #arith.fastmath<none>}> : (tensor<?x?x?xf32>) -> tensor<?x?x?xf32>
      "scf.execute_region"() ({
        %244 = "affine.load"(%73, %40) <{map = affine_map<(d0) -> (d0)>}> : (memref<?xi64>, index) -> i64
        "affine.store"(%82, %79, %45) <{map = affine_map<(d0) -> (d0)>}> : (f16, memref<5xf16>, index) -> ()
        %245 = "vector.broadcast"(%184) : (i16) -> vector<5xi16>
        %246 = "vector.broadcast"(%15) : (i1) -> vector<5xi1>
        %247 = "vector.maskedload"(%68, %16, %246, %245) : (memref<?xi16>, index, vector<5xi1>, vector<5xi16>) -> vector<5xi16>
        %248 = "arith.remsi"(%184, %4) : (i16, i16) -> i16
        %249 = "arith.cmpf"(%13, %116) <{predicate = 0 : i64}> : (f32, f32) -> i1
        %250 = "math.round"(%62) <{fastmath = #arith.fastmath<none>}> : (tensor<3x5x3xf32>) -> tensor<3x5x3xf32>
        %251 = "arith.mulf"(%149, %123) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %252 = "index.castu"(%183) : (i64) -> index
        %253 = "arith.mulf"(%162, %91) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %254 = "vector.extract"(%246) <{static_position = array<i64: 1>}> : (vector<5xi1>) -> i1
        %255 = "index.add"(%178, %20) : (index, index) -> index
        %256 = "index.ceildivu"(%arg0, %90) : (index, index) -> index
        %257 = "vector.broadcast"(%164) : (i1) -> vector<2xi1>
        "vector.compressstore"(%65, %17, %257, %105) : (memref<5xi32>, index, vector<2xi1>, vector<2xi32>) -> ()
        %258 = "index.casts"(%22) : (index) -> i32
        %259 = "vector.extract_strided_slice"(%247) <{offsets = [2], sizes = [1], strides = [1]}> : (vector<5xi16>) -> vector<1xi16>
        %260 = "index.maxs"(%22, %19) : (index, index) -> index
        "scf.yield"() : () -> ()
      }) : () -> ()
      %218 = "arith.shrsi"(%183, %0) : (i64, i64) -> i64
      %219 = "scf.if"(%10) ({
        %244 = "tensor.empty"(%arg0) : (index) -> tensor<?x5xf16>
        %245 = "linalg.broadcast"(%53, %244) <{dimensions = array<i64: 1>}> ({
        ^bb0(%arg1: f16, %arg2: f16):
          "linalg.yield"(%arg1) : (f16) -> ()
        }) : (tensor<?xf16>, tensor<?x5xf16>) -> tensor<?x5xf16>
        %246 = "tensor.empty"() : () -> tensor<i1>
        %247 = "linalg.dot"(%74, %74, %246) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg1: i1, %arg2: i1, %arg3: i1):
          %254 = "arith.andi"(%arg1, %arg2) : (i1, i1) -> i1
          %255 = "arith.ori"(%arg3, %254) : (i1, i1) -> i1
          "linalg.yield"(%255) : (i1) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>]} : (memref<23xi1>, memref<23xi1>, tensor<i1>) -> tensor<i1>
        %248 = "memref.atomic_rmw"(%104, %71, %33) <{kind = 7 : i64}> : (i32, memref<22xi32>, index) -> i32
        %249 = "vector.multi_reduction"(%188, %188) <{kind = #vector.kind<minsi>, reduction_dims = []}> : (vector<23xi16>, vector<23xi16>) -> vector<23xi16>
        %250 = "arith.mulf"(%155, %176) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %251 = "math.log"(%167) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %252 = "math.cttz"(%173) : (i1) -> i1
        %253 = "vector.bitcast"(%153) : (vector<1xi1>) -> vector<1xi1>
        "scf.yield"(%10) : (i1) -> ()
      }, {
        %244 = "index.mul"(%47, %42) : (index, index) -> index
        %245 = "arith.cmpf"(%167, %175) <{predicate = 3 : i64}> : (f32, f32) -> i1
        %246 = "arith.ceildivsi"(%103, %6) : (i64, i64) -> i64
        %247 = "arith.divui"(%134, %133) : (i64, i64) -> i64
        %248 = "arith.cmpf"(%14, %176) <{predicate = 12 : i64}> : (f32, f32) -> i1
        %249 = "math.atan"(%176) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %250 = "vector.broadcast"(%0) : (i64) -> vector<3x5xi64>
        %251:2 = "vector.scan"(%187, %250) <{inclusive = true, kind = #vector.kind<mul>, reduction_dim = 2 : i64}> : (vector<3x5x3xi64>, vector<3x5xi64>) -> (vector<3x5x3xi64>, vector<3x5xi64>)
        %252 = "index.shru"(%27, %28) : (index, index) -> index
        "scf.yield"(%150) : (i1) -> ()
      }) : (i1) -> i1
      %220 = "bufferization.clone"(%79) : (memref<5xf16>) -> memref<5xf16>
      %221 = "index.divs"(%31, %125) : (index, index) -> index
      %222 = "memref.atomic_rmw"(%7, %193, %16) <{kind = 2 : i64}> : (i16, memref<?xi16>, index) -> i16
      %223 = "arith.negf"(%117) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %224 = "tensor.from_elements"(%93, %82, %158, %93, %82, %93, %158, %93, %158, %82, %93, %82, %93, %93, %82, %82, %158, %82, %158, %158, %93, %158) : (f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16) -> tensor<22xf16>
      "memref.store"(%135, %67, %16, %16, %16) <{nontemporal = false}> : (f32, memref<?x?x?xf32>, index, index, index) -> ()
      "affine.for"() <{lowerBoundMap = affine_map<() -> (0)>, operandSegmentSizes = array<i32: 0, 0, 0>, step = 1 : index, upperBoundMap = affine_map<() -> (41)>}> ({
      ^bb0(%arg1: index):
        "affine.yield"() : () -> ()
      }) : () -> ()
      %225 = "arith.ori"(%184, %184) : (i16, i16) -> i16
      %226 = "math.atan"(%117) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %227 = "affine.apply"(%16, %121) <{map = affine_map<(d0)[s0] -> ((d0 + -d0 - 32) floordiv 32)>}> : (index, index) -> index
      %228 = "index.divu"(%21, %43) : (index, index) -> index
      %229 = "vector.extract"(%83) <{static_position = array<i64: 0>}> : (vector<1xf16>) -> f16
      %230 = "affine.apply"(%114, %28) <{map = affine_map<(d0)[s0] -> (((-(d0 ceildiv 8)) ceildiv 64) * -2)>}> : (index, index) -> index
      %231 = "vector.transpose"(%196) <{transp = [0]}> : (vector<22xf32>) -> vector<22xf32>
      %232 = "tensor.empty"(%111, %42) : (index, index) -> tensor<3x?x?xi32>
      %233 = "arith.addf"(%140, %149) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %234 = "math.cttz"(%134) : (i64) -> i64
      %235 = "arith.andi"(%94, %183) : (i64, i64) -> i64
      %236 = "vector.create_mask"(%31) : (index) -> vector<23xi1>
      %237 = "index.shru"(%221, %139) : (index, index) -> index
      %238 = "math.exp2"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
      %239 = "tensor.dim"(%61, %16) : (tensor<?xf32>, index) -> index
      %240 = "index.ceildivs"(%17, %37) : (index, index) -> index
      %241 = "vector.contract"(%236, %236, %219) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<xor>}> : (vector<23xi1>, vector<23xi1>, i1) -> i1
      %242 = "scf.index_switch"(%178) <{cases = array<i64: 1, 2, 3>}> ({
        %244 = "affine.load"(%72, %36) <{map = affine_map<(d0) -> (d0)>}> : (memref<?xi32>, index) -> i32
        %245 = "arith.andi"(%152, %184) : (i16, i16) -> i16
        %246 = "arith.mulf"(%171, %110) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %247 = "arith.shrsi"(%134, %103) : (i64, i64) -> i64
