"builtin.module"() ({
  "func.func"() <{function_type = (index, index) -> tensor<14xf16>, sym_name = "func1"}> ({
  ^bb0(%arg0: index, %arg1: index):
    %0 = "arith.constant"() <{value = false}> : () -> i1
    %1 = "arith.constant"() <{value = 1311575282 : i64}> : () -> i64
    %2 = "arith.constant"() <{value = 2396 : i16}> : () -> i16
    %3 = "arith.constant"() <{value = 4.726400e+04 : f16}> : () -> f16
    %4 = "arith.constant"() <{value = true}> : () -> i1
    %5 = "arith.constant"() <{value = 0x4DB3FBE6 : f32}> : () -> f32
    %6 = "arith.constant"() <{value = 1501104072 : i64}> : () -> i64
    %7 = "arith.constant"() <{value = -1313 : i16}> : () -> i16
    %8 = "arith.constant"() <{value = 25298 : i16}> : () -> i16
    %9 = "arith.constant"() <{value = 998280035 : i64}> : () -> i64
    %10 = "arith.constant"() <{value = 1.8901536E+9 : f32}> : () -> f32
    %11 = "arith.constant"() <{value = false}> : () -> i1
    %12 = "arith.constant"() <{value = false}> : () -> i1
    %13 = "arith.constant"() <{value = 1421570586 : i32}> : () -> i32
    %14 = "arith.constant"() <{value = 1179905772 : i64}> : () -> i64
    %15 = "arith.constant"() <{value = 7.576000e+03 : f16}> : () -> f16
    %16 = "arith.constant"() <{value = 0 : index}> : () -> index
    %17 = "arith.constant"() <{value = 1 : index}> : () -> index
    %18 = "arith.constant"() <{value = 2 : index}> : () -> index
    %19 = "arith.constant"() <{value = 3 : index}> : () -> index
    %20 = "arith.constant"() <{value = 4 : index}> : () -> index
    %21 = "arith.constant"() <{value = 5 : index}> : () -> index
    %22 = "arith.constant"() <{value = 6 : index}> : () -> index
    %23 = "arith.constant"() <{value = 7 : index}> : () -> index
    %24 = "arith.constant"() <{value = 8 : index}> : () -> index
    %25 = "arith.constant"() <{value = 9 : index}> : () -> index
    %26 = "arith.constant"() <{value = 10 : index}> : () -> index
    %27 = "arith.constant"() <{value = 11 : index}> : () -> index
    %28 = "arith.constant"() <{value = 12 : index}> : () -> index
    %29 = "arith.constant"() <{value = 13 : index}> : () -> index
    %30 = "arith.constant"() <{value = 14 : index}> : () -> index
    %31 = "arith.constant"() <{value = 15 : index}> : () -> index
    %32 = "arith.constant"() <{value = 16 : index}> : () -> index
    %33 = "arith.constant"() <{value = 17 : index}> : () -> index
    %34 = "arith.constant"() <{value = 18 : index}> : () -> index
    %35 = "arith.constant"() <{value = 19 : index}> : () -> index
    %36 = "arith.constant"() <{value = 20 : index}> : () -> index
    %37 = "arith.constant"() <{value = 21 : index}> : () -> index
    %38 = "arith.constant"() <{value = 22 : index}> : () -> index
    %39 = "arith.constant"() <{value = 23 : index}> : () -> index
    %40 = "arith.constant"() <{value = 24 : index}> : () -> index
    %41 = "arith.constant"() <{value = 25 : index}> : () -> index
    %42 = "arith.constant"() <{value = 26 : index}> : () -> index
    %43 = "arith.constant"() <{value = 27 : index}> : () -> index
    %44 = "arith.constant"() <{value = 28 : index}> : () -> index
    %45 = "arith.constant"() <{value = 29 : index}> : () -> index
    %46 = "arith.constant"() <{value = 30 : index}> : () -> index
    %47 = "arith.constant"() <{value = 31 : index}> : () -> index
    %48 = "tensor.empty"(%45) : (index) -> tensor<?x14xi16>
    %49 = "tensor.empty"() : () -> tensor<14xi64>
    %50 = "tensor.empty"(%39) : (index) -> tensor<?xi16>
    %51 = "tensor.empty"() : () -> tensor<10xi32>
    %52 = "tensor.empty"(%27) : (index) -> tensor<?xi32>
    %53 = "tensor.empty"() : () -> tensor<10xf16>
    %54 = "tensor.empty"(%21) : (index) -> tensor<?xi32>
    %55 = "tensor.empty"(%39, %42) : (index, index) -> tensor<?x?xi1>
    %56 = "tensor.empty"(%40) : (index) -> tensor<?xf16>
    %57 = "tensor.empty"(%28) : (index) -> tensor<?xi16>
    %58 = "tensor.empty"(%arg1) : (index) -> tensor<?xi32>
    %59 = "tensor.empty"(%34) : (index) -> tensor<?xf32>
    %60 = "tensor.empty"() : () -> tensor<12x14xi16>
    %61 = "tensor.empty"() : () -> tensor<10xf32>
    %62 = "tensor.empty"() : () -> tensor<10xi16>
    %63 = "tensor.empty"(%18) : (index) -> tensor<?xf32>
    %64 = "memref.alloc"(%38) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xf32>
    %65 = "memref.alloc"(%31, %42) <{operandSegmentSizes = array<i32: 2, 0>}> : (index, index) -> memref<?x?xi16>
    %66 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<14xi32>
    %67 = "memref.alloc"(%45) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi1>
    %68 = "memref.alloc"(%37) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xf16>
    %69 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<12x14xi1>
    %70 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<10xi1>
    %71 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<10xf16>
    %72 = "memref.alloc"(%16) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi64>
    %73 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<14xi1>
    %74 = "memref.alloc"(%34) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
    %75 = "memref.alloc"(%33) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi1>
    %76 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<10xf16>
    %77 = "memref.alloc"(%36) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x14xi1>
    %78 = "memref.alloc"(%39) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi1>
    %79 = "memref.alloc"(%37) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi1>
    %80 = "index.add"(%27, %27) : (index, index) -> index
    %81 = "spirv.LogicalEqual"(%0, %12) : (i1, i1) -> i1
    %82 = "spirv.SLessThanEqual"(%14, %1) : (i64, i64) -> i1
    %83 = "math.round"(%56) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
    %84 = "arith.cmpi"(%13, %13) <{predicate = 5 : i64}> : (i32, i32) -> i1
    %85 = "spirv.LogicalOr"(%81, %12) : (i1, i1) -> i1
    %86 = "vector.broadcast"(%9) : (i64) -> vector<10xi64>
    %87 = "vector.reduction"(%86) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<minsi>}> : (vector<10xi64>) -> i64
    %88 = "spirv.SGreaterThan"(%2, %7) : (i16, i16) -> i1
    "scf.if"(%11) ({
      %213 = "arith.remf"(%5, %10) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %214 = "tensor.empty"() : () -> tensor<14xi32>
      %215 = "vector.broadcast"(%13) : (i32) -> vector<10xi32>
      %216 = "vector.broadcast"(%0) : (i1) -> vector<10xi1>
      %217 = "vector.gather"(%214, %37, %215, %216, %215) : (tensor<14xi32>, index, vector<10xi32>, vector<10xi1>, vector<10xi32>) -> vector<10xi32>
      %218 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<14xi1>
      %219 = "tensor.dim"(%63, %16) : (tensor<?xf32>, index) -> index
      %220 = "scf.index_switch"(%38) <{cases = array<i64: 1>}> ({
        %223 = "math.rsqrt"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        "memref.store"(%88, %78, %16) <{nontemporal = false}> : (i1, memref<?xi1>, index) -> ()
        %224 = "vector.contract"(%217, %215, %13) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<xor>}> : (vector<10xi32>, vector<10xi32>, i32) -> i32
        %225 = "memref.cast"(%73) : (memref<14xi1>) -> memref<14xi1>
        %226 = "memref.alloc"(%31) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xf16>
        %227 = "affine.apply"(%41, %44, %40) <{map = affine_map<(d0, d1, d2) -> ((-d0) mod 128)>}> : (index, index, index) -> index
        %228 = "index.xor"(%31, %40) : (index, index) -> index
        %229 = "tensor.from_elements"(%15, %3, %3, %15, %3, %15, %3, %15, %15, %15) : (f16, f16, f16, f16, f16, f16, f16, f16, f16, f16) -> tensor<10xf16>
        %230 = "tensor.collapse_shape"(%48) <{reassociation = [[0, 1]]}> : (tensor<?x14xi16>) -> tensor<?xi16>
        %231 = "index.maxu"(%227, %45) : (index, index) -> index
        %232 = "tensor.rank"(%55) : (tensor<?x?xi1>) -> index
        %233 = "arith.constant"() <{value = 0 : i64}> : () -> i64
        %234 = "vector.transfer_read"(%72, %36, %233) <{operandSegmentSizes = array<i32: 1, 1, 1, 0>, permutation_map = affine_map<(d0) -> ()>}> : (memref<?xi64>, index, i64) -> vector<i64>
        %235 = "index.divu"(%29, %232) : (index, index) -> index
        %236 = "index.maxu"(%227, %44) : (index, index) -> index
        %237 = "affine.vector_load"(%75, %24) <{map = affine_map<(d0) -> (d0)>}> : (memref<?xi1>, index) -> vector<26xi1>
        %238 = "index.shrs"(%235, %44) : (index, index) -> index
        %239 = "tensor.empty"(%80) : (index) -> tensor<?x14xi32>
        "scf.yield"(%239) : (tensor<?x14xi32>) -> ()
      }, {
        %223 = "math.ceil"(%63) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %224 = "tensor.rank"(%62) : (tensor<10xi16>) -> index
        "memref.assume_alignment"(%73) <{alignment = 1 : i32}> : (memref<14xi1>) -> ()
        %225 = "vector.load"(%66, %16) : (memref<14xi32>, index) -> vector<12x14xi32>
        %226 = "index.ceildivs"(%80, %80) : (index, index) -> index
        %227 = "vector.insert"(%13, %215) <{static_position = array<i64: 7>}> : (i32, vector<10xi32>) -> vector<10xi32>
        %228 = "math.fpowi"(%61, %51) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf32>, tensor<10xi32>) -> tensor<10xf32>
        %229 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<14x14xi16>
        %230 = "linalg.matmul"(%60, %229, %60) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg2: i16, %arg3: i16, %arg4: i16):
          %242 = "arith.muli"(%arg2, %arg3) : (i16, i16) -> i16
          %243 = "arith.addi"(%arg4, %242) : (i16, i16) -> i16
          "linalg.yield"(%243) : (i16) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<12x14xi16>, memref<14x14xi16>, tensor<12x14xi16>) -> tensor<12x14xi16>
        %231 = "arith.cmpi"(%85, %85) <{predicate = 8 : i64}> : (i1, i1) -> i1
        %232 = "math.ctpop"(%62) : (tensor<10xi16>) -> tensor<10xi16>
        %233 = "math.exp2"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %234 = "index.divs"(%219, %28) : (index, index) -> index
        %235 = "tensor.empty"() : () -> tensor<14x10xi16>
        %236 = "tensor.empty"(%36) : (index) -> tensor<?x10xi16>
        %237 = "linalg.matmul"(%48, %235, %236) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg2: i16, %arg3: i16, %arg4: i16):
          %242 = "arith.muli"(%arg2, %arg3) : (i16, i16) -> i16
          %243 = "arith.addi"(%arg4, %242) : (i16, i16) -> i16
          "linalg.yield"(%243) : (i16) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<?x14xi16>, tensor<14x10xi16>, tensor<?x10xi16>) -> tensor<?x10xi16>
        %238 = "math.rsqrt"(%63) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %239 = "tensor.collapse_shape"(%236) <{reassociation = [[0, 1]]}> : (tensor<?x10xi16>) -> tensor<?xi16>
        %240 = "math.rsqrt"(%56) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
        %241 = "tensor.empty"(%18) : (index) -> tensor<?x14xi32>
        "scf.yield"(%241) : (tensor<?x14xi32>) -> ()
      }) : (index) -> tensor<?x14xi32>
      "vector.warp_execute_on_lane_0"(%16) <{warp_size = 32 : i64}> ({
        %223 = "arith.addf"(%5, %5) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %224 = "vector.load"(%69, %27, %22) : (memref<12x14xi1>, index, index) -> vector<10xi1>
        %225 = "index.mul"(%31, %32) : (index, index) -> index
        %226 = "vector.transpose"(%217) <{transp = [0]}> : (vector<10xi32>) -> vector<10xi32>
        %227 = "math.ctpop"(%60) : (tensor<12x14xi16>) -> tensor<12x14xi16>
        %228 = "math.round"(%3) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        "vector.print"(%215) <{punctuation = #vector.punctuation<newline>}> : (vector<10xi32>) -> ()
        %229 = "index.shl"(%19, %20) : (index, index) -> index
        "vector.yield"() : () -> ()
      }) : (index) -> ()
      %221 = "memref.atomic_rmw"(%2, %65, %16, %16) <{kind = 10 : i64}> : (i16, memref<?x?xi16>, index, index) -> i16
      %222 = "index.ceildivs"(%45, %19) : (index, index) -> index
      "scf.yield"() : () -> ()
    }, {
      %213 = "index.maxu"(%45, %41) : (index, index) -> index
      %214 = "vector.broadcast"(%13) : (i32) -> vector<1xi32>
      %215 = "vector.multi_reduction"(%214, %214) <{kind = #vector.kind<minui>, reduction_dims = []}> : (vector<1xi32>, vector<1xi32>) -> vector<1xi32>
      %216 = "math.ceil"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf16>) -> tensor<10xf16>
      "scf.if"(%81) ({
        %221 = "math.cttz"(%11) : (i1) -> i1
        %222 = "arith.addf"(%5, %10) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %223 = "arith.negf"(%5) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %224 = "arith.mulf"(%10, %10) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %225 = "math.rsqrt"(%63) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %226 = "math.ctpop"(%48) : (tensor<?x14xi16>) -> tensor<?x14xi16>
        %227 = "index.maxu"(%23, %32) : (index, index) -> index
        %228 = "math.rsqrt"(%15) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        "scf.yield"() : () -> ()
      }, {
        %221 = "memref.atomic_rmw"(%3, %76, %18) <{kind = 2 : i64}> : (f16, memref<10xf16>, index) -> f16
        %222 = "index.bool.constant"() <{value = false}> : () -> i1
        %223 = "index.ceildivs"(%26, %36) : (index, index) -> index
        %224 = "arith.floordivsi"(%14, %6) : (i64, i64) -> i64
        %225 = "index.castu"(%14) : (i64) -> index
        %226 = "arith.addf"(%10, %10) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %227 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<12x14xi16>
        "memref.tensor_store"(%60, %227) : (tensor<12x14xi16>, memref<12x14xi16>) -> ()
        %228 = "arith.ori"(%6, %14) : (i64, i64) -> i64
        "scf.yield"() : () -> ()
      }) : (i1) -> ()
      %217 = "tensor.rank"(%53) : (tensor<10xf16>) -> index
      %218 = "affine.for"(%55) <{lowerBoundMap = affine_map<() -> (0)>, operandSegmentSizes = array<i32: 0, 0, 1>, step = 1 : index, upperBoundMap = affine_map<() -> (101)>}> ({
      ^bb0(%arg2: index, %arg3: tensor<?x?xi1>):
        %221 = "tensor.empty"(%22, %47) : (index, index) -> tensor<?x?xi1>
        "affine.yield"(%221) : (tensor<?x?xi1>) -> ()
      }) : (tensor<?x?xi1>) -> tensor<?x?xi1>
      %219 = "arith.mulf"(%15, %3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %220 = "affine.max"(%24, %33, %47, %27, %29) <{map = affine_map<(d0, d1, d2, d3)[s0] -> (0)>}> : (index, index, index, index, index) -> index
      "scf.yield"() : () -> ()
    }) : (i1) -> ()
    %89 = "tensor.extract"(%60, %25, %19) : (tensor<12x14xi16>, index, index) -> i16
    %90 = "spirv.GL.FMax"(%15, %3) : (f16, f16) -> f16
    %91 = "spirv.UGreaterThanEqual"(%1, %6) : (i64, i64) -> i1
    %92 = "vector.load"(%66, %27) : (memref<14xi32>, index) -> vector<14xi32>
    %93 = "vector.reduction"(%92) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<maxsi>}> : (vector<14xi32>) -> i32
    %94 = "spirv.CL.round"(%15) : (f16) -> f16
    %95 = "linalg.copy"(%54, %52) <{operandSegmentSizes = array<i32: 1, 1>}> ({
    ^bb0(%arg2: i32, %arg3: i32):
      "linalg.yield"(%arg2) : (i32) -> ()
    }) : (tensor<?xi32>, tensor<?xi32>) -> tensor<?xi32>
    "affine.for"() <{lowerBoundMap = affine_map<() -> (0)>, operandSegmentSizes = array<i32: 0, 0, 0>, step = 1 : index, upperBoundMap = affine_map<() -> (44)>}> ({
    ^bb0(%arg2: index):
      "affine.yield"() : () -> ()
    }) : () -> ()
    %96 = "memref.alloca"(%43) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
    %97 = "vector.broadcast"(%10) : (f32) -> vector<14xf32>
    %98 = "vector.fma"(%97, %97, %97) : (vector<14xf32>, vector<14xf32>, vector<14xf32>) -> vector<14xf32>
    %99 = "spirv.CL.floor"(%3) : (f16) -> f16
    %100 = "spirv.CL.cos"(%90) : (f16) -> f16
    %101 = "vector.broadcast"(%85) : (i1) -> vector<14xi1>
    %102 = "vector.mask"(%101) ({
      %213 = "vector.multi_reduction"(%92, %92) <{kind = #vector.kind<xor>, reduction_dims = []}> : (vector<14xi32>, vector<14xi32>) -> vector<14xi32>
      "vector.yield"(%213) : (vector<14xi32>) -> ()
    }) : (vector<14xi1>) -> vector<14xi32>
    %103 = "vector.broadcast"(%13) : (i32) -> vector<2xi32>
    %104 = "spirv.BitwiseXor"(%103, %103) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %105 = "vector.extract"(%97) <{static_position = array<i64: 6>}> : (vector<14xf32>) -> f32
    %106 = "index.bool.constant"() <{value = true}> : () -> i1
    %107 = "vector.broadcast"(%11) : (i1) -> vector<10xi1>
    "vector.transfer_write"(%107, %69, %24, %arg1) <{operandSegmentSizes = array<i32: 1, 1, 2, 0>, permutation_map = affine_map<(d0, d1) -> (d0)>}> : (vector<10xi1>, memref<12x14xi1>, index, index) -> ()
    %108 = "spirv.GL.Cos"(%15) : (f16) -> f16
    "scf.index_switch"(%30) <{cases = array<i64: 1, 2>}> ({
      %213 = "vector.mask"(%107) ({
        %230 = "vector.multi_reduction"(%107, %107) <{kind = #vector.kind<mul>, reduction_dims = []}> : (vector<10xi1>, vector<10xi1>) -> vector<10xi1>
        "vector.yield"(%230) : (vector<10xi1>) -> ()
      }) : (vector<10xi1>) -> vector<10xi1>
      %214 = "arith.remf"(%90, %94) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %215 = "arith.xori"(%12, %91) : (i1, i1) -> i1
      %216 = "index.divs"(%arg1, %27) : (index, index) -> index
      %217 = "memref.realloc"(%72) : (memref<?xi64>) -> memref<26xi64>
      %218 = "vector.shuffle"(%97, %97) <{mask = [1, 3, 4, 7, 8, 12, 14, 15, 19, 21, 24]}> : (vector<14xf32>, vector<14xf32>) -> vector<11xf32>
      %219 = "memref.realloc"(%73) : (memref<14xi1>) -> memref<10xi1>
      %220 = "arith.negf"(%100) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %221 = "arith.xori"(%81, %11) : (i1, i1) -> i1
      %222 = "vector.broadcast"(%5) : (f32) -> vector<14xf32>
      %223 = "vector.fma"(%222, %97, %98) : (vector<14xf32>, vector<14xf32>, vector<14xf32>) -> vector<14xf32>
      %224 = "affine.apply"(%arg0, %35) <{map = affine_map<(d0)[s0] -> (d0 * 128)>}> : (index, index) -> index
      %225 = "memref.alloca_scope"() ({
        %230 = "affine.min"(%16, %21, %17) <{map = affine_map<(d0, d1, d2) -> ((-d0) mod 128)>}> : (index, index, index) -> index
        %231 = "index.shrs"(%45, %26) : (index, index) -> index
        %232 = "math.log2"(%100) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %233 = "vector.transpose"(%222) <{transp = [0]}> : (vector<14xf32>) -> vector<14xf32>
        %234 = "vector.create_mask"(%21, %33) : (index, index) -> vector<12x14xi1>
        %235 = "index.shl"(%40, %231) : (index, index) -> index
        %236 = "index.ceildivu"(%37, %30) : (index, index) -> index
        %237 = "math.expm1"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf32>) -> tensor<10xf32>
        %238 = "tensor.collapse_shape"(%48) <{reassociation = [[0, 1]]}> : (tensor<?x14xi16>) -> tensor<?xi16>
        %239 = "arith.floordivsi"(%14, %6) : (i64, i64) -> i64
        "affine.store"(%14, %72, %47) <{map = affine_map<(d0) -> (d0)>}> : (i64, memref<?xi64>, index) -> ()
        %240 = "index.xor"(%38, %arg1) : (index, index) -> index
        %241 = "math.round"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf16>) -> tensor<10xf16>
        %242 = "arith.shrui"(%11, %81) : (i1, i1) -> i1
        %243 = "vector.reduction"(%98) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<maxf>}> : (vector<14xf32>) -> f32
        %244 = "affine.min"(%30, %19, %80, %18) <{map = affine_map<(d0, d1, d2, d3) -> (d2 + d1)>}> : (index, index, index, index) -> index
        %245 = "memref.atomic_rmw"(%13, %66, %17) <{kind = 10 : i64}> : (i32, memref<14xi32>, index) -> i32
        %246 = "index.maxu"(%17, %45) : (index, index) -> index
        %247 = "math.log1p"(%3) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %248 = "arith.mulf"(%5, %5) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %249 = "tensor.insert"(%10, %61, %16) : (f32, tensor<10xf32>, index) -> tensor<10xf32>
        %250 = "vector.reduction"(%103) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<or>}> : (vector<2xi32>) -> i32
        %251 = "index.castu"(%0) : (i1) -> index
        %252 = "math.log1p"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf16>) -> tensor<10xf16>
        %253 = "math.ipowi"(%9, %9) : (i64, i64) -> i64
        %254 = "index.divu"(%26, %47) : (index, index) -> index
        %255 = "vector.matrix_multiply"(%97, %223) <{lhs_columns = 14 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<14xf32>, vector<14xf32>) -> vector<1xf32>
        %256 = "math.ctpop"(%91) : (i1) -> i1
        %257 = "bufferization.to_tensor"(%78) : (memref<?xi1>) -> tensor<?xi1>
        %258 = "arith.negf"(%94) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %259 = "memref.atomic_rmw"(%94, %68, %16) <{kind = 2 : i64}> : (f16, memref<?xf16>, index) -> f16
        %260 = "vector.extract_strided_slice"(%98) <{offsets = [2], sizes = [3], strides = [1]}> : (vector<14xf32>) -> vector<3xf32>
        %261 = "tensor.empty"(%231) : (index) -> tensor<?xi64>
        "memref.alloca_scope.return"(%261) : (tensor<?xi64>) -> ()
      }) : () -> tensor<?xi64>
      %226 = "index.maxu"(%224, %26) : (index, index) -> index
      %227 = "bufferization.to_tensor"(%67) : (memref<?xi1>) -> tensor<?xi1>
      %228 = "memref.cast"(%72) : (memref<?xi64>) -> memref<14xi64>
      %229 = "index.mul"(%26, %33) : (index, index) -> index
      "scf.yield"() : () -> ()
    }, {
      %213 = "arith.ori"(%12, %91) : (i1, i1) -> i1
      %214 = "index.divs"(%19, %29) : (index, index) -> index
      %215 = "arith.shli"(%14, %1) : (i64, i64) -> i64
      %216 = "vector.multi_reduction"(%97, %10) <{kind = #vector.kind<add>, reduction_dims = [0]}> : (vector<14xf32>, f32) -> f32
      "memref.copy"(%71, %76) : (memref<10xf16>, memref<10xf16>) -> ()
      %217 = "vector.shuffle"(%92, %103) <{mask = [1, 2, 3, 5, 7, 8, 9, 10]}> : (vector<14xi32>, vector<2xi32>) -> vector<8xi32>
      %218 = "index.ceildivs"(%80, %25) : (index, index) -> index
      %219 = "vector.flat_transpose"(%97) <{columns = 7 : i32, rows = 2 : i32}> : (vector<14xf32>) -> vector<14xf32>
      %220 = "bufferization.to_tensor"(%72) : (memref<?xi64>) -> tensor<?xi64>
      %221 = "vector.matrix_multiply"(%98, %98) <{lhs_columns = 14 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<14xf32>, vector<14xf32>) -> vector<1xf32>
      %222 = "math.atan2"(%61, %61) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf32>, tensor<10xf32>) -> tensor<10xf32>
      %223 = "math.exp"(%3) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %224 = "arith.divsi"(%0, %106) : (i1, i1) -> i1
      %225 = "bufferization.to_memref"(%59) : (tensor<?xf32>) -> memref<?xf32>
      %226 = "vector.multi_reduction"(%107, %4) <{kind = #vector.kind<maxui>, reduction_dims = [0]}> : (vector<10xi1>, i1) -> i1
      %227 = "math.exp2"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf32>) -> tensor<10xf32>
      "scf.yield"() : () -> ()
    }, {
      %213 = "index.xor"(%40, %45) : (index, index) -> index
      %214 = "math.ctpop"(%8) : (i16) -> i16
      "scf.if"(%106) ({
        %227 = "arith.xori"(%82, %11) : (i1, i1) -> i1
        %228 = "arith.remf"(%15, %99) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %229 = "math.ctpop"(%51) : (tensor<10xi32>) -> tensor<10xi32>
        %230 = "math.round"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %231 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<10xi64>
        %232 = "index.divu"(%36, %42) : (index, index) -> index
        %233 = "math.absf"(%15) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %234 = "tensor.collapse_shape"(%48) <{reassociation = [[0, 1]]}> : (tensor<?x14xi16>) -> tensor<?xi16>
        "scf.yield"() : () -> ()
      }, {
        %227 = "arith.divf"(%3, %3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %228 = "index.shl"(%213, %29) : (index, index) -> index
        %229 = "vector.broadcast"(%10) : (f32) -> vector<14x14xf32>
        %230 = "vector.outerproduct"(%98, %98, %229) <{kind = #vector.kind<maxf>}> : (vector<14xf32>, vector<14xf32>, vector<14x14xf32>) -> vector<14x14xf32>
        %231 = "math.tan"(%5) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %232 = "vector.broadcast"(%10) : (f32) -> vector<10xf32>
        %233 = "vector.fma"(%232, %232, %232) : (vector<10xf32>, vector<10xf32>, vector<10xf32>) -> vector<10xf32>
        %234 = "arith.mulf"(%100, %3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %235 = "vector.extract_strided_slice"(%107) <{offsets = [0], sizes = [5], strides = [1]}> : (vector<10xi1>) -> vector<5xi1>
        %236 = "memref.atomic_rmw"(%13, %66, %19) <{kind = 8 : i64}> : (i32, memref<14xi32>, index) -> i32
        "scf.yield"() : () -> ()
      }) : (i1) -> ()
      %215 = "arith.mulf"(%94, %108) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %216 = "vector.broadcast"(%10) : (f32) -> vector<14x14xf32>
      %217 = "vector.outerproduct"(%97, %97, %216) <{kind = #vector.kind<add>}> : (vector<14xf32>, vector<14xf32>, vector<14x14xf32>) -> vector<14x14xf32>
      %218 = "vector.shuffle"(%97, %98) <{mask = [4, 9, 10, 11, 15, 16, 18, 19, 23, 26]}> : (vector<14xf32>, vector<14xf32>) -> vector<10xf32>
      %219 = "memref.atomic_rmw"(%108, %71, %18) <{kind = 9 : i64}> : (f16, memref<10xf16>, index) -> f16
      %220 = "vector.broadcast"(%9) : (i64) -> vector<12x14xi64>
      %221 = "math.exp2"(%90) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %222 = "math.log"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
      "affine.vector_store"(%107, %75, %37) <{map = affine_map<(d0) -> (d0)>}> : (vector<10xi1>, memref<?xi1>, index) -> ()
      "memref.copy"(%69, %69) : (memref<12x14xi1>, memref<12x14xi1>) -> ()
      %223 = "bufferization.to_tensor"(%77) : (memref<?x14xi1>) -> tensor<?x14xi1>
      %224 = "linalg.transpose"(%52, %58) <{permutation = array<i64: 0>}> ({
      ^bb0(%arg2: i32, %arg3: i32):
        "linalg.yield"(%arg2) : (i32) -> ()
      }) : (tensor<?xi32>, tensor<?xi32>) -> tensor<?xi32>
      %225 = "index.maxu"(%19, %37) : (index, index) -> index
      %226 = "index.mul"(%31, %25) : (index, index) -> index
      "scf.yield"() : () -> ()
    }) : (index) -> ()
    %109 = "arith.ori"(%6, %1) : (i64, i64) -> i64
    %110 = "spirv.IsNan"(%94) : (f16) -> i1
    %111 = "vector.shuffle"(%103, %103) <{mask = [0, 2]}> : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %112 = "spirv.GL.UMax"(%9, %9) : (i64, i64) -> i64
    %113 = "vector.extract"(%97) <{static_position = array<i64: 1>}> : (vector<14xf32>) -> f32
    %114 = "spirv.FOrdGreaterThanEqual"(%15, %99) : (f16, f16) -> i1
    %115 = "spirv.FUnordLessThanEqual"(%15, %100) : (f16, f16) -> i1
    %116 = "vector.create_mask"(%33, %31) : (index, index) -> vector<12x14xi1>
    %117 = "math.log10"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf16>) -> tensor<10xf16>
    %118 = "spirv.GL.Cos"(%108) : (f16) -> f16
    %119 = "vector.flat_transpose"(%101) <{columns = 7 : i32, rows = 2 : i32}> : (vector<14xi1>) -> vector<14xi1>
    %120 = "affine.parallel"() <{lowerBoundsGroups = dense<1> : tensor<1xi32>, lowerBoundsMap = affine_map<() -> (0)>, reductions = [9], steps = [1], upperBoundsGroups = dense<1> : tensor<1xi32>, upperBoundsMap = affine_map<() -> (14)>}> ({
    ^bb0(%arg2: index):
      %213 = "math.round"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf16>) -> tensor<10xf16>
      "affine.yield"(%10) : (f32) -> ()
    }) : () -> memref<14xf32>
    %121 = "spirv.GL.SClamp"(%6, %1, %9) : (i64, i64, i64) -> i64
    %122 = "memref.cast"(%79) : (memref<?xi1>) -> memref<10xi1>
    %123 = "spirv.LogicalAnd"(%81, %115) : (i1, i1) -> i1
    %124 = "bufferization.to_memref"(%51) : (tensor<10xi32>) -> memref<10xi32>
    %125 = "linalg.copy"(%60, %60) <{operandSegmentSizes = array<i32: 1, 1>}> ({
    ^bb0(%arg2: i16, %arg3: i16):
      "linalg.yield"(%arg2) : (i16) -> ()
    }) : (tensor<12x14xi16>, tensor<12x14xi16>) -> tensor<12x14xi16>
    %126 = "tensor.generate"(%arg1) ({
    ^bb0(%arg2: index):
      %213 = "math.ipowi"(%114, %11) : (i1, i1) -> i1
      %214 = "memref.atomic_rmw"(%13, %124, %22) <{kind = 4 : i64}> : (i32, memref<10xi32>, index) -> i32
      %215 = "arith.cmpi"(%0, %0) <{predicate = 1 : i64}> : (i1, i1) -> i1
      %216 = "memref.alloca_scope"() ({
        %217 = "vector.broadcast"(%82) : (i1) -> vector<12x14xi1>
        %218 = "index.ceildivu"(%30, %80) : (index, index) -> index
        %219 = "index.bool.constant"() <{value = true}> : () -> i1
        %220 = "vector.broadcast"(%38) : (index) -> vector<26xindex>
        %221 = "vector.broadcast"(%115) : (i1) -> vector<26xi1>
        %222 = "vector.broadcast"(%108) : (f16) -> vector<26xf16>
        "vector.scatter"(%71, %18, %220, %221, %222) : (memref<10xf16>, index, vector<26xindex>, vector<26xi1>, vector<26xf16>) -> ()
        %223 = "memref.atomic_rmw"(%5, %120, %29) <{kind = 9 : i64}> : (f32, memref<14xf32>, index) -> f32
        %224 = "tensor.from_elements"(%5, %5, %5, %10, %5, %5, %5, %10, %10, %10) : (f32, f32, f32, f32, f32, f32, f32, f32, f32, f32) -> tensor<10xf32>
        %225 = "tensor.empty"() : () -> tensor<14xi32>
        %226 = "tensor.empty"() : () -> tensor<i32>
        %227 = "linalg.dot"(%66, %225, %226) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg3: i32, %arg4: i32, %arg5: i32):
          %249 = "arith.muli"(%arg3, %arg4) : (i32, i32) -> i32
          %250 = "arith.addi"(%arg5, %249) : (i32, i32) -> i32
          "linalg.yield"(%250) : (i32) -> ()
        }) : (memref<14xi32>, tensor<14xi32>, tensor<i32>) -> tensor<i32>
        %228 = "math.round"(%118) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %229 = "arith.subi"(%4, %4) : (i1, i1) -> i1
        %230 = "arith.addf"(%10, %5) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %231 = "math.expm1"(%63) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %232 = "math.roundeven"(%108) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %233 = "vector.transpose"(%217) <{transp = [1, 0]}> : (vector<12x14xi1>) -> vector<14x12xi1>
        "memref.copy"(%64, %64) : (memref<?xf32>, memref<?xf32>) -> ()
        %234 = "vector.insert"(%13, %103) <{static_position = array<i64: 1>}> : (i32, vector<2xi32>) -> vector<2xi32>
        "bufferization.dealloc_tensor"(%125) : (tensor<12x14xi16>) -> ()
        %235 = "math.rsqrt"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf32>) -> tensor<10xf32>
        %236 = "math.fpowi"(%10, %13) <{fastmath = #arith.fastmath<none>}> : (f32, i32) -> f32
        %237 = "vector.multi_reduction"(%97, %10) <{kind = #vector.kind<maxf>, reduction_dims = [0]}> : (vector<14xf32>, f32) -> f32
        %238 = "math.roundeven"(%63) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %239 = "arith.floordivsi"(%88, %110) : (i1, i1) -> i1
        %240 = "memref.cast"(%124) : (memref<10xi32>) -> memref<?xi32>
        %241 = "vector.matrix_multiply"(%98, %97) <{lhs_columns = 14 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<14xf32>, vector<14xf32>) -> vector<1xf32>
        %242 = "index.mul"(%42, %46) : (index, index) -> index
        %243 = "tensor.collapse_shape"(%48) <{reassociation = [[0, 1]]}> : (tensor<?x14xi16>) -> tensor<?xi16>
        %244 = "index.xor"(%41, %29) : (index, index) -> index
        "memref.store"(%2, %65, %16, %16) <{nontemporal = false}> : (i16, memref<?x?xi16>, index, index) -> ()
        %245 = "memref.cast"(%124) : (memref<10xi32>) -> memref<?xi32>
        %246 = "index.add"(%22, %80) : (index, index) -> index
        "memref.tensor_store"(%63, %64) : (tensor<?xf32>, memref<?xf32>) -> ()
        %247 = "index.divs"(%23, %27) : (index, index) -> index
        %248 = "vector.multi_reduction"(%98, %5) <{kind = #vector.kind<maxf>, reduction_dims = [0]}> : (vector<14xf32>, f32) -> f32
        "memref.alloca_scope.return"(%20) : (index) -> ()
      }) : () -> index
      "tensor.yield"(%1) : (i64) -> ()
    }) : (index) -> tensor<?xi64>
    %127 = "index.divs"(%35, %43) : (index, index) -> index
    %128 = "spirv.GL.UClamp"(%103, %103, %103) : (vector<2xi32>, vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %129 = "spirv.FOrdEqual"(%90, %3) : (f16, f16) -> i1
    %130 = "math.ctpop"(%60) : (tensor<12x14xi16>) -> tensor<12x14xi16>
    %131 = "bufferization.to_memref"(%51) : (tensor<10xi32>) -> memref<10xi32>
    %132 = "index.floordivs"(%24, %36) : (index, index) -> index
    %133 = "spirv.CL.exp"(%108) : (f16) -> f16
    %134 = "bufferization.to_tensor"(%71) : (memref<10xf16>) -> tensor<10xf16>
    %135 = "spirv.GL.UClamp"(%112, %14, %112) : (i64, i64, i64) -> i64
    %136 = "spirv.GL.RoundEven"(%133) : (f16) -> f16
    %137 = "tensor.collapse_shape"(%48) <{reassociation = [[0, 1]]}> : (tensor<?x14xi16>) -> tensor<?xi16>
    %138 = "spirv.CL.rsqrt"(%99) : (f16) -> f16
    %139 = "spirv.CL.tanh"(%99) : (f16) -> f16
    %140 = "spirv.BitwiseXor"(%103, %103) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %141 = "math.tan"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf16>) -> tensor<10xf16>
    %142 = "math.exp"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf32>) -> tensor<10xf32>
    %143 = "memref.atomic_rmw"(%13, %131, %19) <{kind = 4 : i64}> : (i32, memref<10xi32>, index) -> i32
    %144 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<12x14xi32>
    %145 = "tensor.insert"(%138, %53, %16) : (f16, tensor<10xf16>, index) -> tensor<10xf16>
    %146 = "index.divu"(%22, %24) : (index, index) -> index
    %147 = "tensor.collapse_shape"(%48) <{reassociation = [[0, 1]]}> : (tensor<?x14xi16>) -> tensor<?xi16>
    %148 = "affine.min"(%35, %21) <{map = affine_map<(d0, d1) -> (0)>}> : (index, index) -> index
    %149 = "linalg.copy"(%48, %48) <{operandSegmentSizes = array<i32: 1, 1>}> ({
    ^bb0(%arg2: i16, %arg3: i16):
      "linalg.yield"(%arg2) : (i16) -> ()
    }) : (tensor<?x14xi16>, tensor<?x14xi16>) -> tensor<?x14xi16>
    %150 = "spirv.LogicalEqual"(%0, %123) : (i1, i1) -> i1
    %151 = "vector.extract"(%116) <{static_position = array<i64: 3>}> : (vector<12x14xi1>) -> vector<14xi1>
    %152 = "affine.load"(%78, %43) <{map = affine_map<(d0) -> (d0)>}> : (memref<?xi1>, index) -> i1
    %153 = "arith.mulf"(%108, %3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %154 = "spirv.GL.FSign"(%136) : (f16) -> f16
    %155 = "tensor.collapse_shape"(%48) <{reassociation = [[0, 1]]}> : (tensor<?x14xi16>) -> tensor<?xi16>
    %156 = "spirv.CL.s_min"(%13, %13) : (i32, i32) -> i32
    %157 = "vector.broadcast"(%1) : (i64) -> vector<12x14xi64>
    %158 = "spirv.Unordered"(%94, %118) : (f16, f16) -> i1
    %159 = "tensor.cast"(%59) : (tensor<?xf32>) -> tensor<26xf32>
    %160 = "math.log1p"(%159) <{fastmath = #arith.fastmath<none>}> : (tensor<26xf32>) -> tensor<26xf32>
    %161 = "arith.remf"(%154, %133) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %162 = "arith.cmpi"(%156, %156) <{predicate = 9 : i64}> : (i32, i32) -> i1
    %163 = "math.atan2"(%118, %15) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %164 = "spirv.BitCount"(%13) : (i32) -> i32
    %165 = "spirv.BitwiseOr"(%103, %103) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %166 = "spirv.CL.fabs"(%133) : (f16) -> f16
    %167 = "vector.transpose"(%157) <{transp = [1, 0]}> : (vector<12x14xi64>) -> vector<14x12xi64>
    %168 = "arith.xori"(%152, %152) : (i1, i1) -> i1
    %169 = "spirv.GL.Sinh"(%166) : (f16) -> f16
    %170 = "tensor.rank"(%53) : (tensor<10xf16>) -> index
    %171 = "index.ceildivu"(%19, %46) : (index, index) -> index
    %172 = "vector.insertelement"(%12, %107, %18) : (i1, vector<10xi1>, index) -> vector<10xi1>
    %173 = "arith.cmpi"(%129, %12) <{predicate = 3 : i64}> : (i1, i1) -> i1
    %174 = "arith.mulf"(%169, %154) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %175 = "spirv.CL.rsqrt"(%166) : (f16) -> f16
    %176 = "tensor.insert"(%88, %55, %16, %16) : (i1, tensor<?x?xi1>, index, index) -> tensor<?x?xi1>
    %177 = "math.log1p"(%15) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
    %178 = "scf.while"(%134) ({
    ^bb0(%arg2: tensor<10xf16>):
      "scf.index_switch"(%45) <{cases = array<i64: 1, 2, 3, 4>}> ({
        %219 = "math.ctpop"(%123) : (i1) -> i1
        %220 = "index.maxs"(%37, %38) : (index, index) -> index
        %221 = "vector.multi_reduction"(%97, %10) <{kind = #vector.kind<maxf>, reduction_dims = [0]}> : (vector<14xf32>, f32) -> f32
        %222 = "arith.addf"(%3, %133) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %223 = "affine.vector_load"(%71, %29) <{map = affine_map<(d0) -> (d0)>}> : (memref<10xf16>, index) -> vector<10xf16>
        %224 = "arith.floordivsi"(%150, %82) : (i1, i1) -> i1
        %225 = "memref.atomic_rmw"(%164, %66, %24) <{kind = 11 : i64}> : (i32, memref<14xi32>, index) -> i32
        %226 = "index.add"(%36, %20) : (index, index) -> index
        %227 = "math.exp"(%90) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %228 = "index.castu"(%115) : (i1) -> index
        %229 = "vector.broadcast"(%156) : (i32) -> vector<2x2xi32>
        %230 = "vector.outerproduct"(%103, %103, %229) <{kind = #vector.kind<add>}> : (vector<2xi32>, vector<2xi32>, vector<2x2xi32>) -> vector<2x2xi32>
        %231 = "math.fpowi"(%100, %164) <{fastmath = #arith.fastmath<none>}> : (f16, i32) -> f16
        %232 = "vector.broadcast"(%10) : (f32) -> vector<12x14xf32>
        %233 = "vector.fma"(%232, %232, %232) : (vector<12x14xf32>, vector<12x14xf32>, vector<12x14xf32>) -> vector<12x14xf32>
        %234 = "affine.apply"(%41, %20) <{map = affine_map<(d0)[s0] -> ((d0 floordiv 64) mod 32 + ((d0 floordiv 64) mod 32) floordiv 32)>}> : (index, index) -> index
        %235 = "vector.broadcast"(%5) : (f32) -> vector<12x14xf32>
        %236 = "vector.fma"(%235, %233, %235) : (vector<12x14xf32>, vector<12x14xf32>, vector<12x14xf32>) -> vector<12x14xf32>
        %237 = "tensor.splat"(%0) : (i1) -> tensor<12x14xi1>
        "scf.yield"() : () -> ()
      }, {
        %219 = "index.xor"(%arg0, %34) : (index, index) -> index
        %220 = "math.sqrt"(%166) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %221 = "index.ceildivu"(%25, %219) : (index, index) -> index
        %222 = "vector.flat_transpose"(%119) <{columns = 7 : i32, rows = 2 : i32}> : (vector<14xi1>) -> vector<14xi1>
        %223 = "index.shl"(%22, %35) : (index, index) -> index
        %224 = "math.absf"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf16>) -> tensor<10xf16>
        %225 = "vector.shuffle"(%151, %119) <{mask = [0, 8, 9, 11, 13, 19, 20, 22, 24, 25]}> : (vector<14xi1>, vector<14xi1>) -> vector<10xi1>
        %226 = "memref.realloc"(%68) : (memref<?xf16>) -> memref<10xf16>
        %227 = "index.bool.constant"() <{value = true}> : () -> i1
        %228 = "index.divs"(%41, %21) : (index, index) -> index
        %229 = "index.shrs"(%46, %17) : (index, index) -> index
        %230 = "vector.mask"(%222) ({
          %234 = "vector.multi_reduction"(%222, %222) <{kind = #vector.kind<minui>, reduction_dims = []}> : (vector<14xi1>, vector<14xi1>) -> vector<14xi1>
          "vector.yield"(%234) : (vector<14xi1>) -> ()
        }) : (vector<14xi1>) -> vector<14xi1>
        %231 = "math.log10"(%5) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        "vector.print"(%119) <{punctuation = #vector.punctuation<newline>}> : (vector<14xi1>) -> ()
        %232 = "math.expm1"(%15) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %233 = "index.sizeof"() : () -> index
        "scf.yield"() : () -> ()
      }, {
        %219 = "math.expm1"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf32>) -> tensor<10xf32>
        %220 = "bufferization.to_tensor"(%64) : (memref<?xf32>) -> tensor<?xf32>
        %221 = "index.ceildivu"(%27, %28) : (index, index) -> index
        %222 = "index.sizeof"() : () -> index
        %223 = "arith.shrui"(%89, %7) : (i16, i16) -> i16
        %224 = "affine.load"(%69, %28, %22) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (memref<12x14xi1>, index, index) -> i1
        %225 = "vector.insert"(%164, %103) <{static_position = array<i64: 0>}> : (i32, vector<2xi32>) -> vector<2xi32>
        %226 = "affine.apply"(%36) <{map = affine_map<(d0) -> (d0 ceildiv 16)>}> : (index) -> index
        %227 = "linalg.transpose"(%131, %51) <{permutation = array<i64: 0>}> ({
        ^bb0(%arg3: i32, %arg4: i32):
          "linalg.yield"(%arg3) : (i32) -> ()
        }) : (memref<10xi32>, tensor<10xi32>) -> tensor<10xi32>
        "memref.store"(%150, %70, %24) <{nontemporal = false}> : (i1, memref<10xi1>, index) -> ()
        %228 = "index.shrs"(%24, %27) : (index, index) -> index
        %229 = "arith.subi"(%8, %2) : (i16, i16) -> i16
        %230 = "vector.transpose"(%119) <{transp = [0]}> : (vector<14xi1>) -> vector<14xi1>
        %231 = "vector.broadcast"(%13) : (i32) -> vector<12x14xi32>
        %232 = "vector.multi_reduction"(%98, %98) <{kind = #vector.kind<add>, reduction_dims = []}> : (vector<14xf32>, vector<14xf32>) -> vector<14xf32>
        %233 = "index.shrs"(%24, %24) : (index, index) -> index
        "scf.yield"() : () -> ()
      }, {
        %219 = "arith.remf"(%136, %94) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %220 = "vector.mask"(%101) ({
          %239 = "vector.multi_reduction"(%101, %101) <{kind = #vector.kind<and>, reduction_dims = []}> : (vector<14xi1>, vector<14xi1>) -> vector<14xi1>
          "vector.yield"(%239) : (vector<14xi1>) -> ()
        }) : (vector<14xi1>) -> vector<14xi1>
        %221 = "arith.negf"(%99) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %222 = "arith.negf"(%3) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %223 = "math.rsqrt"(%56) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
        %224 = "vector.broadcast"(%80) : (index) -> vector<26xindex>
        %225 = "vector.broadcast"(%88) : (i1) -> vector<26xi1>
        "vector.scatter"(%77, %16, %26, %224, %225, %225) : (memref<?x14xi1>, index, index, vector<26xindex>, vector<26xi1>, vector<26xi1>) -> ()
        %226 = "vector.broadcast"(%91) : (i1) -> vector<14x14xi1>
        %227 = "vector.contract"(%116, %116, %226) <{indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = [#vector.iterator_type<parallel>, #vector.iterator_type<parallel>, #vector.iterator_type<reduction>], kind = #vector.kind<or>}> : (vector<12x14xi1>, vector<12x14xi1>, vector<14x14xi1>) -> vector<14x14xi1>
        %228 = "affine.vector_load"(%72, %25) <{map = affine_map<(d0) -> (d0)>}> : (memref<?xi64>, index) -> vector<14xi64>
        %229 = "vector.broadcast"(%11) : (i1) -> vector<12xi1>
        %230 = "vector.contract"(%116, %151, %229) <{indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0)>], iterator_types = [#vector.iterator_type<parallel>, #vector.iterator_type<reduction>], kind = #vector.kind<or>}> : (vector<12x14xi1>, vector<14xi1>, vector<12xi1>) -> vector<12xi1>
        %231 = "arith.constant"() <{value = 0 : i32}> : () -> i32
        %232 = "vector.transfer_read"(%58, %16, %231) <{operandSegmentSizes = array<i32: 1, 1, 1, 0>, permutation_map = affine_map<(d0) -> ()>}> : (tensor<?xi32>, index, i32) -> vector<i32>
        %233 = "arith.shrui"(%150, %11) : (i1, i1) -> i1
        %234 = "index.maxu"(%34, %46) : (index, index) -> index
        %235 = "memref.realloc"(%73) : (memref<14xi1>) -> memref<26xi1>
        %236 = "arith.shrui"(%6, %135) : (i64, i64) -> i64
        %237 = "index.add"(%38, %44) : (index, index) -> index
        %238 = "index.shru"(%80, %29) : (index, index) -> index
        "scf.yield"() : () -> ()
      }, {
        %219 = "vector.broadcast"(%123) : (i1) -> vector<12xi1>
        %220 = "vector.mask"(%116) ({
          %237 = "vector.multi_reduction"(%116, %219) <{kind = #vector.kind<or>, reduction_dims = [1]}> : (vector<12x14xi1>, vector<12xi1>) -> vector<12xi1>
          "vector.yield"(%237) : (vector<12xi1>) -> ()
        }) : (vector<12x14xi1>) -> vector<12xi1>
        %221 = "bufferization.to_memref"(%155) : (tensor<?xi16>) -> memref<?xi16>
        %222 = "vector.reduction"(%92) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<minui>}> : (vector<14xi32>) -> i32
        %223 = "memref.atomic_rmw"(%99, %71, %25) <{kind = 9 : i64}> : (f16, memref<10xf16>, index) -> f16
        %224 = "vector.mask"(%107) ({
          %237 = "vector.multi_reduction"(%107, %107) <{kind = #vector.kind<maxui>, reduction_dims = []}> : (vector<10xi1>, vector<10xi1>) -> vector<10xi1>
          "vector.yield"(%237) : (vector<10xi1>) -> ()
        }) : (vector<10xi1>) -> vector<10xi1>
        %225 = "index.divs"(%47, %41) : (index, index) -> index
        %226 = "math.absf"(%5) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %227 = "math.ipowi"(%88, %91) : (i1, i1) -> i1
        %228 = "math.absf"(%100) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %229 = "arith.remf"(%138, %133) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %230 = "vector.broadcast"(%112) : (i64) -> vector<12xi64>
        %231 = "vector.multi_reduction"(%157, %230) <{kind = #vector.kind<minui>, reduction_dims = [1]}> : (vector<12x14xi64>, vector<12xi64>) -> vector<12xi64>
        %232 = "vector.extract"(%92) <{static_position = array<i64: 2>}> : (vector<14xi32>) -> i32
        %233 = "index.casts"(%85) : (i1) -> index
        %234 = "index.ceildivs"(%225, %35) : (index, index) -> index
        %235 = "arith.shrsi"(%152, %123) : (i1, i1) -> i1
        %236 = "tensor.collapse_shape"(%55) <{reassociation = [[0, 1]]}> : (tensor<?x?xi1>) -> tensor<?xi1>
        "scf.yield"() : () -> ()
      }) : (index) -> ()
      %213 = "index.shrs"(%18, %24) : (index, index) -> index
      %214 = "arith.andi"(%2, %89) : (i16, i16) -> i16
      %215 = "index.bool.constant"() <{value = false}> : () -> i1
      "memref.copy"(%78, %67) : (memref<?xi1>, memref<?xi1>) -> ()
      %216 = "affine.load"(%131, %36) <{map = affine_map<(d0) -> (d0)>}> : (memref<10xi32>, index) -> i32
      %217 = "memref.atomic_rmw"(%164, %131, %23) <{kind = 12 : i64}> : (i32, memref<10xi32>, index) -> i32
      %218 = "math.cos"(%3) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      "scf.condition"(%0, %arg2) : (i1, tensor<10xf16>) -> ()
    }, {
    ^bb0(%arg2: tensor<10xf16>):
      %213 = "math.round"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
      %214 = "arith.cmpi"(%81, %150) <{predicate = 6 : i64}> : (i1, i1) -> i1
      %215 = "memref.alloca"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<10xi1>
      %216 = "bufferization.clone"(%70) : (memref<10xi1>) -> memref<10xi1>
      %217 = "memref.alloc"(%42) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi1>
      %218 = "arith.remui"(%11, %123) : (i1, i1) -> i1
      %219 = "math.round"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf32>) -> tensor<10xf32>
      %220 = "math.tan"(%118) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %221 = "vector.mask"(%101) ({
        %229 = "vector.multi_reduction"(%119, %119) <{kind = #vector.kind<xor>, reduction_dims = []}> : (vector<14xi1>, vector<14xi1>) -> vector<14xi1>
        "vector.yield"(%229) : (vector<14xi1>) -> ()
      }) : (vector<14xi1>) -> vector<14xi1>
      %222 = "math.log"(%139) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %223 = "scf.execute_region"() ({
        %229 = "tensor.from_elements"(%136, %133, %136, %138, %175, %138, %99, %154, %15, %169, %154, %118, %108, %3) : (f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16) -> tensor<14xf16>
        %230 = "arith.andi"(%11, %4) : (i1, i1) -> i1
        %231 = "memref.atomic_rmw"(%10, %64, %16) <{kind = 9 : i64}> : (f32, memref<?xf32>, index) -> f32
        %232 = "index.bool.constant"() <{value = true}> : () -> i1
        %233 = "affine.min"(%20, %23) <{map = affine_map<(d0, d1) -> (0)>}> : (index, index) -> index
        %234 = "vector.broadcast"(%89) : (i16) -> vector<26xi16>
        %235 = "vector.broadcast"(%232) : (i1) -> vector<26xi1>
        %236 = "vector.maskedload"(%74, %16, %235, %234) : (memref<?xi16>, index, vector<26xi1>, vector<26xi16>) -> vector<26xi16>
        %237 = "math.log10"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<10xf16>) -> tensor<10xf16>
        %238 = "affine.load"(%68, %26) <{map = affine_map<(d0) -> (d0)>}> : (memref<?xf16>, index) -> f16
        "affine.store"(%118, %76, %43) <{map = affine_map<(d0) -> (d0)>}> : (f16, memref<10xf16>, index) -> ()
        %239 = "math.tan"(%108) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
