"builtin.module"() ({
  "func.func"() <{function_type = (tensor<?x?xi32>) -> (), sym_name = "func1"}> ({
  ^bb0(%arg0: tensor<?x?xi32>):
    %0 = "arith.constant"() <{value = 1617153242 : i64}> : () -> i64
    %1 = "arith.constant"() <{value = 1.25514035E+9 : f32}> : () -> f32
    %2 = "arith.constant"() <{value = 2.740800e+04 : f16}> : () -> f16
    %3 = "arith.constant"() <{value = 1103576230 : i32}> : () -> i32
    %4 = "arith.constant"() <{value = 968611444 : i64}> : () -> i64
    %5 = "arith.constant"() <{value = 1.769600e+04 : f16}> : () -> f16
    %6 = "arith.constant"() <{value = 1.14186611E+9 : f32}> : () -> f32
    %7 = "arith.constant"() <{value = false}> : () -> i1
    %8 = "arith.constant"() <{value = false}> : () -> i1
    %9 = "arith.constant"() <{value = true}> : () -> i1
    %10 = "arith.constant"() <{value = 904915843 : i32}> : () -> i32
    %11 = "arith.constant"() <{value = 0x4D9ABFA9 : f32}> : () -> f32
    %12 = "arith.constant"() <{value = false}> : () -> i1
    %13 = "arith.constant"() <{value = 22919 : i16}> : () -> i16
    %14 = "arith.constant"() <{value = 4.832000e+04 : f16}> : () -> f16
    %15 = "arith.constant"() <{value = true}> : () -> i1
    %16 = "arith.constant"() <{value = 0 : index}> : () -> index
    %17 = "arith.constant"() <{value = 1 : index}> : () -> index
    %18 = "arith.constant"() <{value = 2 : index}> : () -> index
    %19 = "arith.constant"() <{value = 3 : index}> : () -> index
    %20 = "arith.constant"() <{value = 4 : index}> : () -> index
    %21 = "arith.constant"() <{value = 5 : index}> : () -> index
    %22 = "arith.constant"() <{value = 6 : index}> : () -> index
    %23 = "arith.constant"() <{value = 7 : index}> : () -> index
    %24 = "arith.constant"() <{value = 8 : index}> : () -> index
    %25 = "arith.constant"() <{value = 9 : index}> : () -> index
    %26 = "arith.constant"() <{value = 10 : index}> : () -> index
    %27 = "arith.constant"() <{value = 11 : index}> : () -> index
    %28 = "arith.constant"() <{value = 12 : index}> : () -> index
    %29 = "arith.constant"() <{value = 13 : index}> : () -> index
    %30 = "arith.constant"() <{value = 14 : index}> : () -> index
    %31 = "arith.constant"() <{value = 15 : index}> : () -> index
    %32 = "arith.constant"() <{value = 16 : index}> : () -> index
    %33 = "arith.constant"() <{value = 17 : index}> : () -> index
    %34 = "arith.constant"() <{value = 18 : index}> : () -> index
    %35 = "arith.constant"() <{value = 19 : index}> : () -> index
    %36 = "arith.constant"() <{value = 20 : index}> : () -> index
    %37 = "arith.constant"() <{value = 21 : index}> : () -> index
    %38 = "arith.constant"() <{value = 22 : index}> : () -> index
    %39 = "arith.constant"() <{value = 23 : index}> : () -> index
    %40 = "arith.constant"() <{value = 24 : index}> : () -> index
    %41 = "arith.constant"() <{value = 25 : index}> : () -> index
    %42 = "arith.constant"() <{value = 26 : index}> : () -> index
    %43 = "arith.constant"() <{value = 27 : index}> : () -> index
    %44 = "arith.constant"() <{value = 28 : index}> : () -> index
    %45 = "arith.constant"() <{value = 29 : index}> : () -> index
    %46 = "arith.constant"() <{value = 30 : index}> : () -> index
    %47 = "arith.constant"() <{value = 31 : index}> : () -> index
    %48 = "tensor.empty"() : () -> tensor<29x13x13xi1>
    %49 = "tensor.empty"() : () -> tensor<29x13x13xi1>
    %50 = "tensor.empty"() : () -> tensor<13x13xf16>
    %51 = "tensor.empty"() : () -> tensor<29x29xi32>
    %52 = "tensor.empty"() : () -> tensor<29x13x13xf16>
    %53 = "tensor.empty"(%32) : (index) -> tensor<?xf16>
    %54 = "tensor.empty"(%17, %35) : (index, index) -> tensor<?x?x13xf32>
    %55 = "tensor.empty"() : () -> tensor<29x29xi1>
    %56 = "tensor.empty"(%40) : (index) -> tensor<?x13x13xf16>
    %57 = "tensor.empty"(%42) : (index) -> tensor<?x13xi16>
    %58 = "tensor.empty"() : () -> tensor<29xi16>
    %59 = "tensor.empty"(%32) : (index) -> tensor<?x13x13xi16>
    %60 = "tensor.empty"(%35) : (index) -> tensor<?xi32>
    %61 = "tensor.empty"(%17) : (index) -> tensor<?x29xf16>
    %62 = "tensor.empty"(%22) : (index) -> tensor<?xf32>
    %63 = "tensor.empty"() : () -> tensor<29xf32>
    %64 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x13xi32>
    %65 = "memref.alloc"(%37) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x13x13xf32>
    %66 = "memref.alloc"(%43) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x13x13xf16>
    %67 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29x13x13xi1>
    %68 = "memref.alloc"(%28) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x13xi32>
    %69 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29x29xi1>
    %70 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29x29xi1>
    %71 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29xi64>
    %72 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29x29xi64>
    %73 = "memref.alloc"(%21) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x13xi16>
    %74 = "memref.alloc"(%38, %44, %25) <{operandSegmentSizes = array<i32: 3, 0>}> : (index, index, index) -> memref<?x?x?xi64>
    %75 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x13xi32>
    %76 = "memref.alloc"(%23) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x13xi64>
    %77 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29xi1>
    %78 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29x13x13xf32>
    %79 = "memref.alloc"(%20, %30, %47) <{operandSegmentSizes = array<i32: 3, 0>}> : (index, index, index) -> memref<?x?x?xi16>
    %80 = "linalg.matmul"(%70, %69, %55) <{operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg1: i1, %arg2: i1, %arg3: i1):
      %209 = "arith.andi"(%arg1, %arg2) : (i1, i1) -> i1
      %210 = "arith.ori"(%arg3, %209) : (i1, i1) -> i1
      "linalg.yield"(%210) : (i1) -> ()
    }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (memref<29x29xi1>, memref<29x29xi1>, tensor<29x29xi1>) -> tensor<29x29xi1>
    "affine.for"() <{lowerBoundMap = affine_map<() -> (0)>, operandSegmentSizes = array<i32: 0, 0, 0>, step = 1 : index, upperBoundMap = affine_map<() -> (17)>}> ({
    ^bb0(%arg1: index):
      "affine.yield"() : () -> ()
    }) : () -> ()
    %81 = "arith.remui"(%13, %13) : (i16, i16) -> i16
    %82 = "vector.broadcast"(%3) : (i32) -> vector<2xi32>
    %83 = "spirv.BitwiseOr"(%82, %82) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %84 = "spirv.BitFieldInsert"(%82, %82, %4, %3) : (vector<2xi32>, vector<2xi32>, i64, i32) -> vector<2xi32>
    %85 = "spirv.GL.Floor"(%14) : (f16) -> f16
    %86 = "spirv.GL.SClamp"(%4, %4, %4) : (i64, i64, i64) -> i64
    %87 = "spirv.GL.SClamp"(%4, %86, %4) : (i64, i64, i64) -> i64
    %88 = "arith.muli"(%9, %7) : (i1, i1) -> i1
    %89 = "spirv.CL.round"(%1) : (f32) -> f32
    %90 = "index.sub"(%43, %33) : (index, index) -> index
    %91 = "spirv.FUnordGreaterThan"(%89, %6) : (f32, f32) -> i1
    %92 = "spirv.SGreaterThan"(%13, %13) : (i16, i16) -> i1
    %93 = "spirv.INotEqual"(%3, %3) : (i32, i32) -> i1
    %94 = "spirv.GL.RoundEven"(%85) : (f16) -> f16
    %95 = "math.sqrt"(%56) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13x13xf16>) -> tensor<?x13x13xf16>
    %96 = "spirv.LogicalOr"(%93, %7) : (i1, i1) -> i1
    %97 = "math.absi"(%0) : (i64) -> i64
    %98 = "spirv.CL.tanh"(%85) : (f16) -> f16
    %99 = "spirv.GL.UMax"(%82, %82) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %100 = "memref.realloc"(%77) : (memref<29xi1>) -> memref<27xi1>
    %101 = "spirv.BitFieldSExtract"(%82, %86, %0) : (vector<2xi32>, i64, i64) -> vector<2xi32>
    %102 = "arith.addi"(%93, %15) : (i1, i1) -> i1
    %103 = "spirv.LogicalNotEqual"(%15, %9) : (i1, i1) -> i1
    %104 = "spirv.CL.rint"(%14) : (f16) -> f16
    %105 = "vector.broadcast"(%91) : (i1) -> vector<13xi1>
    "vector.compressstore"(%67, %28, %16, %21, %105, %105) : (memref<29x13x13xi1>, index, index, index, vector<13xi1>, vector<13xi1>) -> ()
    "affine.store"(%92, %70, %17, %24) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (i1, memref<29x29xi1>, index, index) -> ()
    %106 = "spirv.GL.Fma"(%98, %5, %94) : (f16, f16, f16) -> f16
    %107 = "spirv.GL.SClamp"(%3, %10, %3) : (i32, i32, i32) -> i32
    %108 = "spirv.GL.Sinh"(%5) : (f16) -> f16
    %109 = "math.log2"(%56) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13x13xf16>) -> tensor<?x13x13xf16>
    %110 = "spirv.BitwiseOr"(%82, %82) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %111 = "arith.mulf"(%5, %85) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %112 = "spirv.GL.Cos"(%104) : (f16) -> f16
    %113 = "index.maxu"(%34, %29) : (index, index) -> index
    %114 = "spirv.SLessThan"(%3, %107) : (i32, i32) -> i1
    %115 = "spirv.BitwiseOr"(%82, %82) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %116 = "arith.shrui"(%96, %114) : (i1, i1) -> i1
    %117 = "spirv.GL.FMix"(%14, %94, %104) : (f16, f16, f16) -> f16
    %118 = "arith.floordivsi"(%13, %13) : (i16, i16) -> i16
    %119 = "spirv.CL.cos"(%85) : (f16) -> f16
    %120 = "math.ipowi"(%49, %48) : (tensor<29x13x13xi1>, tensor<29x13x13xi1>) -> tensor<29x13x13xi1>
    %121 = "spirv.ULessThan"(%87, %0) : (i64, i64) -> i1
    %122 = "spirv.GL.Atan"(%117) : (f16) -> f16
    %123 = "vector.broadcast"(%13) : (i16) -> vector<i16>
    %124 = "vector.transfer_write"(%123, %57, %22, %19) <{operandSegmentSizes = array<i32: 1, 1, 2, 0>, permutation_map = affine_map<(d0, d1) -> ()>}> : (vector<i16>, tensor<?x13xi16>, index, index) -> tensor<?x13xi16>
    %125 = "spirv.GL.FClamp"(%117, %106, %108) : (f16, f16, f16) -> f16
    %126 = "spirv.CL.sqrt"(%125) : (f16) -> f16
    %127 = "tensor.cast"(%58) : (tensor<29xi16>) -> tensor<?xi16>
    %128 = "spirv.SLessThanEqual"(%82, %82) : (vector<2xi32>, vector<2xi32>) -> vector<2xi1>
    %129 = "spirv.FNegate"(%85) : (f16) -> f16
    "affine.store"(%91, %69, %42, %35) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (i1, memref<29x29xi1>, index, index) -> ()
    %130 = "tensor.rank"(%56) : (tensor<?x13x13xf16>) -> index
    %131 = "math.sqrt"(%108) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
    %132 = "arith.mulf"(%117, %85) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %133 = "math.tan"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<?x29xf16>) -> tensor<?x29xf16>
    %134 = "index.maxu"(%24, %37) : (index, index) -> index
    %135 = "tensor.generate"(%34, %17) ({
    ^bb0(%arg1: index, %arg2: index):
      %209 = "index.divs"(%22, %17) : (index, index) -> index
      %210 = "index.sub"(%27, %19) : (index, index) -> index
      %211 = "vector.broadcast"(%113) : (index) -> vector<27xindex>
      %212 = "vector.broadcast"(%9) : (i1) -> vector<27xi1>
      %213 = "vector.broadcast"(%13) : (i16) -> vector<27xi16>
      "vector.scatter"(%73, %16, %22, %211, %212, %213) : (memref<?x13xi16>, index, index, vector<27xindex>, vector<27xi1>, vector<27xi16>) -> ()
      %214 = "math.absi"(%60) : (tensor<?xi32>) -> tensor<?xi32>
      "tensor.yield"(%86) : (i64) -> ()
    }) : (index, index) -> tensor<?x?xi64>
    %136 = "vector.splat"(%126) : (f16) -> vector<13x13xf16>
    %137 = "math.exp"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<?x29xf16>) -> tensor<?x29xf16>
    %138 = "math.exp"(%53) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
    %139 = "index.shrs"(%26, %19) : (index, index) -> index
    %140 = "vector.reduction"(%82) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<minsi>}> : (vector<2xi32>) -> i32
    %141 = "vector.broadcast"(%108) : (f16) -> vector<29x29xf16>
    %142 = "spirv.GL.Fma"(%98, %5, %106) : (f16, f16, f16) -> f16
    %143 = "spirv.CL.sqrt"(%14) : (f16) -> f16
    %144 = "spirv.GL.UMax"(%4, %86) : (i64, i64) -> i64
    "memref.copy"(%76, %76) : (memref<?x13xi64>, memref<?x13xi64>) -> ()
    %145 = "math.round"(%56) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13x13xf16>) -> tensor<?x13x13xf16>
    %146 = "spirv.FUnordEqual"(%6, %1) : (f32, f32) -> i1
    %147 = "spirv.UGreaterThanEqual"(%4, %86) : (i64, i64) -> i1
    "memref.assume_alignment"(%79) <{alignment = 1 : i32}> : (memref<?x?x?xi16>) -> ()
    %148 = "math.ceil"(%112) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
    %149 = "math.absi"(%91) : (i1) -> i1
    %150 = "spirv.CL.cos"(%106) : (f16) -> f16
    %151 = "vector.broadcast"(%98) : (f16) -> vector<29xf16>
    %152:2 = "vector.scan"(%141, %151) <{inclusive = false, kind = #vector.kind<maxf>, reduction_dim = 1 : i64}> : (vector<29x29xf16>, vector<29xf16>) -> (vector<29x29xf16>, vector<29xf16>)
    %153 = "affine.if"(%31) ({
      %209 = "math.ctpop"(%48) : (tensor<29x13x13xi1>) -> tensor<29x13x13xi1>
      %210 = "arith.divsi"(%96, %93) : (i1, i1) -> i1
      %211 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x13xi16>
      %212 = "vector.broadcast"(%13) : (i16) -> vector<29x13x13xi16>
      %213 = "vector.broadcast"(%121) : (i1) -> vector<29x13x13xi1>
      %214 = "vector.broadcast"(%107) : (i32) -> vector<29x13x13xi32>
      %215 = "vector.gather"(%211, %21, %90, %214, %213, %212) : (memref<13x13xi16>, index, index, vector<29x13x13xi32>, vector<29x13x13xi1>, vector<29x13x13xi16>) -> vector<29x13x13xi16>
      %216 = "scf.index_switch"(%18) <{cases = array<i64: 1, 2, 3>}> ({
        %222 = "math.log1p"(%143) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %223 = "index.or"(%90, %30) : (index, index) -> index
        %224 = "linalg.matmul"(%50, %50, %50) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg1: f16, %arg2: f16, %arg3: f16):
          %239 = "arith.mulf"(%arg1, %arg2) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
          %240 = "arith.addf"(%arg3, %239) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
          "linalg.yield"(%240) : (f16) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<13x13xf16>, tensor<13x13xf16>, tensor<13x13xf16>) -> tensor<13x13xf16>
        %225 = "vector.splat"(%17) : (index) -> vector<13x13xindex>
        %226 = "index.shl"(%40, %46) : (index, index) -> index
        %227 = "math.absf"(%94) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %228 = "math.absf"(%14) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %229 = "index.sub"(%37, %25) : (index, index) -> index
        %230 = "math.cttz"(%58) : (tensor<29xi16>) -> tensor<29xi16>
        %231 = "index.floordivs"(%32, %113) : (index, index) -> index
        %232 = "arith.cmpf"(%98, %85) <{predicate = 13 : i64}> : (f16, f16) -> i1
        %233 = "arith.floordivsi"(%93, %15) : (i1, i1) -> i1
        %234 = "index.divu"(%231, %29) : (index, index) -> index
        %235 = "tensor.rank"(%135) : (tensor<?x?xi64>) -> index
        %236 = "math.absf"(%56) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13x13xf16>) -> tensor<?x13x13xf16>
        %237 = "tensor.empty"(%33, %18, %41) : (index, index, index) -> tensor<?x?x?xi16>
        %238 = "linalg.transpose"(%79, %237) <{permutation = array<i64: 2, 0, 1>}> ({
        ^bb0(%arg1: i16, %arg2: i16):
          "linalg.yield"(%arg1) : (i16) -> ()
        }) : (memref<?x?x?xi16>, tensor<?x?x?xi16>) -> tensor<?x?x?xi16>
        "scf.yield"(%213) : (vector<29x13x13xi1>) -> ()
      }, {
        %222 = "math.ceil"(%62) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %223 = "math.round"(%104) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %224 = "bufferization.clone"(%71) : (memref<29xi64>) -> memref<29xi64>
        %225 = "vector.reduction"(%82) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<minsi>}> : (vector<2xi32>) -> i32
        %226 = "index.sub"(%32, %26) : (index, index) -> index
        "memref.copy"(%67, %67) : (memref<29x13x13xi1>, memref<29x13x13xi1>) -> ()
        %227 = "memref.alloca"(%44) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi1>
        %228 = "memref.realloc"(%71) : (memref<29xi64>) -> memref<27xi64>
        %229 = "arith.minsi"(%9, %121) : (i1, i1) -> i1
        %230 = "vector.insert"(%10, %82) <{static_position = array<i64: 0>}> : (i32, vector<2xi32>) -> vector<2xi32>
        %231 = "index.shrs"(%36, %134) : (index, index) -> index
        %232 = "math.copysign"(%108, %112) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        "vector.print"(%141) <{punctuation = #vector.punctuation<newline>}> : (vector<29x29xf16>) -> ()
        %233 = "index.floordivs"(%26, %139) : (index, index) -> index
        %234 = "index.castu"(%147) : (i1) -> index
        %235 = "arith.remsi"(%86, %86) : (i64, i64) -> i64
        "scf.yield"(%213) : (vector<29x13x13xi1>) -> ()
      }, {
        %222 = "tensor.rank"(%59) : (tensor<?x13x13xi16>) -> index
        %223 = "vector.flat_transpose"(%82) <{columns = 1 : i32, rows = 2 : i32}> : (vector<2xi32>) -> vector<2xi32>
        %224 = "affine.apply"(%22, %24, %26) <{map = affine_map<(d0, d1)[s0] -> ((d0 ceildiv 64) mod 8)>}> : (index, index, index) -> index
        %225 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29x13x13xf16>
        %226 = "vector.broadcast"(%94) : (f16) -> vector<13x13xf16>
        %227 = "vector.broadcast"(%93) : (i1) -> vector<13x13xi1>
        %228 = "vector.broadcast"(%3) : (i32) -> vector<13x13xi32>
        %229 = "vector.gather"(%225, %42, %22, %134, %228, %227, %226) : (memref<29x13x13xf16>, index, index, index, vector<13x13xi32>, vector<13x13xi1>, vector<13x13xf16>) -> vector<13x13xf16>
        %230 = "vector.broadcast"(%13) : (i16) -> vector<29xi16>
        %231 = "vector.multi_reduction"(%212, %230) <{kind = #vector.kind<and>, reduction_dims = [1, 2]}> : (vector<29x13x13xi16>, vector<29xi16>) -> vector<29xi16>
        %232 = "vector.splat"(%31) : (index) -> vector<29xindex>
        %233 = "affine.load"(%74, %24, %40, %46) <{map = affine_map<(d0, d1, d2) -> (d0, d1, d2)>}> : (memref<?x?x?xi64>, index, index, index) -> i64
        %234 = "vector.broadcast"(%10) : (i32) -> vector<13xi32>
        %235:2 = "vector.scan"(%228, %234) <{inclusive = true, kind = #vector.kind<minsi>, reduction_dim = 0 : i64}> : (vector<13x13xi32>, vector<13xi32>) -> (vector<13x13xi32>, vector<13xi32>)
        %236 = "math.exp"(%143) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %237 = "index.divu"(%46, %134) : (index, index) -> index
        %238 = "tensor.rank"(%57) : (tensor<?x13xi16>) -> index
        %239 = "linalg.copy"(%55, %55) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg1: i1, %arg2: i1):
          "linalg.yield"(%arg1) : (i1) -> ()
        }) : (tensor<29x29xi1>, tensor<29x29xi1>) -> tensor<29x29xi1>
        %240 = "vector.insertelement"(%13, %230, %18) : (i16, vector<29xi16>, index) -> vector<29xi16>
        %241 = "bufferization.to_memref"(%59) : (tensor<?x13x13xi16>) -> memref<?x13x13xi16>
        "bufferization.dealloc_tensor"(%61) : (tensor<?x29xf16>) -> ()
        %242 = "math.expm1"(%6) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        "scf.yield"(%213) : (vector<29x13x13xi1>) -> ()
      }, {
        %222 = "affine.min"(%43, %42) <{map = affine_map<(d0, d1) -> ((d0 floordiv 8) floordiv 32)>}> : (index, index) -> index
        %223 = "tensor.empty"(%222) : (index) -> tensor<?x13x13x27xf16>
        %224 = "linalg.broadcast"(%56, %223) <{dimensions = array<i64: 3>}> ({
        ^bb0(%arg1: f16, %arg2: f16):
          "linalg.yield"(%arg1) : (f16) -> ()
        }) : (tensor<?x13x13xf16>, tensor<?x13x13x27xf16>) -> tensor<?x13x13x27xf16>
        %225 = "vector.load"(%65, %16, %26, %28) : (memref<?x13x13xf32>, index, index, index) -> vector<29x13x13xf32>
        %226 = "arith.addf"(%6, %6) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %227 = "memref.atomic_rmw"(%4, %76, %16, %16) <{kind = 10 : i64}> : (i64, memref<?x13xi64>, index, index) -> i64
        "memref.copy"(%71, %71) : (memref<29xi64>, memref<29xi64>) -> ()
        %228 = "tensor.cast"(%53) : (tensor<?xf16>) -> tensor<11xf16>
        %229 = "vector.broadcast"(%107) : (i32) -> vector<13x13x13x13xi32>
        %230 = "vector.contract"(%214, %214, %229) <{indexing_maps = [affine_map<(d0, d1, d2, d3, d4) -> (d4, d0, d1)>, affine_map<(d0, d1, d2, d3, d4) -> (d4, d2, d3)>, affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2, d3)>], iterator_types = [#vector.iterator_type<parallel>, #vector.iterator_type<parallel>, #vector.iterator_type<parallel>, #vector.iterator_type<parallel>, #vector.iterator_type<reduction>], kind = #vector.kind<minui>}> : (vector<29x13x13xi32>, vector<29x13x13xi32>, vector<13x13x13x13xi32>) -> vector<13x13x13x13xi32>
        %231 = "math.ipowi"(%91, %8) : (i1, i1) -> i1
        %232 = "math.log10"(%150) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %233 = "math.cos"(%126) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %234 = "tensor.empty"() : () -> tensor<29xi1>
        %235 = "math.log2"(%5) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %236 = "math.log10"(%11) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %237 = "math.cos"(%129) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %238 = "tensor.cast"(%58) : (tensor<29xi16>) -> tensor<?xi16>
        "scf.yield"(%213) : (vector<29x13x13xi1>) -> ()
      }) : (index) -> vector<29x13x13xi1>
      %217 = "vector.splat"(%142) : (f16) -> vector<29x13x13xf16>
      %218 = "affine.apply"(%134, %32) <{map = affine_map<(d0)[s0] -> ((-d0) mod 2 + 128)>}> : (index, index) -> index
      %219 = "math.sqrt"(%119) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %220 = "arith.divui"(%93, %147) : (i1, i1) -> i1
      %221 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x13xi1>
      "affine.yield"(%221) : (memref<13x13xi1>) -> ()
    }, {
      %209 = "scf.execute_region"() ({
        %218 = "index.sub"(%38, %44) : (index, index) -> index
        %219 = "index.shrs"(%90, %38) : (index, index) -> index
        %220 = "linalg.copy"(%61, %61) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg1: f16, %arg2: f16):
          "linalg.yield"(%arg1) : (f16) -> ()
        }) : (tensor<?x29xf16>, tensor<?x29xf16>) -> tensor<?x29xf16>
        %221 = "math.ctpop"(%92) : (i1) -> i1
        %222 = "index.maxu"(%35, %37) : (index, index) -> index
        %223 = "vector.broadcast"(%129) : (f16) -> vector<29xf16>
        %224:2 = "vector.scan"(%141, %223) <{inclusive = false, kind = #vector.kind<maxf>, reduction_dim = 1 : i64}> : (vector<29x29xf16>, vector<29xf16>) -> (vector<29x29xf16>, vector<29xf16>)
        %225 = "arith.remsi"(%13, %13) : (i16, i16) -> i16
        %226 = "arith.negf"(%142) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %227 = "math.sqrt"(%106) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        "memref.copy"(%67, %67) : (memref<29x13x13xi1>, memref<29x13x13xi1>) -> ()
        %228 = "math.cos"(%6) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %229 = "math.ctlz"(%121) : (i1) -> i1
        %230 = "tensor.extract"(%57, %16, %19) : (tensor<?x13xi16>, index, index) -> i16
        %231 = "arith.shli"(%86, %4) : (i64, i64) -> i64
        %232 = "arith.remui"(%3, %3) : (i32, i32) -> i32
        %233 = "vector.broadcast"(%142) : (f16) -> vector<29xf16>
        %234:2 = "vector.scan"(%141, %233) <{inclusive = false, kind = #vector.kind<maxf>, reduction_dim = 0 : i64}> : (vector<29x29xf16>, vector<29xf16>) -> (vector<29x29xf16>, vector<29xf16>)
        "scf.yield"(%37) : (index) -> ()
      }) : () -> index
      %210 = "math.log2"(%117) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      "scf.if"(%92) ({
        %218 = "math.tan"(%122) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %219 = "arith.divf"(%6, %11) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %220 = "arith.andi"(%107, %10) : (i32, i32) -> i32
        %221 = "index.maxu"(%21, %35) : (index, index) -> index
        %222 = "vector.flat_transpose"(%82) <{columns = 1 : i32, rows = 2 : i32}> : (vector<2xi32>) -> vector<2xi32>
        %223 = "arith.divui"(%7, %92) : (i1, i1) -> i1
        %224 = "vector.insertelement"(%3, %222, %40) : (i32, vector<2xi32>, index) -> vector<2xi32>
        %225 = "affine.apply"(%32, %31, %42, %35) <{map = affine_map<(d0, d1, d2, d3) -> (d3)>}> : (index, index, index, index) -> index
        "scf.yield"() : () -> ()
      }, {
        %218 = "arith.shrui"(%121, %146) : (i1, i1) -> i1
        %219 = "math.absf"(%6) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %220 = "index.maxs"(%47, %43) : (index, index) -> index
        %221 = "memref.alloca"(%33) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x13x13xi1>
        %222 = "tensor.empty"(%39) : (index) -> tensor<?xi16>
        %223 = "vector.transpose"(%141) <{transp = [0, 1]}> : (vector<29x29xf16>) -> vector<29x29xf16>
        %224 = "bufferization.clone"(%71) : (memref<29xi64>) -> memref<29xi64>
        %225 = "math.ctpop"(%arg0) : (tensor<?x?xi32>) -> tensor<?x?xi32>
        "scf.yield"() : () -> ()
      }) : (i1) -> ()
      %211 = "tensor.generate"(%41, %47) ({
      ^bb0(%arg1: index, %arg2: index, %arg3: index):
        %218 = "arith.divf"(%112, %106) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %219 = "math.fma"(%108, %5, %129) <{fastmath = #arith.fastmath<none>}> : (f16, f16, f16) -> f16
        %220 = "math.ctpop"(%60) : (tensor<?xi32>) -> tensor<?xi32>
        %221 = "bufferization.clone"(%67) : (memref<29x13x13xi1>) -> memref<29x13x13xi1>
        "tensor.yield"(%126) : (f16) -> ()
      }) : (index, index) -> tensor<?x?x13xf16>
      %212 = "vector.broadcast"(%142) : (f16) -> vector<29xf16>
      %213:2 = "vector.scan"(%141, %212) <{inclusive = true, kind = #vector.kind<mul>, reduction_dim = 1 : i64}> : (vector<29x29xf16>, vector<29xf16>) -> (vector<29x29xf16>, vector<29xf16>)
      %214 = "index.maxs"(%19, %45) : (index, index) -> index
      %215 = "bufferization.clone"(%72) : (memref<29x29xi64>) -> memref<29x29xi64>
      %216 = "math.exp"(%129) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %217 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x13xi1>
      "affine.yield"(%217) : (memref<13x13xi1>) -> ()
    }) {condition = affine_set<(d0) : (-8 == 0, 136 == 0)>} : (index) -> memref<13x13xi1>
    %154 = "spirv.CL.log"(%119) : (f16) -> f16
    %155 = "memref.load"(%70, %29, %17) <{nontemporal = false}> : (memref<29x29xi1>, index, index) -> i1
    %156 = "math.ctlz"(%91) : (i1) -> i1
    %157 = "spirv.GL.Pow"(%119, %154) : (f16, f16) -> f16
    %158 = "spirv.CL.s_max"(%86, %0) : (i64, i64) -> i64
    %159 = "spirv.GL.Ceil"(%5) : (f16) -> f16
    %160 = "spirv.CL.floor"(%1) : (f32) -> f32
    %161 = "spirv.CL.pow"(%94, %125) : (f16, f16) -> f16
    %162 = "arith.minsi"(%107, %3) : (i32, i32) -> i32
    %163 = "tensor.dim"(%52, %17) : (tensor<29x13x13xf16>, index) -> index
    %164 = "spirv.GL.FClamp"(%150, %161, %119) : (f16, f16, f16) -> f16
    %165 = "tensor.extract"(%135, %16, %16) : (tensor<?x?xi64>, index, index) -> i64
    %166 = "spirv.CL.s_min"(%86, %158) : (i64, i64) -> i64
    %167 = "math.fma"(%150, %106, %126) <{fastmath = #arith.fastmath<none>}> : (f16, f16, f16) -> f16
    %168 = "index.mul"(%37, %21) : (index, index) -> index
    %169 = "index.maxu"(%47, %113) : (index, index) -> index
    %170 = "spirv.GL.FClamp"(%117, %106, %104) : (f16, f16, f16) -> f16
    %171 = "index.add"(%29, %47) : (index, index) -> index
    %172 = "spirv.IsNan"(%142) : (f16) -> i1
    %173 = "vector.broadcast"(%38) : (index) -> vector<27xindex>
    %174 = "vector.broadcast"(%114) : (i1) -> vector<27xi1>
    %175 = "vector.broadcast"(%13) : (i16) -> vector<27xi16>
    "vector.scatter"(%73, %16, %25, %173, %174, %175) : (memref<?x13xi16>, index, index, vector<27xindex>, vector<27xi1>, vector<27xi16>) -> ()
    %176 = "spirv.GL.Cosh"(%106) : (f16) -> f16
    %177 = "affine.if"(%17) ({
      %209 = "vector.broadcast"(%164) : (f16) -> vector<29xf16>
      %210 = "index.divu"(%22, %40) : (index, index) -> index
      %211 = "math.ctlz"(%114) : (i1) -> i1
      %212 = "math.cttz"(%8) : (i1) -> i1
      %213 = "tensor.empty"(%23) : (index) -> tensor<?x13x13x11xf16>
      %214 = "linalg.broadcast"(%56, %213) <{dimensions = array<i64: 3>}> ({
      ^bb0(%arg1: f16, %arg2: f16):
        "linalg.yield"(%arg1) : (f16) -> ()
      }) : (tensor<?x13x13xf16>, tensor<?x13x13x11xf16>) -> tensor<?x13x13x11xf16>
      %215 = "arith.shrui"(%96, %146) : (i1, i1) -> i1
      %216 = "vector.extract"(%82) <{static_position = array<i64: 1>}> : (vector<2xi32>) -> i32
      %217 = "math.absi"(%0) : (i64) -> i64
      "affine.yield"(%1) : (f32) -> ()
    }, {
      %209 = "vector.broadcast"(%93) : (i1) -> vector<29x13x13xi1>
      %210 = "arith.shrui"(%4, %87) : (i64, i64) -> i64
      %211 = "index.xor"(%45, %38) : (index, index) -> index
      %212 = "math.ctpop"(%172) : (i1) -> i1
      %213 = "arith.constant"() <{value = 0 : i32}> : () -> i32
      %214 = "vector.transfer_read"(%68, %33, %33, %213) <{operandSegmentSizes = array<i32: 1, 2, 1, 0>, permutation_map = affine_map<(d0, d1) -> ()>}> : (memref<?x13xi32>, index, index, i32) -> vector<i32>
      %215 = "vector.broadcast"(%89) : (f32) -> vector<29x13x13xf32>
      %216 = "vector.fma"(%215, %215, %215) : (vector<29x13x13xf32>, vector<29x13x13xf32>, vector<29x13x13xf32>) -> vector<29x13x13xf32>
      %217 = "index.add"(%90, %18) : (index, index) -> index
      %218 = "vector.insertelement"(%107, %82, %19) : (i32, vector<2xi32>, index) -> vector<2xi32>
      "affine.yield"(%11) : (f32) -> ()
    }) {condition = affine_set<(d0) : (d0 ceildiv 64 >= 0)>} : (index) -> f32
    %178 = "vector.broadcast"(%89) : (f32) -> vector<13x13xf32>
    %179 = "vector.fma"(%178, %178, %178) : (vector<13x13xf32>, vector<13x13xf32>, vector<13x13xf32>) -> vector<13x13xf32>
    %180 = "bufferization.to_memref"(%62) : (tensor<?xf32>) -> memref<?xf32>
    %181 = "spirv.LogicalNot"(%146) : (i1) -> i1
    %182 = "spirv.GL.SAbs"(%107) : (i32) -> i32
    %183 = "index.floordivs"(%21, %28) : (index, index) -> index
    %184 = "arith.remui"(%147, %103) : (i1, i1) -> i1
    %185 = "spirv.GL.FClamp"(%106, %142, %143) : (f16, f16, f16) -> f16
    %186 = "index.divs"(%171, %168) : (index, index) -> index
    %187 = "math.absf"(%142) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
    %188 = "spirv.GL.SMin"(%182, %182) : (i32, i32) -> i32
    %189 = "index.sizeof"() : () -> index
    %190 = "spirv.GL.Sinh"(%14) : (f16) -> f16
    %191 = "spirv.GL.SClamp"(%182, %182, %182) : (i32, i32, i32) -> i32
    %192 = "spirv.ULessThan"(%107, %191) : (i32, i32) -> i1
    %193 = "arith.remf"(%2, %190) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %194 = "spirv.GL.Cosh"(%104) : (f16) -> f16
    %195 = "spirv.CL.ceil"(%125) : (f16) -> f16
    %196 = "index.mul"(%34, %24) : (index, index) -> index
    %197 = "spirv.LogicalAnd"(%15, %147) : (i1, i1) -> i1
    %198 = "math.sqrt"(%176) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
    %199 = "index.ceildivu"(%33, %44) : (index, index) -> index
    %200 = "spirv.GL.SClamp"(%188, %191, %3) : (i32, i32, i32) -> i32
    %201 = "spirv.LogicalNot"(%7) : (i1) -> i1
    %202 = "vector.transfer_read"(%56, %16, %171, %47, %2) <{operandSegmentSizes = array<i32: 1, 3, 1, 0>, permutation_map = affine_map<(d0, d1, d2) -> (d2)>}> : (tensor<?x13x13xf16>, index, index, index, f16) -> vector<11xf16>
    %203 = "spirv.CL.s_abs"(%188) : (i32) -> i32
    %204 = "math.log10"(%117) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
    %205 = "bufferization.clone"(%69) : (memref<29x29xi1>) -> memref<29x29xi1>
    %206 = "bufferization.to_memref"(%48) : (tensor<29x13x13xi1>) -> memref<29x13x13xi1>
    %207 = "scf.parallel"(%36, %47, %24, %20, %47, %29, %1) <{operandSegmentSizes = array<i32: 2, 2, 2, 1>}> ({
    ^bb0(%arg1: index, %arg2: index):
      %209 = "index.add"(%arg1, %169) : (index, index) -> index
      %210 = "tensor.rank"(%49) : (tensor<29x13x13xi1>) -> index
      %211 = "arith.divf"(%6, %89) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %212 = "index.divs"(%32, %arg2) : (index, index) -> index
      %213 = "bufferization.to_memref"(%61) : (tensor<?x29xf16>) -> memref<?x29xf16>
      %214 = "math.ceil"(%2) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %215 = "arith.constant"() <{value = 4.601600e+04 : f16}> : () -> f16
      %216 = "math.ctlz"(%59) : (tensor<?x13x13xi16>) -> tensor<?x13x13xi16>
      %217 = "tensor.empty"(%38) : (index) -> tensor<?x13x13xf16>
      %218 = "linalg.map"(%56, %56, %56, %217) ({
      ^bb0(%arg3: f16, %arg4: f16, %arg5: f16):
        %228 = "math.expm1"(%arg4) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %229 = "math.log10"(%61) <{fastmath = #arith.fastmath<none>}> : (tensor<?x29xf16>) -> tensor<?x29xf16>
        %230 = "arith.andi"(%87, %144) : (i64, i64) -> i64
        %231 = "tensor.cast"(%58) : (tensor<29xi16>) -> tensor<?xi16>
        %232 = "index.floordivs"(%169, %18) : (index, index) -> index
        %233 = "affine.load"(%72, %45, %46) <{map = affine_map<(d0, d1) -> (d0, d1)>}> : (memref<29x29xi64>, index, index) -> i64
        %234 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<29x29xi32>
        "linalg.transpose"(%51, %234) <{permutation = array<i64: 1, 0>}> ({
        ^bb0(%arg6: i32, %arg7: i32):
          "linalg.yield"(%arg6) : (i32) -> ()
        }) : (tensor<29x29xi32>, memref<29x29xi32>) -> ()
        %235 = "arith.minsi"(%182, %107) : (i32, i32) -> i32
        %236 = "memref.atomic_rmw"(%154, %213, %16, %41) <{kind = 2 : i64}> : (f16, memref<?x29xf16>, index, index) -> f16
        %237 = "index.divu"(%196, %arg1) : (index, index) -> index
        %238 = "math.ctlz"(%4) : (i64) -> i64
        %239 = "bufferization.clone"(%205) : (memref<29x29xi1>) -> memref<29x29xi1>
        %240 = "tensor.cast"(%217) : (tensor<?x13x13xf16>) -> tensor<11x13x13xf16>
        %241 = "index.floordivs"(%40, %41) : (index, index) -> index
        %242 = "vector.multi_reduction"(%82, %3) <{kind = #vector.kind<or>, reduction_dims = [0]}> : (vector<2xi32>, i32) -> i32
        %243 = "tensor.empty"() : () -> tensor<13x13xi64>
        %244 = "vector.broadcast"(%4) : (i64) -> vector<29x13x13xi64>
        %245 = "vector.broadcast"(%103) : (i1) -> vector<29x13x13xi1>
        %246 = "vector.broadcast"(%200) : (i32) -> vector<29x13x13xi32>
        %247 = "vector.gather"(%243, %113, %17, %246, %245, %244) : (tensor<13x13xi64>, index, index, vector<29x13x13xi32>, vector<29x13x13xi1>, vector<29x13x13xi64>) -> vector<29x13x13xi64>
        %248 = "math.cos"(%54) <{fastmath = #arith.fastmath<none>}> : (tensor<?x?x13xf32>) -> tensor<?x?x13xf32>
        %249 = "math.ceil"(%157) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %250 = "vector.create_mask"(%44) : (index) -> vector<29xi1>
        %251 = "tensor.cast"(%231) : (tensor<?xi16>) -> tensor<11xi16>
