"builtin.module"() ({
  "func.func"() <{function_type = (memref<?x?xi64>) -> index, sym_name = "func1", sym_visibility = "private"}> ({
  ^bb0(%arg0: memref<?x?xi64>):
    %0 = "arith.constant"() <{value = 522805532 : i64}> : () -> i64
    %1 = "arith.constant"() <{value = 1.01992582E+9 : f32}> : () -> f32
    %2 = "arith.constant"() <{value = 422120461 : i64}> : () -> i64
    %3 = "arith.constant"() <{value = true}> : () -> i1
    %4 = "arith.constant"() <{value = 1068799538 : i32}> : () -> i32
    %5 = "arith.constant"() <{value = 1187600732 : i64}> : () -> i64
    %6 = "arith.constant"() <{value = 1.74340723E+9 : f32}> : () -> f32
    %7 = "arith.constant"() <{value = 26057 : i16}> : () -> i16
    %8 = "arith.constant"() <{value = 1.400000e+04 : f16}> : () -> f16
    %9 = "arith.constant"() <{value = 20183 : i16}> : () -> i16
    %10 = "arith.constant"() <{value = 0x4DC9F4BD : f32}> : () -> f32
    %11 = "arith.constant"() <{value = 5.043200e+04 : f16}> : () -> f16
    %12 = "arith.constant"() <{value = false}> : () -> i1
    %13 = "arith.constant"() <{value = 24280 : i16}> : () -> i16
    %14 = "arith.constant"() <{value = 272050492 : i32}> : () -> i32
    %15 = "arith.constant"() <{value = 1.4451241E+9 : f32}> : () -> f32
    %16 = "arith.constant"() <{value = 0 : index}> : () -> index
    %17 = "arith.constant"() <{value = 1 : index}> : () -> index
    %18 = "arith.constant"() <{value = 2 : index}> : () -> index
    %19 = "arith.constant"() <{value = 3 : index}> : () -> index
    %20 = "arith.constant"() <{value = 4 : index}> : () -> index
    %21 = "arith.constant"() <{value = 5 : index}> : () -> index
    %22 = "arith.constant"() <{value = 6 : index}> : () -> index
    %23 = "arith.constant"() <{value = 7 : index}> : () -> index
    %24 = "arith.constant"() <{value = 8 : index}> : () -> index
    %25 = "arith.constant"() <{value = 9 : index}> : () -> index
    %26 = "arith.constant"() <{value = 10 : index}> : () -> index
    %27 = "arith.constant"() <{value = 11 : index}> : () -> index
    %28 = "arith.constant"() <{value = 12 : index}> : () -> index
    %29 = "arith.constant"() <{value = 13 : index}> : () -> index
    %30 = "arith.constant"() <{value = 14 : index}> : () -> index
    %31 = "arith.constant"() <{value = 15 : index}> : () -> index
    %32 = "arith.constant"() <{value = 16 : index}> : () -> index
    %33 = "arith.constant"() <{value = 17 : index}> : () -> index
    %34 = "arith.constant"() <{value = 18 : index}> : () -> index
    %35 = "arith.constant"() <{value = 19 : index}> : () -> index
    %36 = "arith.constant"() <{value = 20 : index}> : () -> index
    %37 = "arith.constant"() <{value = 21 : index}> : () -> index
    %38 = "arith.constant"() <{value = 22 : index}> : () -> index
    %39 = "arith.constant"() <{value = 23 : index}> : () -> index
    %40 = "arith.constant"() <{value = 24 : index}> : () -> index
    %41 = "arith.constant"() <{value = 25 : index}> : () -> index
    %42 = "arith.constant"() <{value = 26 : index}> : () -> index
    %43 = "arith.constant"() <{value = 27 : index}> : () -> index
    %44 = "arith.constant"() <{value = 28 : index}> : () -> index
    %45 = "arith.constant"() <{value = 29 : index}> : () -> index
    %46 = "arith.constant"() <{value = 30 : index}> : () -> index
    %47 = "arith.constant"() <{value = 31 : index}> : () -> index
    %48 = "tensor.empty"() : () -> tensor<13x13xi64>
    %49 = "tensor.empty"() : () -> tensor<25xi1>
    %50 = "tensor.empty"(%26) : (index) -> tensor<?xf32>
    %51 = "tensor.empty"(%38) : (index) -> tensor<?xi64>
    %52 = "tensor.empty"() : () -> tensor<13x13xf32>
    %53 = "tensor.empty"() : () -> tensor<13x27x13xi32>
    %54 = "tensor.empty"(%28) : (index) -> tensor<?xf16>
    %55 = "tensor.empty"() : () -> tensor<27xf32>
    %56 = "tensor.empty"(%25, %19) : (index, index) -> tensor<?x?x13xi16>
    %57 = "tensor.empty"() : () -> tensor<13x13xi1>
    %58 = "tensor.empty"() : () -> tensor<13x27x13xi32>
    %59 = "tensor.empty"(%16) : (index) -> tensor<?x13xf16>
    %60 = "tensor.empty"(%45) : (index) -> tensor<?x27x13xi1>
    %61 = "tensor.empty"(%44) : (index) -> tensor<?x13xi1>
    %62 = "tensor.empty"(%21) : (index) -> tensor<?x13xi64>
    %63 = "tensor.empty"(%22) : (index) -> tensor<?xi64>
    %64 = "memref.alloc"(%39) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xf16>
    %65 = "memref.alloc"(%38) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x27x13xf16>
    %66 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27xf32>
    %67 = "memref.alloc"(%24, %21) <{operandSegmentSizes = array<i32: 2, 0>}> : (index, index) -> memref<?x?x13xi16>
    %68 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x13xi16>
    %69 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x27x13xf16>
    %70 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27xi1>
    %71 = "memref.alloc"(%28) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xf32>
    %72 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x27x13xi32>
    %73 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27xi32>
    %74 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x13xi32>
    %75 = "memref.alloc"(%42) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x13xi32>
    %76 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x13xi16>
    %77 = "memref.alloc"(%21) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi64>
    %78 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x27x13xf32>
    %79 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x13xf32>
    %80 = "tensor.empty"(%16) : (index) -> tensor<?x13xi64>
    %81 = "linalg.map"(%62, %62, %80) ({
    ^bb0(%arg1: i64, %arg2: i64):
      %219 = "vector.broadcast"(%3) : (i1) -> vector<27xi1>
      %220 = "vector.transpose"(%219) <{transp = [0]}> : (vector<27xi1>) -> vector<27xi1>
      %221 = "arith.minsi"(%4, %14) : (i32, i32) -> i32
      %222 = "math.absf"(%6) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %223 = "math.rsqrt"(%11) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %224 = "math.ctpop"(%62) : (tensor<?x13xi64>) -> tensor<?x13xi64>
      %225 = "arith.constant"() <{value = 0x4D9EFCEF : f32}> : () -> f32
      %226 = "vector.extract_strided_slice"(%219) <{offsets = [8], sizes = [11], strides = [1]}> : (vector<27xi1>) -> vector<11xi1>
      "memref.assume_alignment"(%71) <{alignment = 16 : i32}> : (memref<?xf32>) -> ()
      %227 = "math.tan"(%50) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
      %228 = "linalg.copy"(%59, %59) <{operandSegmentSizes = array<i32: 1, 1>}> ({
      ^bb0(%arg3: f16, %arg4: f16):
        "linalg.yield"(%arg3) : (f16) -> ()
      }) : (tensor<?x13xf16>, tensor<?x13xf16>) -> tensor<?x13xf16>
      %229 = "vector.load"(%67, %16, %16, %18) : (memref<?x?x13xi16>, index, index, index) -> vector<13x13xi16>
      %230 = "affine.if"(%32, %31) ({
        %252 = "tensor.empty"() : () -> tensor<13x27x13xi64>
        %253 = "tensor.empty"() : () -> tensor<27xi32>
        %254 = "tensor.empty"() : () -> tensor<i32>
        %255 = "linalg.dot"(%73, %253, %254) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg3: i32, %arg4: i32, %arg5: i32):
          %262 = "arith.muli"(%arg3, %arg4) : (i32, i32) -> i32
          %263 = "arith.addi"(%arg5, %262) : (i32, i32) -> i32
          "linalg.yield"(%263) : (i32) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>]} : (memref<27xi32>, tensor<27xi32>, tensor<i32>) -> tensor<i32>
        %256 = "vector.load"(%68, %26, %20) : (memref<13x13xi16>, index, index) -> vector<27xi16>
        %257 = "math.round"(%11) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        "linalg.transpose"(%51, %77) <{permutation = array<i64: 0>}> ({
        ^bb0(%arg3: i64, %arg4: i64):
          "linalg.yield"(%arg3) : (i64) -> ()
        }) : (tensor<?xi64>, memref<?xi64>) -> ()
        %258 = "tensor.empty"() : () -> tensor<13x13xi16>
        %259 = "tensor.cast"(%48) : (tensor<13x13xi64>) -> tensor<?x?xi64>
        %260 = "linalg.copy"(%253, %253) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg3: i32, %arg4: i32):
          "linalg.yield"(%arg3) : (i32) -> ()
        }) : (tensor<27xi32>, tensor<27xi32>) -> tensor<27xi32>
        %261 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<25xf32>
        "affine.yield"(%261) : (memref<25xf32>) -> ()
      }, {
        %252 = "memref.load"(%77, %16) <{nontemporal = false}> : (memref<?xi64>, index) -> i64
        %253 = "tensor.insert"(%12, %60, %16, %21, %18) : (i1, tensor<?x27x13xi1>, index, index, index) -> tensor<?x27x13xi1>
        %254 = "vector.bitcast"(%219) : (vector<27xi1>) -> vector<27xi1>
        %255 = "arith.addf"(%11, %11) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %256 = "math.floor"(%50) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %257 = "arith.cmpf"(%11, %11) <{predicate = 11 : i64}> : (f16, f16) -> i1
        %258 = "vector.extract_strided_slice"(%229) <{offsets = [1], sizes = [1], strides = [1]}> : (vector<13x13xi16>) -> vector<1x13xi16>
        %259 = "math.log1p"(%55) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf32>) -> tensor<27xf32>
        %260 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<25xf32>
        "affine.yield"(%260) : (memref<25xf32>) -> ()
      }) {condition = affine_set<(d0, d1) : (d1 - 64 >= 0, d1 == 0)>} : (index, index) -> memref<25xf32>
      %231 = "vector.extract"(%229) <{static_position = array<i64: 1>}> : (vector<13x13xi16>) -> vector<13xi16>
      %232 = "math.atan2"(%1, %15) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %233 = "vector.contract"(%229, %229, %229) <{indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = [#vector.iterator_type<parallel>, #vector.iterator_type<parallel>, #vector.iterator_type<reduction>], kind = #vector.kind<mul>}> : (vector<13x13xi16>, vector<13x13xi16>, vector<13x13xi16>) -> vector<13x13xi16>
      %234 = "vector.transpose"(%229) <{transp = [0, 1]}> : (vector<13x13xi16>) -> vector<13x13xi16>
      %235 = "index.shru"(%29, %17) : (index, index) -> index
      %236 = "vector.splat"(%38) : (index) -> vector<13x13xindex>
      %237 = "vector.contract"(%219, %219, %3) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<maxsi>}> : (vector<27xi1>, vector<27xi1>, i1) -> i1
      %238 = "arith.minsi"(%2, %5) : (i64, i64) -> i64
      %239 = "tensor.empty"() : () -> tensor<169xi64>
      %240 = "tensor.unpack"(%48, %239, %29) <{inner_dims_pos = array<i64: 0>, outer_dims_perm = array<i64: 0>, static_inner_tiles = array<i64: -9223372036854775808>}> : (tensor<13x13xi64>, tensor<169xi64>, index) -> tensor<169xi64>
      %241 = "tensor.empty"() : () -> tensor<169xi1>
      %242 = "tensor.unpack"(%57, %241, %29) <{inner_dims_pos = array<i64: 0>, outer_dims_perm = array<i64: 0>, static_inner_tiles = array<i64: -9223372036854775808>}> : (tensor<13x13xi1>, tensor<169xi1>, index) -> tensor<169xi1>
      %243 = "math.absf"(%52) <{fastmath = #arith.fastmath<none>}> : (tensor<13x13xf32>) -> tensor<13x13xf32>
      %244 = "index.add"(%26, %44) : (index, index) -> index
      %245 = "arith.mulf"(%11, %8) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %246 = "tensor.expand_shape"(%59) <{reassociation = [[0], [1, 2]]}> : (tensor<?x13xf16>) -> tensor<?x13x1xf16>
      %247 = "arith.minui"(%7, %9) : (i16, i16) -> i16
      %248 = "math.exp"(%52) <{fastmath = #arith.fastmath<none>}> : (tensor<13x13xf32>) -> tensor<13x13xf32>
      "scf.parallel"(%46, %34, %42, %29, %30, %47) <{operandSegmentSizes = array<i32: 2, 2, 2, 0>}> ({
      ^bb0(%arg3: index, %arg4: index):
        %252 = "math.roundeven"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13xf16>) -> tensor<?x13xf16>
        %253 = "vector.broadcast"(%0) : (i64) -> vector<i64>
        %254 = "vector.transfer_write"(%253, %62, %45, %42) <{operandSegmentSizes = array<i32: 1, 1, 2, 0>, permutation_map = affine_map<(d0, d1) -> ()>}> : (vector<i64>, tensor<?x13xi64>, index, index) -> tensor<?x13xi64>
        %255 = "arith.muli"(%0, %arg1) : (i64, i64) -> i64
        %256 = "memref.alloca"(%37) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x27x13xi16>
        %257 = "arith.ori"(%arg2, %arg2) : (i64, i64) -> i64
        %258 = "index.and"(%38, %32) : (index, index) -> index
        %259 = "math.rsqrt"(%50) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %260 = "vector.splat"(%15) : (f32) -> vector<13x27x13xf32>
        %261 = "tensor.empty"() : () -> tensor<27xi32>
        %262 = "math.ctpop"(%62) : (tensor<?x13xi64>) -> tensor<?x13xi64>
        %263 = "vector.transpose"(%231) <{transp = [0]}> : (vector<13xi16>) -> vector<13xi16>
        %264 = "math.log1p"(%8) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %265 = "index.shru"(%46, %46) : (index, index) -> index
        %266 = "math.round"(%15) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %267 = "math.absi"(%51) : (tensor<?xi64>) -> tensor<?xi64>
        %268 = "bufferization.clone"(%68) : (memref<13x13xi16>) -> memref<13x13xi16>
        "scf.yield"() : () -> ()
      }) : (index, index, index, index, index, index) -> ()
      %249 = "memref.load"(%69, %23, %40, %23) <{nontemporal = false}> : (memref<13x27x13xf16>, index, index, index) -> f16
      %250 = "tensor.from_elements"(%5, %2, %0, %2, %5, %arg1, %5, %arg1, %0, %2, %2, %5, %2, %5, %5, %2, %arg1, %arg1, %arg2, %0, %2, %2, %arg1, %arg2, %0) : (i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64) -> tensor<25xi64>
      %251 = "memref.atomic_rmw"(%14, %73, %32) <{kind = 4 : i64}> : (i32, memref<27xi32>, index) -> i32
      "linalg.yield"(%arg1) : (i64) -> ()
    }) : (tensor<?x13xi64>, tensor<?x13xi64>, tensor<?x13xi64>) -> tensor<?x13xi64>
    %82 = "spirv.GL.Asin"(%15) : (f32) -> f32
    %83 = "spirv.GL.SSign"(%14) : (i32) -> i32
    %84 = "affine.max"(%28, %34, %26, %45) <{map = affine_map<(d0, d1, d2, d3) -> (((d3 + 1) ceildiv 16 + d2 ceildiv 2) * 64)>}> : (index, index, index, index) -> index
    %85 = "spirv.FOrdGreaterThanEqual"(%1, %15) : (f32, f32) -> i1
    %86 = "spirv.CL.sin"(%1) : (f32) -> f32
    %87 = "spirv.SLessThan"(%0, %2) : (i64, i64) -> i1
    %88 = "vector.broadcast"(%5) : (i64) -> vector<25xi64>
    %89 = "vector.reduction"(%88) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<add>}> : (vector<25xi64>) -> i64
    %90 = "math.ctpop"(%57) : (tensor<13x13xi1>) -> tensor<13x13xi1>
    %91 = "spirv.CL.exp"(%15) : (f32) -> f32
    %92 = "math.atan"(%52) <{fastmath = #arith.fastmath<none>}> : (tensor<13x13xf32>) -> tensor<13x13xf32>
    %93 = "vector.broadcast"(%4) : (i32) -> vector<2xi32>
    %94 = "spirv.BitwiseOr"(%93, %93) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %95 = "math.log"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13xf16>) -> tensor<?x13xf16>
    %96 = "arith.divsi"(%7, %13) : (i16, i16) -> i16
    %97 = "arith.remsi"(%12, %85) : (i1, i1) -> i1
    %98 = "affine.max"(%47, %43, %26, %31) <{map = affine_map<(d0, d1, d2, d3) -> (((d3 + 1) ceildiv 16 + d2 ceildiv 2) * 64)>}> : (index, index, index, index) -> index
    %99 = "math.copysign"(%86, %1) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
    %100 = "spirv.CL.cos"(%15) : (f32) -> f32
    %101 = "spirv.CL.u_min"(%14, %14) : (i32, i32) -> i32
    %102 = "spirv.BitwiseXor"(%93, %93) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %103 = "arith.subi"(%13, %9) : (i16, i16) -> i16
    %104 = "spirv.FOrdLessThan"(%10, %10) : (f32, f32) -> i1
    %105 = "tensor.empty"() : () -> tensor<27xi1>
    %106 = "tensor.empty"() : () -> tensor<i1>
    %107 = "linalg.dot"(%70, %105, %106) <{operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg1: i1, %arg2: i1, %arg3: i1):
      %219 = "arith.andi"(%arg1, %arg2) : (i1, i1) -> i1
      %220 = "arith.ori"(%arg3, %219) : (i1, i1) -> i1
      "linalg.yield"(%220) : (i1) -> ()
    }) {linalg.memoized_indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>]} : (memref<27xi1>, tensor<27xi1>, tensor<i1>) -> tensor<i1>
    %108 = "bufferization.to_tensor"(%64) : (memref<?xf16>) -> tensor<?xf16>
    %109 = "spirv.CL.pow"(%11, %8) : (f16, f16) -> f16
    %110 = "math.fpowi"(%82, %83) <{fastmath = #arith.fastmath<none>}> : (f32, i32) -> f32
    %111 = "spirv.CL.s_max"(%0, %5) : (i64, i64) -> i64
    %112 = "spirv.LogicalAnd"(%3, %87) : (i1, i1) -> i1
    %113 = "spirv.SGreaterThan"(%93, %93) : (vector<2xi32>, vector<2xi32>) -> vector<2xi1>
    %114 = "spirv.BitFieldSExtract"(%93, %14, %2) : (vector<2xi32>, i32, i64) -> vector<2xi32>
    %115 = "math.cttz"(%12) : (i1) -> i1
    %116 = "spirv.Not"(%4) : (i32) -> i32
    %117 = "arith.cmpi"(%0, %0) <{predicate = 0 : i64}> : (i64, i64) -> i1
    %118 = "spirv.GL.Atan"(%109) : (f16) -> f16
    %119 = "math.atan"(%6) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %120 = "spirv.GL.UMax"(%116, %4) : (i32, i32) -> i32
    %121 = "arith.shli"(%101, %4) : (i32, i32) -> i32
    %122 = "spirv.CL.erf"(%82) : (f32) -> f32
    %123 = "math.fma"(%1, %91, %15) <{fastmath = #arith.fastmath<none>}> : (f32, f32, f32) -> f32
    %124 = "math.sqrt"(%55) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf32>) -> tensor<27xf32>
    %125 = "arith.remsi"(%111, %2) : (i64, i64) -> i64
    %126 = "spirv.IEqual"(%14, %83) : (i32, i32) -> i1
    %127 = "spirv.IsInf"(%6) : (f32) -> i1
    %128 = "spirv.SGreaterThan"(%111, %2) : (i64, i64) -> i1
    %129 = "index.and"(%39, %24) : (index, index) -> index
    %130 = "spirv.CL.rint"(%122) : (f32) -> f32
    %131 = "math.roundeven"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13xf16>) -> tensor<?x13xf16>
    %132 = "affine.max"(%33, %23) <{map = affine_map<(d0)[s0] -> (-(d0 floordiv 2))>}> : (index, index) -> index
    %133 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<27xi64>
    %134 = "math.sqrt"(%91) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %135 = "arith.minsi"(%0, %111) : (i64, i64) -> i64
    %136 = "arith.addf"(%109, %8) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
    %137 = "tensor.empty"() : () -> tensor<27xi16>
    %138 = "vector.broadcast"(%13) : (i16) -> vector<13x13xi16>
    %139 = "vector.broadcast"(%126) : (i1) -> vector<13x13xi1>
    %140 = "vector.broadcast"(%83) : (i32) -> vector<13x13xi32>
    %141 = "vector.gather"(%137, %40, %140, %139, %138) : (tensor<27xi16>, index, vector<13x13xi32>, vector<13x13xi1>, vector<13x13xi16>) -> vector<13x13xi16>
    %142 = "spirv.LogicalNotEqual"(%3, %128) : (i1, i1) -> i1
    %143 = "spirv.FUnordGreaterThan"(%1, %1) : (f32, f32) -> i1
    %144 = "spirv.GL.Ceil"(%11) : (f16) -> f16
    %145 = "arith.remui"(%112, %85) : (i1, i1) -> i1
    %146 = "index.ceildivu"(%26, %42) : (index, index) -> index
    %147 = "math.log2"(%91) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %148 = "math.roundeven"(%122) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
    %149 = "spirv.CL.u_min"(%93, %93) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %150 = "spirv.CL.fabs"(%109) : (f16) -> f16
    %151 = "tensor.empty"() : () -> tensor<13x13xi16>
    %152 = "vector.broadcast"(%9) : (i16) -> vector<25xi16>
    %153 = "vector.broadcast"(%143) : (i1) -> vector<25xi1>
    %154 = "vector.broadcast"(%83) : (i32) -> vector<25xi32>
    %155 = "vector.gather"(%151, %46, %46, %154, %153, %152) : (tensor<13x13xi16>, index, index, vector<25xi32>, vector<25xi1>, vector<25xi16>) -> vector<25xi16>
    %156 = "vector.extract_strided_slice"(%152) <{offsets = [4], sizes = [5], strides = [1]}> : (vector<25xi16>) -> vector<5xi16>
    %157 = "arith.ori"(%120, %120) : (i32, i32) -> i32
    %158 = "math.round"(%55) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf32>) -> tensor<27xf32>
    %159 = "memref.atomic_rmw"(%8, %69, %27, %16, %25) <{kind = 0 : i64}> : (f16, memref<13x27x13xf16>, index, index, index) -> f16
    %160 = "vector.broadcast"(%11) : (f16) -> vector<13x13xf16>
    %161 = "spirv.FNegate"(%130) : (f32) -> f32
    "memref.assume_alignment"(%65) <{alignment = 16 : i32}> : (memref<?x27x13xf16>) -> ()
    %162 = "vector.contract"(%155, %152, %9) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<and>}> : (vector<25xi16>, vector<25xi16>, i16) -> i16
    %163 = "memref.alloca"(%44) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?x13xi64>
    "scf.index_switch"(%24) <{cases = array<i64: 1, 2, 3>}> ({
      "vector.warp_execute_on_lane_0"(%16) <{warp_size = 32 : i64}> ({
        %236 = "math.tanh"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13xf16>) -> tensor<?x13xf16>
        %237 = "tensor.extract"(%60, %16, %16, %18) : (tensor<?x27x13xi1>, index, index, index) -> i1
        %238 = "bufferization.to_tensor"(%77) : (memref<?xi64>) -> tensor<?xi64>
        %239 = "arith.divui"(%112, %104) : (i1, i1) -> i1
        %240 = "vector.matrix_multiply"(%93, %93) <{lhs_columns = 2 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32}> : (vector<2xi32>, vector<2xi32>) -> vector<1xi32>
        %241 = "vector.transpose"(%139) <{transp = [1, 0]}> : (vector<13x13xi1>) -> vector<13x13xi1>
        %242 = "linalg.copy"(%56, %56) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg1: i16, %arg2: i16):
          "linalg.yield"(%arg1) : (i16) -> ()
        }) : (tensor<?x?x13xi16>, tensor<?x?x13xi16>) -> tensor<?x?x13xi16>
        %243 = "math.round"(%10) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        "vector.yield"() : () -> ()
      }) : (index) -> ()
      %219 = "memref.alloca"(%45) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<?xi16>
      %220 = "tensor.empty"() : () -> tensor<25xf32>
      %221 = "vector.broadcast"(%6) : (f32) -> vector<25xf32>
      %222 = "vector.gather"(%220, %29, %154, %153, %221) : (tensor<25xf32>, index, vector<25xi32>, vector<25xi1>, vector<25xf32>) -> vector<25xf32>
      "affine.parallel"() <{lowerBoundsGroups = dense<1> : tensor<3xi32>, lowerBoundsMap = affine_map<() -> (0, 0, 0)>, reductions = [], steps = [1, 1, 1], upperBoundsGroups = dense<1> : tensor<3xi32>, upperBoundsMap = affine_map<() -> (13, 17, 27)>}> ({
      ^bb0(%arg1: index, %arg2: index, %arg3: index):
        %236 = "tensor.cast"(%48) : (tensor<13x13xi64>) -> tensor<?x?xi64>
        "affine.yield"() : () -> ()
      }) : () -> ()
      "scf.execute_region"() ({
        %236 = "math.exp"(%55) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf32>) -> tensor<27xf32>
        %237 = "arith.floordivsi"(%2, %0) : (i64, i64) -> i64
        %238 = "tensor.expand_shape"(%53) <{reassociation = [[0], [1], [2, 3]]}> : (tensor<13x27x13xi32>) -> tensor<13x27x13x1xi32>
        %239 = "arith.subi"(%85, %12) : (i1, i1) -> i1
        %240 = "bufferization.clone"(%73) : (memref<27xi32>) -> memref<27xi32>
        %241 = "index.shl"(%146, %31) : (index, index) -> index
        %242 = "math.round"(%50) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %243 = "affine.load"(%65, %31, %19, %35) <{map = affine_map<(d0, d1, d2) -> (d0, d1, d2)>}> : (memref<?x27x13xf16>, index, index, index) -> f16
        %244 = "arith.remf"(%100, %6) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %245 = "math.atan"(%109) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %246 = "arith.cmpi"(%87, %128) <{predicate = 8 : i64}> : (i1, i1) -> i1
        %247 = "tensor.empty"() : () -> tensor<13x13xf32>
        %248 = "index.maxu"(%27, %17) : (index, index) -> index
        %249 = "math.rsqrt"(%6) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %250 = "linalg.copy"(%108, %54) <{operandSegmentSizes = array<i32: 1, 1>}> ({
        ^bb0(%arg1: f16, %arg2: f16):
          "linalg.yield"(%arg1) : (f16) -> ()
        }) : (tensor<?xf16>, tensor<?xf16>) -> tensor<?xf16>
        %251 = "math.ctpop"(%49) : (tensor<25xi1>) -> tensor<25xi1>
        "scf.yield"() : () -> ()
      }) : () -> ()
      %223 = "memref.alloc"(%84, %26) <{operandSegmentSizes = array<i32: 2, 0>}> : (index, index) -> memref<13x?x?xi16>
      "linalg.transpose"(%67, %223) <{permutation = array<i64: 2, 0, 1>}> ({
      ^bb0(%arg1: i16, %arg2: i16):
        "linalg.yield"(%arg1) : (i16) -> ()
      }) : (memref<?x?x13xi16>, memref<13x?x?xi16>) -> ()
      %224 = "tensor.cast"(%58) : (tensor<13x27x13xi32>) -> tensor<?x?x?xi32>
      %225 = "arith.andi"(%7, %13) : (i16, i16) -> i16
      %226 = "math.ctpop"(%112) : (i1) -> i1
      %227 = "math.atan2"(%52, %52) <{fastmath = #arith.fastmath<none>}> : (tensor<13x13xf32>, tensor<13x13xf32>) -> tensor<13x13xf32>
      %228 = "vector.broadcast"(%143) : (i1) -> vector<2xi1>
      "vector.compressstore"(%75, %16, %27, %228, %93) : (memref<?x13xi32>, index, index, vector<2xi1>, vector<2xi32>) -> ()
      %229 = "tensor.empty"() : () -> tensor<13x13xi64>
      %230 = "linalg.map"(%48, %48, %48, %229) ({
      ^bb0(%arg1: i64, %arg2: i64, %arg3: i64):
        %236 = "math.ctpop"(%48) : (tensor<13x13xi64>) -> tensor<13x13xi64>
        %237 = "index.and"(%129, %42) : (index, index) -> index
        %238 = "math.absf"(%10) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %239 = "bufferization.to_tensor"(%77) : (memref<?xi64>) -> tensor<?xi64>
        %240 = "arith.minsi"(%127, %128) : (i1, i1) -> i1
        %241 = "vector.create_mask"(%45, %18) : (index, index) -> vector<13x13xi1>
        %242 = "math.rsqrt"(%50) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %243 = "index.shrs"(%24, %19) : (index, index) -> index
        %244 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<25xf16>
        %245 = "vector.gather"(%244, %40, %140, %241, %160) : (memref<25xf16>, index, vector<13x13xi32>, vector<13x13xi1>, vector<13x13xf16>) -> vector<13x13xf16>
        %246 = "arith.subi"(%142, %104) : (i1, i1) -> i1
        %247 = "linalg.matmul"(%57, %57, %57) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg4: i1, %arg5: i1, %arg6: i1):
          %270 = "arith.andi"(%arg4, %arg5) : (i1, i1) -> i1
          %271 = "arith.ori"(%arg6, %270) : (i1, i1) -> i1
          "linalg.yield"(%271) : (i1) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<13x13xi1>, tensor<13x13xi1>, tensor<13x13xi1>) -> tensor<13x13xi1>
        %248 = "index.divs"(%18, %146) : (index, index) -> index
        %249 = "tensor.insert"(%5, %62, %16, %20) : (i64, tensor<?x13xi64>, index, index) -> tensor<?x13xi64>
        %250 = "index.shru"(%30, %20) : (index, index) -> index
        %251 = "arith.ori"(%4, %120) : (i32, i32) -> i32
        %252 = "memref.atomic_rmw"(%5, %77, %16) <{kind = 7 : i64}> : (i64, memref<?xi64>, index) -> i64
        %253 = "math.exp"(%10) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %254 = "memref.load"(%79, %27, %21) <{nontemporal = false}> : (memref<13x13xf32>, index, index) -> f32
        %255 = "math.exp"(%50) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %256 = "index.divs"(%28, %44) : (index, index) -> index
        %257 = "arith.shrsi"(%14, %14) : (i32, i32) -> i32
        %258 = "arith.ori"(%127, %127) : (i1, i1) -> i1
        %259 = "math.roundeven"(%11) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %260 = "arith.andi"(%3, %104) : (i1, i1) -> i1
        %261 = "arith.addi"(%101, %83) : (i32, i32) -> i32
        %262 = "math.floor"(%220) <{fastmath = #arith.fastmath<none>}> : (tensor<25xf32>) -> tensor<25xf32>
        %263 = "affine.max"(%18) <{map = affine_map<(d0) -> ((d0 floordiv 8 + 1) ceildiv 64)>}> : (index) -> index
        %264 = "tensor.empty"(%243) : (index) -> tensor<?xi1>
        %265 = "arith.subi"(%4, %4) : (i32, i32) -> i32
        %266 = "arith.shrui"(%2, %arg1) : (i64, i64) -> i64
        %267 = "tensor.cast"(%108) : (tensor<?xf16>) -> tensor<25xf16>
        %268 = "tensor.empty"() : () -> tensor<169xi1>
        %269 = "tensor.unpack"(%57, %268, %29) <{inner_dims_pos = array<i64: 0>, outer_dims_perm = array<i64: 0>, static_inner_tiles = array<i64: -9223372036854775808>}> : (tensor<13x13xi1>, tensor<169xi1>, index) -> tensor<169xi1>
        "linalg.yield"(%arg1) : (i64) -> ()
      }) : (tensor<13x13xi64>, tensor<13x13xi64>, tensor<13x13xi64>, tensor<13x13xi64>) -> tensor<13x13xi64>
      %231 = "tensor.empty"() : () -> tensor<13x13xf32>
      %232 = "linalg.map"(%52, %231) ({
      ^bb0(%arg1: f32):
        %236 = "arith.muli"(%12, %127) : (i1, i1) -> i1
        %237 = "vector.splat"(%6) : (f32) -> vector<27xf32>
        %238 = "vector.gather"(%70, %47, %140, %139, %139) : (memref<27xi1>, index, vector<13x13xi32>, vector<13x13xi1>, vector<13x13xi1>) -> vector<13x13xi1>
        %239 = "vector.contract"(%153, %153, %143) <{indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = [#vector.iterator_type<reduction>], kind = #vector.kind<add>}> : (vector<25xi1>, vector<25xi1>, i1) -> i1
        %240 = "math.log"(%52) <{fastmath = #arith.fastmath<none>}> : (tensor<13x13xf32>) -> tensor<13x13xf32>
        %241 = "math.ceil"(%109) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %242 = "arith.muli"(%112, %3) : (i1, i1) -> i1
        %243 = "memref.load"(%74, %24, %21) <{nontemporal = false}> : (memref<13x13xi32>, index, index) -> i32
        %244 = "arith.divf"(%86, %100) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %245 = "math.copysign"(%55, %55) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf32>, tensor<27xf32>) -> tensor<27xf32>
        %246 = "index.bool.constant"() <{value = true}> : () -> i1
        %247 = "math.exp"(%82) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %248 = "math.exp"(%50) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
        %249 = "index.bool.constant"() <{value = true}> : () -> i1
        %250 = "tensor.cast"(%60) : (tensor<?x27x13xi1>) -> tensor<27x27x13xi1>
        %251 = "tensor.empty"(%24) : (index) -> tensor<?x27x13xi1>
        %252 = "arith.mulf"(%8, %109) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %253 = "tensor.insert"(%8, %54, %16) : (f16, tensor<?xf16>, index) -> tensor<?xf16>
        %254 = "index.and"(%38, %22) : (index, index) -> index
        %255 = "affine.max"(%23, %42, %146, %30, %32) <{map = affine_map<(d0, d1, d2, d3)[s0] -> (d1 ceildiv 4)>}> : (index, index, index, index, index) -> index
        %256 = "tensor.extract"(%62, %16, %26) : (tensor<?x13xi64>, index, index) -> i64
        %257 = "bufferization.clone"(%69) : (memref<13x27x13xf16>) -> memref<13x27x13xf16>
        %258 = "tensor.expand_shape"(%59) <{reassociation = [[0], [1, 2]]}> : (tensor<?x13xf16>) -> tensor<?x13x1xf16>
        %259 = "affine.min"(%45, %45, %38) <{map = affine_map<(d0, d1)[s0] -> (d0 * 4)>}> : (index, index, index) -> index
        %260 = "vector.extract_strided_slice"(%154) <{offsets = [23], sizes = [2], strides = [1]}> : (vector<25xi32>) -> vector<2xi32>
        %261 = "affine.apply"(%26) <{map = affine_map<(d0) -> ((d0 + 16) * -7)>}> : (index) -> index
        %262 = "affine.apply"(%41) <{map = affine_map<(d0) -> ((d0 floordiv 8 + 1) ceildiv 64)>}> : (index) -> index
        %263 = "arith.divsi"(%112, %126) : (i1, i1) -> i1
        %264 = "bufferization.clone"(%70) : (memref<27xi1>) -> memref<27xi1>
        %265 = "memref.alloca"(%19, %24, %19) <{operandSegmentSizes = array<i32: 3, 0>}> : (index, index, index) -> memref<?x?x?xi32>
        %266 = "arith.cmpf"(%144, %8) <{predicate = 9 : i64}> : (f16, f16) -> i1
        %267 = "index.ceildivu"(%16, %146) : (index, index) -> index
        "linalg.yield"(%82) : (f32) -> ()
      }) : (tensor<13x13xf32>, tensor<13x13xf32>) -> tensor<13x13xf32>
      %233 = "arith.cmpi"(%101, %14) <{predicate = 7 : i64}> : (i32, i32) -> i1
      %234 = "arith.floordivsi"(%127, %143) : (i1, i1) -> i1
      %235 = "bufferization.to_tensor"(%67) : (memref<?x?x13xi16>) -> tensor<?x?x13xi16>
      "scf.yield"() : () -> ()
    }, {
      %219 = "index.divs"(%25, %84) : (index, index) -> index
      "affine.store"(%8, %64, %46) <{map = affine_map<(d0) -> (d0)>}> : (f16, memref<?xf16>, index) -> ()
      %220 = "math.expm1"(%130) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %221 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x13x27xi32>
      "linalg.transpose"(%53, %221) <{permutation = array<i64: 2, 0, 1>}> ({
      ^bb0(%arg1: i32, %arg2: i32):
        "linalg.yield"(%arg1) : (i32) -> ()
      }) : (tensor<13x27x13xi32>, memref<13x13x27xi32>) -> ()
      %222 = "arith.addi"(%111, %0) : (i64, i64) -> i64
      %223 = "tensor.insert"(%116, %58, %28, %24, %24) : (i32, tensor<13x27x13xi32>, index, index, index) -> tensor<13x27x13xi32>
      %224 = "arith.remf"(%10, %82) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %225 = "math.absf"(%109) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %226 = "arith.remui"(%5, %111) : (i64, i64) -> i64
      %227 = "index.add"(%47, %35) : (index, index) -> index
      %228 = "math.copysign"(%1, %161) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %229 = "arith.remui"(%87, %85) : (i1, i1) -> i1
      %230 = "arith.divsi"(%12, %87) : (i1, i1) -> i1
      %231 = "memref.alloc"(%146) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<13x?xi1>
      "linalg.transpose"(%61, %231) <{permutation = array<i64: 1, 0>}> ({
      ^bb0(%arg1: i1, %arg2: i1):
        "linalg.yield"(%arg1) : (i1) -> ()
      }) : (tensor<?x13xi1>, memref<13x?xi1>) -> ()
      %232 = "math.powf"(%52, %52) <{fastmath = #arith.fastmath<none>}> : (tensor<13x13xf32>, tensor<13x13xf32>) -> tensor<13x13xf32>
      %233 = "arith.shli"(%4, %101) : (i32, i32) -> i32
      "scf.yield"() : () -> ()
    }, {
      %219 = "affine.if"(%30) ({
        %236 = "memref.atomic_rmw"(%7, %68, %21, %17) <{kind = 1 : i64}> : (i16, memref<13x13xi16>, index, index) -> i16
        %237 = "arith.constant"() <{value = 780850408 : i64}> : () -> i64
        %238 = "tensor.collapse_shape"(%62) <{reassociation = [[0, 1]]}> : (tensor<?x13xi64>) -> tensor<?xi64>
        %239 = "arith.divsi"(%101, %101) : (i32, i32) -> i32
        %240 = "memref.load"(%74, %19, %27) <{nontemporal = false}> : (memref<13x13xi32>, index, index) -> i32
        %241 = "index.floordivs"(%20, %25) : (index, index) -> index
        %242 = "memref.atomic_rmw"(%4, %72, %18, %25, %26) <{kind = 1 : i64}> : (i32, memref<13x27x13xi32>, index, index, index) -> i32
        %243 = "math.ceil"(%108) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
        %244 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<25xf16>
        "affine.yield"(%244) : (memref<25xf16>) -> ()
      }, {
        %236 = "math.fma"(%55, %55, %55) <{fastmath = #arith.fastmath<none>}> : (tensor<27xf32>, tensor<27xf32>, tensor<27xf32>) -> tensor<27xf32>
        %237 = "linalg.matmul"(%57, %57, %57) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg1: i1, %arg2: i1, %arg3: i1):
          %247 = "arith.andi"(%arg1, %arg2) : (i1, i1) -> i1
          %248 = "arith.ori"(%arg3, %247) : (i1, i1) -> i1
          "linalg.yield"(%248) : (i1) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<13x13xi1>, tensor<13x13xi1>, tensor<13x13xi1>) -> tensor<13x13xi1>
        %238 = "arith.floordivsi"(%116, %83) : (i32, i32) -> i32
        %239 = "arith.shrui"(%127, %127) : (i1, i1) -> i1
        %240 = "tensor.empty"() : () -> tensor<25xf32>
        %241 = "vector.broadcast"(%161) : (f32) -> vector<25xf32>
        %242 = "vector.gather"(%240, %36, %154, %153, %241) : (tensor<25xf32>, index, vector<25xi32>, vector<25xi1>, vector<25xf32>) -> vector<25xf32>
        %243 = "math.fpowi"(%150, %4) <{fastmath = #arith.fastmath<none>}> : (f16, i32) -> f16
        %244 = "math.ceil"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13xf16>) -> tensor<?x13xf16>
        %245 = "tensor.empty"(%20) : (index) -> tensor<?xi1>
        %246 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<25xf16>
        "affine.yield"(%246) : (memref<25xf16>) -> ()
      }) {condition = affine_set<(d0) : (d0 >= 0)>} : (index) -> memref<25xf16>
      %220 = "index.sizeof"() : () -> index
      %221 = "arith.remsi"(%143, %87) : (i1, i1) -> i1
      "scf.execute_region"() ({
        %236 = "tensor.insert"(%143, %61, %16, %20) : (i1, tensor<?x13xi1>, index, index) -> tensor<?x13xi1>
        %237 = "arith.xori"(%104, %143) : (i1, i1) -> i1
        %238 = "arith.constant"() <{value = 249657630 : i32}> : () -> i32
        %239 = "index.mul"(%35, %129) : (index, index) -> index
        %240 = "index.ceildivu"(%23, %33) : (index, index) -> index
        %241 = "vector.insert"(%87, %153) <{static_position = array<i64: 9>}> : (i1, vector<25xi1>) -> vector<25xi1>
        %242 = "math.absi"(%57) : (tensor<13x13xi1>) -> tensor<13x13xi1>
        %243 = "arith.divf"(%82, %6) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %244 = "vector.splat"(%104) : (i1) -> vector<13x13xi1>
        %245 = "math.floor"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13xf16>) -> tensor<?x13xf16>
        %246 = "arith.floordivsi"(%116, %14) : (i32, i32) -> i32
        %247 = "arith.floordivsi"(%7, %9) : (i16, i16) -> i16
        %248 = "vector.splat"(%25) : (index) -> vector<13x13xindex>
        %249 = "arith.cmpi"(%127, %127) <{predicate = 8 : i64}> : (i1, i1) -> i1
        %250 = "tensor.cast"(%55) : (tensor<27xf32>) -> tensor<?xf32>
        %251 = "index.sizeof"() : () -> index
        "scf.yield"() : () -> ()
      }) : () -> ()
      %222 = "arith.shrui"(%126, %87) : (i1, i1) -> i1
      %223 = "arith.floordivsi"(%120, %83) : (i32, i32) -> i32
      %224 = "tensor.empty"() : () -> tensor<13x25xf16>
      %225 = "tensor.empty"(%31) : (index) -> tensor<?x25xf16>
      %226 = "linalg.matmul"(%59, %224, %225) <{operandSegmentSizes = array<i32: 2, 1>}> ({
      ^bb0(%arg1: f16, %arg2: f16, %arg3: f16):
        %236 = "arith.mulf"(%arg1, %arg2) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %237 = "arith.addf"(%arg3, %236) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        "linalg.yield"(%237) : (f16) -> ()
      }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<?x13xf16>, tensor<13x25xf16>, tensor<?x25xf16>) -> tensor<?x25xf16>
      %227 = "scf.while"(%60) ({
      ^bb0(%arg1: tensor<?x27x13xi1>):
        %236 = "tensor.collapse_shape"(%151) <{reassociation = [[0, 1]]}> : (tensor<13x13xi16>) -> tensor<169xi16>
        "vector.print"(%141) <{punctuation = #vector.punctuation<newline>}> : (vector<13x13xi16>) -> ()
        %237 = "math.exp"(%108) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
        %238 = "index.divs"(%30, %31) : (index, index) -> index
        %239 = "index.casts"(%17) : (index) -> i32
        %240 = "tensor.cast"(%62) : (tensor<?x13xi64>) -> tensor<13x13xi64>
        %241 = "math.atan"(%144) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
        %242 = "math.roundeven"(%161) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %243 = "tensor.empty"(%33) : (index) -> tensor<?x27x13xi1>
        "scf.condition"(%85, %243) : (i1, tensor<?x27x13xi1>) -> ()
      }, {
      ^bb0(%arg1: tensor<?x27x13xi1>):
        %236 = "math.atan2"(%130, %161) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %237 = "arith.mulf"(%150, %109) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
        %238 = "math.ceil"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13xf16>) -> tensor<?x13xf16>
        %239 = "index.ceildivs"(%22, %98) : (index, index) -> index
        %240 = "arith.remui"(%126, %12) : (i1, i1) -> i1
        %241 = "arith.addf"(%86, %86) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
        %242 = "memref.alloc"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x17xf16>
        %243 = "tensor.empty"(%32) : (index) -> tensor<?x17xf16>
        %244 = "linalg.matmul"(%59, %242, %243) <{operandSegmentSizes = array<i32: 2, 1>}> ({
        ^bb0(%arg2: f16, %arg3: f16, %arg4: f16):
          %257 = "arith.mulf"(%arg2, %arg3) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
          %258 = "arith.addf"(%arg4, %257) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
          "linalg.yield"(%258) : (f16) -> ()
        }) {linalg.memoized_indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>]} : (tensor<?x13xf16>, memref<13x17xf16>, tensor<?x17xf16>) -> tensor<?x17xf16>
        %245 = "arith.subi"(%104, %12) : (i1, i1) -> i1
        %246 = "tensor.from_elements"(%118, %144, %109, %144, %8, %118, %150, %109, %109, %118, %11, %8, %109, %150, %144, %109, %150, %144, %150, %144, %144, %8, %118, %11, %8, %118, %150, %8, %8, %11, %8, %8, %144, %109, %109, %11, %11, %11, %144, %150, %118, %109, %150, %118, %109, %109, %109, %118, %11, %144, %109, %11, %8, %109, %109, %150, %118, %8, %150, %8, %8, %11, %118, %11, %8, %150, %109, %11, %109, %150, %118, %109, %118, %118, %11, %8, %109, %109, %144, %144, %109, %109, %118, %8, %11, %109, %150, %144, %118, %150, %150, %109, %109, %109, %11, %8, %109, %150, %8, %11, %150, %8, %8, %150, %8, %109, %11, %144, %8, %144, %150, %109, %150, %8, %8, %8, %11, %8, %150, %8, %150, %109, %8, %11, %118, %11, %8, %144, %8, %109, %8, %8, %11, %144, %150, %144, %118, %109, %150, %144, %11, %11, %11, %109, %144, %8, %118, %150, %11, %11, %150, %150, %150, %144, %109, %11, %11, %11, %11, %8, %8, %11, %150, %11, %118, %144, %11, %150, %118) : (f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16, f16) -> tensor<13x13xf16>
        %247 = "bufferization.clone"(%79) : (memref<13x13xf32>) -> memref<13x13xf32>
        %248 = "memref.alloca"() <{operandSegmentSizes = array<i32: 0, 0>}> : () -> memref<13x13xi64>
        %249 = "index.castu"(%20) : (index) -> i32
        %250 = "math.roundeven"(%91) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
        %251 = "math.exp"(%54) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf16>) -> tensor<?xf16>
        %252 = "vector.broadcast"(%150) : (f16) -> vector<17xf16>
        %253 = "vector.broadcast"(%127) : (i1) -> vector<17xi1>
        "vector.compressstore"(%64, %16, %253, %252) : (memref<?xf16>, index, vector<17xi1>, vector<17xf16>) -> ()
        %254 = "tensor.empty"() : () -> tensor<13xi1>
        %255 = "linalg.broadcast"(%107, %254) <{dimensions = array<i64: 0>}> ({
        ^bb0(%arg2: i1, %arg3: i1):
          "linalg.yield"(%arg2) : (i1) -> ()
        }) : (tensor<i1>, tensor<13xi1>) -> tensor<13xi1>
        %256 = "tensor.empty"(%24) : (index) -> tensor<?x27x13xi1>
        "scf.yield"(%256) : (tensor<?x27x13xi1>) -> ()
      }) : (tensor<?x27x13xi1>) -> tensor<?x27x13xi1>
      %228 = "arith.divsi"(%128, %104) : (i1, i1) -> i1
      %229 = "math.tan"(%150) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %230 = "arith.divf"(%150, %11) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %231 = "math.round"(%15) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      %232 = "index.shru"(%16, %17) : (index, index) -> index
      %233 = "index.maxs"(%43, %31) : (index, index) -> index
      %234 = "memref.load"(%75, %16, %20) <{nontemporal = false}> : (memref<?x13xi32>, index, index) -> i32
      %235 = "arith.subi"(%104, %142) : (i1, i1) -> i1
      "scf.yield"() : () -> ()
    }, {
      %219 = "math.absi"(%51) : (tensor<?xi64>) -> tensor<?xi64>
      %220 = "tensor.insert"(%13, %56, %16, %16, %22) : (i16, tensor<?x?x13xi16>, index, index, index) -> tensor<?x?x13xi16>
      "vector.print"(%152) <{punctuation = #vector.punctuation<newline>}> : (vector<25xi16>) -> ()
      %221 = "index.mul"(%35, %22) : (index, index) -> index
      %222 = "math.atan2"(%150, %8) <{fastmath = #arith.fastmath<none>}> : (f16, f16) -> f16
      %223 = "index.sizeof"() : () -> index
      %224 = "index.add"(%22, %40) : (index, index) -> index
      %225 = "vector.broadcast"(%5) : (i64) -> vector<i64>
      "vector.transfer_write"(%225, %arg0, %37, %19) <{operandSegmentSizes = array<i32: 1, 1, 2, 0>, permutation_map = affine_map<(d0, d1) -> ()>}> : (vector<i64>, memref<?x?xi64>, index, index) -> ()
      %226 = "math.absf"(%59) <{fastmath = #arith.fastmath<none>}> : (tensor<?x13xf16>) -> tensor<?x13xf16>
      %227 = "arith.ori"(%120, %14) : (i32, i32) -> i32
      %228 = "arith.minsi"(%104, %12) : (i1, i1) -> i1
      %229 = "math.ctpop"(%137) : (tensor<27xi16>) -> tensor<27xi16>
      %230 = "affine.parallel"() <{lowerBoundsGroups = dense<1> : tensor<2xi32>, lowerBoundsMap = affine_map<() -> (0, 0)>, reductions = [4], steps = [1, 1], upperBoundsGroups = dense<1> : tensor<2xi32>, upperBoundsMap = affine_map<() -> (17, 13)>}> ({
      ^bb0(%arg1: index, %arg2: index):
        %234 = "vector.broadcast"(%142) : (i1) -> vector<2xi1>
        "vector.compressstore"(%230, %26, %17, %234, %93) : (memref<17x13xi32>, index, index, vector<2xi1>, vector<2xi32>) -> ()
        "affine.yield"(%116) : (i32) -> ()
      }) : () -> memref<17x13xi32>
      %231 = "affine.for"(%21) <{lowerBoundMap = affine_map<() -> (0)>, operandSegmentSizes = array<i32: 0, 0, 1>, step = 1 : index, upperBoundMap = affine_map<() -> (87)>}> ({
      ^bb0(%arg1: index, %arg2: index):
        "affine.yield"(%21) : (index) -> ()
      }) : (index) -> index
      %232 = "math.rsqrt"(%50) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
      %233 = "vector.reduction"(%152) <{fastmath = #arith.fastmath<none>, kind = #vector.kind<minsi>}> : (vector<25xi16>) -> i16
      "scf.yield"() : () -> ()
    }) : (index) -> ()
    %164 = "spirv.CL.fabs"(%91) : (f32) -> f32
    %165 = "tensor.rank"(%151) : (tensor<13x13xi16>) -> index
    %166 = "spirv.GL.SMin"(%93, %93) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %167 = "spirv.GL.Tan"(%109) : (f16) -> f16
    %168 = "spirv.BitwiseXor"(%93, %93) : (vector<2xi32>, vector<2xi32>) -> vector<2xi32>
    %169 = "spirv.GL.Fma"(%11, %8, %144) : (f16, f16, f16) -> f16
    %170 = "index.add"(%46, %27) : (index, index) -> index
    %171 = "vector.load"(%67, %16, %16, %18) : (memref<?x?x13xi16>, index, index, index) -> vector<13x13xi16>
    %172 = "spirv.GL.Cosh"(%100) : (f32) -> f32
    %173 = "spirv.BitFieldSExtract"(%93, %13, %4) : (vector<2xi32>, i16, i32) -> vector<2xi32>
    %174 = "arith.addi"(%126, %104) : (i1, i1) -> i1
    %175 = "spirv.GL.Cosh"(%15) : (f32) -> f32
    %176 = "spirv.GL.SClamp"(%14, %116, %120) : (i32, i32, i32) -> i32
    %177 = "affine.max"(%24, %31, %146, %40) <{map = affine_map<(d0, d1, d2, d3) -> (d1 + 16)>}> : (index, index, index, index) -> index
    %178 = "index.castu"(%111) : (i64) -> index
    %179 = "scf.if"(%104) ({
      %219 = "arith.cmpi"(%127, %142) <{predicate = 4 : i64}> : (i1, i1) -> i1
      %220 = "math.roundeven"(%50) <{fastmath = #arith.fastmath<none>}> : (tensor<?xf32>) -> tensor<?xf32>
      %221 = "vector.extract"(%152) <{static_position = array<i64: 14>}> : (vector<25xi16>) -> i16
      %222 = "vector.transpose"(%156) <{transp = [0]}> : (vector<5xi16>) -> vector<5xi16>
      %223 = "math.copysign"(%122, %100) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      "affine.for"() <{lowerBoundMap = affine_map<() -> (0)>, operandSegmentSizes = array<i32: 0, 0, 0>, step = 1 : index, upperBoundMap = affine_map<() -> (63)>}> ({
      ^bb0(%arg1: index):
        "affine.yield"() : () -> ()
      }) : () -> ()
      %224 = "math.tanh"(%144) <{fastmath = #arith.fastmath<none>}> : (f16) -> f16
      %225 = "math.exp"(%15) <{fastmath = #arith.fastmath<none>}> : (f32) -> f32
      "scf.yield"(%7) : (i16) -> ()
    }, {
      %219 = "affine.if"(%41) ({
        %227 = "memref.alloc"(%38) <{operandSegmentSizes = array<i32: 1, 0>}> : (index) -> memref<13x?x27xi1>
        "linalg.transpose"(%60, %227) <{permutation = array<i64: 2, 0, 1>}> ({
        ^bb0(%arg1: i1, %arg2: i1):
